[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T21:31:01.871098+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T13:00:00+00:00",
        "description": "<p dir=\"ltr\">At the beginning of 2025, I fully believed I had grown tired of stories about multiple timelines. During the past decade, the Marvel Cinematic Universe pushed the classic comic book narrative device into the mainstream, fueling a film conglomerate with legally approved cameos, flashy visuals on the silver screen, and loose plots that, eventually, came together for one final pay-off.</p><p dir=\"ltr\">While the concept of the multiverse has been explored in film and TV even before Marvel's takeover, it quickly became the narrative foundation of choice. When done right, the potential is undeniable--works like Spider-Man: Into the Spider-Verse and Everything, Everywhere, All at Once are heartwrenching displays of interpersonal relationships, making characters face the reality of what-if scenarios, reconciling with their choices and what could have been if they had turned the other way instead. But you can only hear the same tune so many times before it starts to lose its origi",
        "id": 4452331,
        "language": "en-US",
        "link": "https://www.gamespot.com/articles/the-hundred-line-last-defense-academy-is-the-ultimate-what-if-game/1100-6537033/?ftag=CAD-01-10abi2f",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/4625576-hundred-line.jpg",
        "title": "The Hundred Line: Last Defense Academy Is The Ultimate \"What If\" Game",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T14:42:56.283866+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T06:00:00+00:00",
        "description": "<p dir=\"ltr\">Obsidian's <a href=\"https://www.gamespot.com/games/avowed/\">Avowed</a> is one of the better action-RPGs released in 2025. While it doesn't reinvent any particular wheel, it benefits from an engaging campaign, fun combat systems, and charming characters. Aside from the occasional bug--a common element of Obsidian's open-world games--and an overabundance of homicidal bears, I liked nearly everything about the game. That includes Avowed's most controversial game mechanic: enemy respawns, or the lack thereof.</p><p dir=\"ltr\">When it comes to RPGs, players often think of a few key elements. Some sort of leveling system, quest-granting NPCs, obtainable loot that bolsters certain \"builds\" or playstyles--you know, the basics. One feature that's common but maybe not as notable, considering its use in other genres, is respawning enemies. Players often expect areas to repopulate with baddies whenever they return to a given location. Avowed isn't about that life though--at least, not",
        "id": 4450168,
        "language": "en-US",
        "link": "https://www.gamespot.com/articles/best-of-2025-avoweds-most-controversial-feature-is-also-one-of-its-best/1100-6536983/?ftag=CAD-01-10abi2f",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/4625581-avowed-1.jpg",
        "title": "Best Of 2025: Avowed's Most Controversial Feature Is Also One Of Its Best",
        "vote": 0
    }
]