[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T16:37:37.989075+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T15:30:00+00:00",
        "description": "It’s something of a rarity for a game to feel just as fresh and good to play 15 years after its release date. Most games start feeling redundant or even janky after one or two console cycles, but we’ve curated a list of 15 games that don’t succumb that fate. \n\nOur list of 15 games still look and feel amazing today without any mods or remastering. It’s rather ironic how many of these games have received remakes or remasters considering how remarkably the originals hold up today. But that just shows how iconic and beloved each of these heavyweight titles is in the minds of gamers around the world.",
        "id": 4450845,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=J8rUWUEx_og",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/J8rUWUEx_og/hqdefault.jpg",
        "title": "15 OLD Games That Put Modern Releases To Shame",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T09:57:13.847798+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T09:30:00+00:00",
        "description": "There are perhaps a very select few franchises that enjoy the same amount of mainstream attention as Grand Theft Auto. It feels safe to say that Grand Theft Auto has transcended from another highly successful video game franchise to something that’s etched into the very fabric of pop culture itself - and the recent revelations surrounding the impending release of its next entry are a testament to this notion. \n\nIf you haven’t been living under a rock for the past couple of years, you would know that Grand Theft Auto 6 is easily one of the biggest events in gaming. The original teaser for the game surpassed 260 million views, making it the most viewed video on a platform that is usually dominated by music videos or trailers showing off the latest movies.",
        "id": 4448875,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=4BLCTYjNqzI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4BLCTYjNqzI/hqdefault.jpg",
        "title": "GTA 6 - 10 Reasons Why It Is Every Player's MOST WANTED Game of 2026",
        "vote": 0
    }
]