[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T23:12:29.840117+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T22:30:00+00:00",
        "description": "Every human body contains a small population of cells that are not genetically its own -- cells that crossed the placenta during pregnancy and that persist for decades after birth. These \"microchimeric\" cells, named after the lion-goat-serpent hybrid of Greek mythology, have been found in every organ studied so far, though they are exceedingly rare: one such cell exists for every 10,000 to 1 million of a person's own cells. \n\nThe cells were first noticed in the late 1800s when pathologist Georg Schmorl described placenta-like \"giant cells\" in the lungs of people who had died from eclampsia. In 1969, researchers detected Y-chromosome-containing white blood cells in people who would later give birth to boys. For more than two decades, scientists presumed these cells were temporary. That changed in 1993 when geneticist Diana Bianchi found Y-chromosome cells in women who had given birth to sons up to 27 years earlier. \n\nThe cells appear to have regenerative properties, transforming into b",
        "id": 4452757,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/01/1758214/some-of-your-cells-are-not-genetically-yours",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some of Your Cells Are Not Genetically Yours",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T21:42:31.844605+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T21:10:00+00:00",
        "description": "Costco's consistency -- from its $1.50 hot dog and drink combo to its functional shopping carts and satisfied employees -- has produced what The Atlantic calls a \"cultlike loyalty\" among members at more than 600 locations across the U.S. \n\nIts annual membership costs $65. The model traces back to Fedco, a nonprofit wholesale collective for federal employees founded in Los Angeles in the 1940s. Costco's private label Kirkland Signature has become one of the world's largest consumer packaged goods brands while maintaining deliberately understated branding. The company relies on word-of-mouth marketing from satisfied members rather than traditional advertising. \n\nAtlantic staff writer Jake Lundberg, who shops at the Granger, Indiana location, describes the stores as spaces of \"cooperation, courtesy, and grown-ups mostly acting like grown-ups.\" Shoppers follow unwritten rules: move along, don't block the way, step aside to check your phone. Checkout lines form orderly queues. The exceptio",
        "id": 4452382,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/01/1752221/the-cult-of-costco",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'The Cult of Costco'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T20:30:19.632022+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T20:11:00+00:00",
        "description": "Iran is offering to sell advanced weapons systems including ballistic missiles, drones and warships to foreign governments for cryptocurrency, in a bid to use digital assets to bypass western financial controls. From a report: Iran's Ministry of Defence Export Center, known as Mindex, says it is prepared to negotiate military contracts that allow payment in digital currencies, as well as through barter arrangements and Iranian rials, according to promotional documents and payment terms analysed by the Financial Times. \n\nThe offer, introduced during the past year, appears to mark one of the first known instances in which a nation state has publicly indicated its willingness to accept cryptocurrency as payment for the export of strategic military hardware. Mindex, a state-run body responsible for Iran's overseas defence sales, says it has client relationships with 35 countries and advertises a catalogue of weapons that includes Emad ballistic missiles, Shahed drones, Shahid Soleimani-cl",
        "id": 4452057,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/01/1744208/iran-offers-to-sell-advanced-weapons-systems-for-crypto",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Iran Offers To Sell Advanced Weapons Systems For Crypto",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T19:22:02.285780+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T18:40:00+00:00",
        "description": "Three decades after RFC 1883 promised to future-proof the internet by expanding the available pool of IP addresses from around 4.3 billion to over 340 undecillion, IPv6 has yet to achieve the dominance its creators envisioned. Data from Google, APNIC and Cloudflare analyzed by The Register shows less than half of all internet users rely on IPv6 today. \n\n\"IPv6 was an extremely conservative protocol that changed as little as possible,\" APNIC chief scientist Geoff Huston told The Register. \"It was a classic case of mis-design by committee.\" The protocol's lack of backward compatibility with IPv4 meant users had to choose one or run both in parallel. Network address translation, which allows thousands of devices to share a single public IPv4 address, gave operators an easier path forward. Huston adds: \"These days the Domain Name Service (DNS) is the service selector, not the IP address,\" Huston told The Register. \"The entire security framework of today's Internet is name based and the wor",
        "id": 4451719,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/01/1833202/ipv6-just-turned-30-and-still-hasnt-taken-over-the-world-but-dont-call-it-a-failure",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'IPv6 Just Turned 30 and Still Hasn't Taken Over the World, But Don't Call It a Failure'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T18:14:05.737421+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T18:11:00+00:00",
        "description": "An anonymous reader shares a report: Only the government could spend 20 years creating a national ID that no one wanted and that apparently doesn't even work as a national ID. But that's what the federal government has accomplished with the REAL ID, which the Department of Homeland Security (DHS) now considers unreliable, even though getting one requires providing proof of citizenship or lawful status in the country. \n\nIn a December 11 court filing [PDF], Philip Lavoie, the acting assistant special agent in charge of DHS' Mobile, Alabama, office, stated that, \"REAL ID can be unreliable to confirm U.S. citizenship.\" Lavoie's declaration was in response to a federal civil rights lawsuit filed in October by the Institute for Justice, a public-interest law firm, on behalf of Leo Garcia Venegas, an Alabama construction worker. Venegas was detained twice in May and June during immigration raids on private construction sites, despite being a U.S. citizen. In both instances, Venegas' lawsuit ",
        "id": 4451389,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/01/1736221/dhs-says-real-id-which-dhs-certifies-is-too-unreliable-to-confirm-us-citizenship",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DHS Says REAL ID, Which DHS Certifies, Is Too Unreliable To Confirm US Citizenship",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T18:14:05.895219+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T17:12:00+00:00",
        "description": "As the calendar flips to January 1, 2026, thousands of copyrighted works from 1930 are entering the US public domain alongside sound recordings from 1925, making them free to copy, share, remix and build upon without permission or licensing fees. The literary haul includes William Faulkner's As I Lay Dying, Dashiell Hammett's full novel The Maltese Falcon, Agatha Christie's first Miss Marple mystery The Murder at the Vicarage, and the first four Nancy Drew books. The popular illustrated version of The Little Engine That Could also joins the commons. Betty Boop makes her public domain debut through her first appearance in the Fleischer Studios cartoon Dizzy Dishes. \n\nThe original iteration of Disney's Pluto -- then named Rover -- enters as well. Nine additional Mickey Mouse cartoons and ten Silly Symphonies from 1930 are now available for reuse. Films entering the public domain include the Academy Award-winning All Quiet on the Western Front, the Marx Brothers' Animal Crackers, and Joh",
        "id": 4451390,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/01/1712212/public-domain-day-2026-brings-betty-boop-nancy-drew-and-i-got-rhythm-into-the-commons",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Public Domain Day 2026 Brings Betty Boop, Nancy Drew and 'I Got Rhythm' Into the Commons",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T17:06:50.038263+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T16:01:00+00:00",
        "description": "The European Space Agency has acknowledged yet another security incident after a cybercriminal posted an offer on BreachForums the day after Christmas claiming to have stolen over 20GB of data including source code, confidential documents, API tokens and credentials. \n\nThe attacker claims they gained access to ESA-linked external servers on December 18 and remained connected for about a week, during which they allegedly exfiltrated private Bitbucket repositories, CI/CD pipelines, Terraform files and hardcoded credentials. ESA said that the breach may have affected only \"a very small number of external servers\" used for unclassified engineering and scientific collaboration, and that it has initiated a forensic security analysis.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=European+Space+Agency+Acknowledges+Another+Breach+as+Criminals+Claim+200+GB+Data+Haul%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F26%2F01%2F01%2F",
        "id": 4450999,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/01/1525235/european-space-agency-acknowledges-another-breach-as-criminals-claim-200-gb-data-haul",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "European Space Agency Acknowledges Another Breach as Criminals Claim 200 GB Data Haul",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T15:59:33.349714+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T15:00:00+00:00",
        "description": "Mark Thomson, a professor of experimental particle physics at the University of Cambridge, takes over as CERN's director general this week, and one of his first major decisions during his five-year tenure will be shutting down the Large Hadron Collider for an extended upgrade. The shutdown starts in June to make way for the high-luminosity LHC -- a major overhaul involving powerful new superconducting magnets that will squeeze the collider's proton beams and increase their brightness. The upgrade will raise collisions tenfold and strengthen the detectors to better capture subtle signs of new physics. The machine won't restart until Thomson's term is nearly over. \n\nThomson is far from disconsolate about the downtime. \"The machine is running brilliantly and we're recording huge amounts of data,\" he told The Guardian. \"There's going to be plenty to analyse over the period.\" Beyond the upgrade, Thomson must shepherd CERN's plans for the Future Circular Collider, a proposed 91km machine mo",
        "id": 4450626,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/01/1455227/the-man-taking-over-the-large-hadron-collider",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Man Taking Over the Large Hadron Collider",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T14:52:39.504678+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T14:00:00+00:00",
        "description": "Instagram head Adam Mosseri closed out 2025 by acknowledging what many have long suspected: the era of trusting photographs as accurate records of reality is over, and the platform he runs will need to fundamentally adapt to an age of \"infinite synthetic content.\" \n\nIn a slideshow posted to Instagram, Mosseri wrote that for most of his life he could safely assume photographs or videos were largely accurate captures of moments that happened, adding that this is clearly no longer the case. He predicted a shift from assuming what we see is real by default to starting with skepticism and paying attention to who is sharing something and why.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=You+Can't+Trust+Your+Eyes+To+Tell+You+What's+Real+Anymore%2C+Says+Instagram+Head%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F26%2F01%2F01%2F1355226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitte",
        "id": 4450236,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/01/1355226/you-cant-trust-your-eyes-to-tell-you-whats-real-anymore-says-instagram-head",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "You Can't Trust Your Eyes To Tell You What's Real Anymore, Says Instagram Head",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T13:44:43.306000+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the San Francisco Chronicle: A long stretch of curb in San Francisco's Mission District might contain a whole menagerie of parked vehicles: hatchbacks, SUVs, dusty pick-ups, chic Teslas. And recently, Waymo robotaxis. That's what Kyle Grochmal saw walking through the northeast Mission District on Monday afternoon. Cutting down York Street, he glimpsed a tell-tale white electric Jaguar in one of the coveted one-hour spots, its sensors spinning. The Waymo sat there for at least 20 minutes, Grochmal said. He whipped out his cell phone and started recording. After the Waymo drove off, another one showed up within an hour and took the same spot.\n \n\"This is something I started to notice about six months ago,\" Grochmal said, recalling how disorienting it was to be strolling down a largely deserted sidewalk, and suddenly hear the purring motor and soft click of autonomous vehicle cameras. He'd look up to see a Waymo \"just sitting there, not loading any",
        "id": 4449847,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/31/2232231/waymos-are-now-coming-for-your-coveted-san-francisco-parking-spots",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymos Are Now Coming For Your Coveted San Francisco Parking Spots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T10:25:51.546925+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T10:00:00+00:00",
        "description": "A UK-based company has successfully powered up a microwave-sized space factory in orbit, proving it can run a 1,000C furnace to manufacture ultra-pure semiconductor materials in microgravity. \"The work that we're doing now is allowing us to create semiconductors up to 4,000 times purer in space than we can currently make here today,\" says Josh Western, CEO of Space Forge. \"This sort of semiconductor would go on to be in the 5G tower in which you get your mobile phone signal, it's going to be in the car charger you plug an EV into, it's going to be in the latest planes.\" The BBC reports: Conditions in space are ideal for making semiconductors, which have the atoms they're made of arranged in a highly ordered 3D structure. When they are being manufactured in a weightless environment, those atoms line up absolutely perfectly. The vacuum of space also means that contaminants can't sneak in. The purer and more ordered a semiconductor is, the better it works.\n \n[...] The company's mini-fact",
        "id": 4448967,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/31/2224224/uk-company-sends-factory-with-1000c-furnace-into-space",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Company Sends Factory With 1,000C Furnace Into Space",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T07:11:28.184160+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T07:00:00+00:00",
        "description": "NASA is closing its largest research library at the Goddard Space Flight Center amid budget cuts and campus consolidation, putting tens of thousands of largely non-digitized historical and scientific documents at risk of being warehoused or discarded. The New York Times reports: Jacob Richmond, a NASA spokesman, said the agency would review the library holdings over the next 60 days and some material would be stored in a government warehouse while the rest would be tossed away. \"This process is an established method that is used by federal agencies to properly dispose of federally owned property,\" Mr. Richmond said.\n \nThe shutdown of the library at NASA's Goddard Space Flight Center in Greenbelt, Md., is part of a larger reorganization under the Trump administration that includes the closure of 13 buildings and more than 100 science and engineering laboratories on the 1,270-acre campus by March 2026. \"This is a consolidation not a closure,\" said NASA spokeswoman Bethany Stevens. The c",
        "id": 4448267,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/31/2216247/nasas-largest-library-is-closing-amid-staff-and-lab-cuts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA's Largest Library Is Closing Amid Staff and Lab Cuts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T03:46:49.876302+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: For a while, it seemed the notion that light drinking was good for the heart had gone by the wayside, debunked by new studies and overshadowed by warnings that alcohol causes cancer. Now the American Heart Association has revived the idea in a scientific review that is drawing intense criticism, setting off a new round of debate about alcohol consumption. The paper, which sought to summarize the latest research and was aimed at practicing cardiologists, concluded that light drinking -- one to two drinks a day -- posed no risk for coronary disease, stroke, sudden death and possibly heart failure, and may even reduce the risk of developing these conditions.\n \nControversy over the influential organization's review has been simmering since it was published in the association's journal Circulation in July. Public health groups and many doctors have warned on the basis of recent studies that alcohol can be harmful even in small am",
        "id": 4447668,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/31/2014258/heart-association-revives-theory-that-light-drinking-may-be-good-for-you",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Heart Association Revives Theory That Light Drinking May Be Good For You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T01:39:36.776239+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T01:10:00+00:00",
        "description": "Warren Buffett is retiring as CEO of Berkshire Hathaway at age 95, ending a 55-year run that reshaped how generations of Americans think about investing. \"The 95-year-old, often referred to as the 'Oracle of Omaha' and the 'billionaire next door,' will relinquish the title after a career that saw him turn a failing textile firm into one of the most successful asset managers in the world,\" reports NBC News. From the report: Greg Abel, the 63-year-old lesser-known CEO of Berkshire's energy business, will take the helm of the conglomerate on Thursday. Buffett will remain its chairman.\n \nUnder Buffett's leadership, Nebraska-based Berkshire has thrived at the intersection of Wall Street and Main Street, with investments in industries ranging from railroads and insurance to candy and ice cream.\n \nAlong the way, while living in the same house he bought for just over $30,000 in the late 1950s, he redefined investing for the American public with his folksy and practical advice, became one of t",
        "id": 4447313,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/31/226259/warren-buffett-retires-as-berkshire-hathaway-ceo-after-55-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Warren Buffett Retires As Berkshire Hathaway CEO After 55 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T01:39:36.873379+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T00:50:00+00:00",
        "description": "Pibroch(CiH) writes: According to the obituary linked, Stewart Cheifet of Computer Chronicles fame has died. The obituary states he passed Dec 28, 2025. Cheifet and Digital Research founder Gary Kildall hosted the public television show The Computer Chronicles starting in 1984, and Stewart continued to host the show well into the 1990s. He was well-known for his affable presence and adeptness at interviewing guests and finding out the straight dope about their products. He had recently undergone spinal surgery and had somewhat disappeared from public view after the death of his wife Peta in 2024.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Stewart+Cheifet%2C+Computer+Chronicles+Host%2C+Dies+At+87%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F12%2F31%2F2149206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.",
        "id": 4447314,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/31/2149206/stewart-cheifet-computer-chronicles-host-dies-at-87",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Stewart Cheifet, Computer Chronicles Host, Dies At 87",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-01T00:35:16.877813+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-01T00:30:00+00:00",
        "description": "The Wall Street Journal reports that a growing number of tech startups are stocking offices with free nicotine pouches as founders and employees chase sharper focus and stamina in hyper-competitive AI-era work environments. The Wall Street Journal reports: Earlier this year, two nicotine startups -- Lucy Nicotine and Sesh -- made branded vending machines filled with flavored products for analytics company Palantir Technologies. Both machines are in the company's Washington, D.C., offices. The pouches are free for employees and guests over the age of 21, a spokeswoman for Palantir said. Palantir pays to stock the nicotine products.\n \nAlex Cohen, a startup founder based in Austin, Texas, said he was first exposed to nicotine pouches in the workplace after seeing tins of Zyns on the desks of his software engineers. His company, Hello Patient, makes AI-powered healthcare-communication software. \"They were very productive, so I thought maybe there's something here,\" he said. Those engineer",
        "id": 4447000,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/31/2238231/tech-startups-are-handing-out-free-nicotine-pouches-to-boost-productivity",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tech Startups Are Handing Out Free Nicotine Pouches to Boost Productivity",
        "vote": 0
    }
]