[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T23:53:34.281064+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T23:20:00+00:00",
        "description": "Longtime Slashdot reader chicksdaddy writes: CES, the Consumer Electronics Show, isn't just about shiny new gadgets. As AP reports, this year brought back the fifth annual Worst in Show anti-awards, calling out the most harmful, wasteful, invasive, and unfixable tech at the Las Vegas show. The coalition behind the awards -- including Repair.org, iFixit, EFF, PIRG, Secure Repairs, and others -- put the spotlight on products that miss the point of innovation and make life worse for users.\n \n2026 Worst in Show winners include:\n \nOverall (and Repairability): Samsung's AI-packed Family Hub Fridge -- over-engineered, hard to fix, and trying to do everything but keep food cold.\n\nPrivacy: Amazon Ring AI -- expanding surveillance with features like facial recognition and mobile towers.\n\nSecurity: Merach UltraTread treadmill -- an AI fitness coach that also hoovers up sensitive data with weak security guarantees, including a privacy policy that declares the company \"cannot guarantee the securit",
        "id": 4520606,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/09/216254/ces-worst-in-show-awards-call-out-the-tech-making-things-worse",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CES Worst In Show Awards Call Out the Tech Making Things Worse",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T23:53:34.500596+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T22:40:00+00:00",
        "description": "Valve has added the NTSYNC kernel driver to the SteamOS 3.7.20 beta, laying the groundwork for improved Windows game synchronization performance via Wine and Proton. Phoronix reports: For gearing up for that future Proton NTSYNC support, SteamOS 3.7.20 enables the NTSYNC kernel driver and loads the module by default. Most Linux distributions are at least already building the NTSYNC kernel module though there's been different efforts on how to handle ensuring it's loaded when needed. The presence of the NTSYC kernel driver is the main highlight of the SteamOS 3.7.20 beta now available for testing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Latest+SteamOS+Beta+Now+Includes+NTSYNC+Kernel+Driver%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F26%2F01%2F09%2F2058210%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.faceboo",
        "id": 4520607,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/26/01/09/2058210/latest-steamos-beta-now-includes-ntsync-kernel-driver",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Latest SteamOS Beta Now Includes NTSYNC Kernel Driver",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T22:39:57.013779+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T22:02:00+00:00",
        "description": "An anonymous reader quotes a report from TorrentFreak: Italy's communications regulator AGCOM imposed a record-breaking 14.2 million-euro fine on Cloudflare after the company failed to implement the required piracy blocking measures. Cloudflare argued that filtering its global 1.1.1.1 DNS resolver would be \"impossible\" without hurting overall performance. AGCOM disagreed, noting that Cloudflare is not necessarily a neutral intermediary either.\n \n[...] \"The measure, in addition to being one of the first financial penalties imposed in the copyright sector, is particularly significant given the role played by Cloudflare\" AGCOM notes, adding that Cloudflare is linked to roughly 70% of the pirate sites targeted under its regime. In its detailed analysis, the regulator further highlighted that Cloudflare's cooperation is \"essential\" for the enforcement of Italian anti-piracy laws, as its services allow pirate sites to evade standard blocking measures.\n \nCloudflare has strongly contested the",
        "id": 4520085,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/09/2052239/italy-fines-cloudflare-14-million-euros-for-refusing-to-filter-pirate-sites-on-public-1111-dns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Italy Fines Cloudflare 14 Million Euros For Refusing To Filter Pirate Sites On Public 1.1.1.1 DNS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T22:39:57.178385+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T21:25:00+00:00",
        "description": "An anonymous reader shares a report: Microsoft is celebrating the resurgence of interest in physical media in the only way it knows how... by halting the Windows Media Player metadata service. Readers of a certain vintage will remember inserting a CD into their PC and watching Windows Media Player populate with track listings and album artwork. No more. \n\nSometime before Christmas, the metadata servers stopped working and on Windows 10 or 11, the result is the same: album not found. We tried this out at Vulture Central on some sacrificial Windows devices that had media drives and can confirm that a variety of compact discs were met with stony indifference. Some 90s cheese that was successfully ripped (for personal use, of course) decades ago? No longer recognized. A reissue of something achingly hip? Also not recognized.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Windows+Media+Player+Stops+Serving+Up+C",
        "id": 4520086,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/09/1742218/microsoft-windows-media-player-stops-serving-up-cd-album-info",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Windows Media Player Stops Serving Up CD Album Info",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T21:28:36.049524+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T20:41:00+00:00",
        "description": "The abstract of a paper on NBER: School boards have statutory authority over most elementary and secondary education policies, but receive little attention compared to other actors in education systems. A fundamental challenge to understanding the importance of boards is the absence of data on the policy goals of board members -- i.e., their ideologies -- forcing researchers to conduct tests based on demographic and professional characteristics -- i.e., identities -- with which ideology is presumed to correlate. \n\nThis paper uses new data on the viewpoints and policy actions of school board members, coupled with a regression discontinuity design that generates quasi-random variation in board composition, to establish two results. The first is that the priorities of board members have large causal effects across many domains. For example, the effect of electing an equity-focused board member on test scores for low-income students is roughly equivalent to assigning every such student a ",
        "id": 4519604,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/09/1832229/identity-and-ideology-in-the-school-boardroom",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Identity and Ideology in the School Boardroom",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T20:09:25.712859+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T20:01:00+00:00",
        "description": "Microbiology had its golden age in the late nineteenth century, when researchers identified the bacterial causes of tuberculosis, cholera, typhoid, and a dozen other diseases in rapid succession. Antibiotics had theirs in the mid-twentieth century. Both booms eventually slowed. Vaccine development, by contrast, appears to be speeding up -- and the most productive era may still lie ahead, Works in Progress writes in a story. \n\nIn the first half of the 2020s alone, researchers delivered the first effective vaccines against four different diseases: Covid-19, malaria, RSV and chikungunya. No previous decade matched that output. The acceleration rests on infrastructure that took two centuries to assemble. Edward Jenner's 1796 smallpox vaccine was a lucky accident he didn't understand. Louis Pasteur needed ninety years to turn that luck into systematic methods -- attenuation and inactivation -- that could be applied to other diseases. Generations of scientists then built the supporting mach",
        "id": 4519096,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/09/1755211/the-golden-age-of-vaccine-development",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Golden Age of Vaccine Development",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T20:09:25.943481+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T19:25:00+00:00",
        "description": "The restaurant industry is trying to figure out whether America has hit peak pizza. From a report: Once the second-most common U.S. restaurant type, pizzerias are now outnumbered by coffee shops and Mexican food eateries, according to industry data. Sales growth at pizza restaurants has lagged behind the broader fast-food market for years, and the outlook ahead isn't much brighter. \n\n\"Pizza is disrupted right now,\" Ravi Thanawala, chief financial officer and North America president at Papa John's International, said in an interview. \"That's what the consumer tells us.\" The parent of the Pieology Pizzeria chain filed for chapter 11 bankruptcy protection in December. Others, including the parent of Anthony's Coal Fired Pizza &amp; Wings and Bertucci's Brick Oven Pizza &amp; Pasta, earlier filed for bankruptcy. \n\nPizza once was a novelty outside big U.S. cities, providing room for growth for independent shops and then chains such as Pizza Hut with its red roof dine-in restaurants. Purpos",
        "id": 4519098,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/09/1857257/america-is-falling-out-of-love-with-pizza",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America Is Falling Out of Love With Pizza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:56:05.504318+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T18:44:00+00:00",
        "description": "Amazon has begun equipping managers with a dashboard that tracks not just whether corporate employees show up to the office but how long they stay once they're there, according to an internal document obtained by Business Insider. The system, which started rolling out in December, flags \"Low-Time Badgers\" who average less than four hours daily over an eight-week period and \"Zero Badgers\" who don't badge into any building during that span.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon's+New+Manager+Dashboard+Flags+'Low-Time+Badgers'+and+'Zero+Badgers'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F26%2F01%2F09%2F1728223%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F26%2F01%2F09%2F1728223%2Famazons-new-manager-dashboard-flags-low-time-badgers-and-zero-bad",
        "id": 4518478,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/09/1728223/amazons-new-manager-dashboard-flags-low-time-badgers-and-zero-badgers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's New Manager Dashboard Flags 'Low-Time Badgers' and 'Zero Badgers'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:56:05.714211+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T18:05:00+00:00",
        "description": "Linus Torvalds has weighed in on an ongoing debate within the Linux kernel development community about whether documentation should explicitly address AI-generated code contributions, and his position is characteristically blunt: stop making it an issue. The Linux creator was responding to Oracle-affiliated kernel developer Lorenzo Stoakes, who had argued that treating LLMs as \"just another tool\" ignores the threat they pose to kernel quality. \"Thinking LLMs are 'just another tool' is to say effectively that the kernel is immune from this,\" Stoakes wrote. \n\nTorvalds disagreed sharply. \"There is zero point in talking about AI slop,\" he wrote. \"Because the AI slop people aren't going to document their patches as such.\" He called such discussions \"pointless posturing\" and said that kernel documentation is \"for good actors.\" The exchange comes as a team led by Intel's Dave Hansen works on guidelines for tool-generated contributions. Stoakes had pushed for language letting maintainers reje",
        "id": 4518479,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/26/01/09/1649237/torvalds-tells-kernel-devs-to-stop-debating-ai-slop---bad-actors-wont-follow-the-rules-anyway",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Torvalds Tells Kernel Devs To Stop Debating AI Slop - Bad Actors Won't Follow the Rules Anyway",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:56:06.061325+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:24:00+00:00",
        "description": "Craigslist, the 30-year-old classifieds site that looks virtually unchanged since the dial-up era, continues to draw more than 105 million monthly users and remains enormously profitable despite never spending a cent on advertising or marketing. The site ranks as the 40th most popular website in the United States, according to Internet data company Similarweb. \n\nUniversity of Pennsylvania associate professor Jessa Lingel called it the \"ungentrified\" Internet. Unlike Facebook Marketplace, Etsy, or DePop, Craigslist doesn't use algorithms to track users or predict what they want to see. There are no public profiles, no rating systems, no likes or shares. The site effectively disincentivizes the clout-chasing and virality-seeking that dominates platforms like TikTok and Instagram. \n\nCraigslist began in 1995 as an email list for a few hundred San Francisco Bay Area locals sharing events and job openings. Engineer Craig Newmark even recruited CEO Jim Buckmaster through a site ad. The two s",
        "id": 4518480,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/09/1618243/craigslist-at-30-no-algorithms-no-ads-no-problem",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Craigslist at 30: No Algorithms, No Ads, No Problem",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:56:06.349345+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T16:45:00+00:00",
        "description": "Apple's iOS 26 appears to be witnessing the slowest adoption rate in recent memory, with third-party analytics from StatCounter indicating that only 15 to 16% of active iPhones worldwide are running the operating system nearly four months after its September release. The figures stand in stark contrast to iOS 18, which had reached approximately 63% adoption by January 2025, and iOS 17, which hit 54% by January 2024. iOS 16 had surpassed 60% by January 2023. \n\nStatCounter's breakdown for January 2026 shows iOS 26.1 accounting for roughly 10.6% of devices, iOS 26.2 at about 4.6%, and the original iOS 26.0 at 1.1%. More than 60% of iPhones tracked by the analytics firm remain on iOS 18. \n\nMacRumors' own visitor data tells a similar story: 89.3% of the site's readers were on iOS 18 during the first week of January 2025, but only 25.7% are running iOS 26 during the same period this year. iOS 26 introduced Liquid Glass, a sweeping visual redesign that replaces much of the traditional opaque",
        "id": 4518481,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/09/162240/ios-26-shows-unusually-slow-adoption-months-after-release",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "iOS 26 Shows Unusually Slow Adoption Months After Release",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:56:06.554049+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T16:05:00+00:00",
        "description": "Amazon is now requiring its corporate employees to submit a list of three to five accomplishments that represent their best work as part of an overhauled performance review process, according to Business Insider, which cites internal documents. \n\nThe company's internal Forte review system previously asked employees softer questions like \"When you're at your best, how do you contribute?\" but the new standards place greater emphasis on individual productivity and specific deliverables. Amazon's roughly 350,000 corporate employees must also outline actions they plan to take to continue growing at the company.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Wants+To+Know+What+Every+Corporate+Employee+Accomplished+Last+Year%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F26%2F01%2F09%2F1545239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" ",
        "id": 4518482,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/09/1545239/amazon-wants-to-know-what-every-corporate-employee-accomplished-last-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Wants To Know What Every Corporate Employee Accomplished Last Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:40:41.202191+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:30:00+00:00",
        "description": "Microsoft is discontinuing its Send to Kindle integration in Word, ending a feature that allowed Microsoft 365 subscribers to send documents directly to their Kindle e-readers and preserve complex formatting through fixed layouts. \n\nThe company updated its documentation to announce that beginning February 9th, 2026, the Send to Kindle feature will no longer work across Web, Win32, and Mac platforms. Microsoft has not disclosed why it's killing the integration but recommends users switch to Amazon's official Send to Kindle app. The feature launched in 2023 and was particularly valued by Kindle Scribe owners who could annotate the transferred documents.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Send+To+Kindle+from+Microsoft+Word+is+Discontinued%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F26%2F01%2F09%2F1516254%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"",
        "id": 4517307,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/09/1516254/send-to-kindle-from-microsoft-word-is-discontinued",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Send To Kindle from Microsoft Word is Discontinued",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T15:34:28.105412+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T14:59:00+00:00",
        "description": "Abstract of a paper on NBER: We construct an international panel data set comprising three distinct yet plausible measures of government indebtedness: the debt-to-GDP, the interest-to-GDP, and the debt-to-equity ratios. Our analysis reveals that these measures yield differing conclusions about recent trends in government indebtedness. While the debt-to-GDP ratio has reached historically high levels, the other two indicators show either no clear trend or a declining pattern over recent decades. We argue for the development of stronger theoretical foundations for the measures employed in the literature, suggesting that, without such grounding, assertions about debt (un)sustainability may be premature.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Why+Care+About+Debt-to-GDP%3F%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F26%2F01%2F09%2F1459249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/s",
        "id": 4516653,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/09/1459249/why-care-about-debt-to-gdp",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Care About Debt-to-GDP?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T14:24:47.886440+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T14:07:00+00:00",
        "description": "The world's oceans absorbed yet another record-breaking amount of heat in 2025, continuing an almost unbroken streak of annual records since the start of the millennium and fueling increasingly extreme weather events around the globe. More than 90% of the heat trapped by humanity's carbon emissions ends up in the oceans, making ocean heat content one of the clearest indicators of the climate crisis's trajectory. \n\nThe analysis, published in the journal Advances in Atmospheric Sciences, drew on temperature data collected across the oceans and collated by three independent research teams. The measurements cover the top 2,000 meters of ocean depth, where most heat absorption occurs. The amount of heat absorbed is equivalent to more than 200 times the total electricity used by humans worldwide. \n\nThis extra thermal energy intensifies hurricanes and typhoons, produces heavier rainfall and greater flooding, and results in longer marine heatwaves that decimate ocean life. The oceans are like",
        "id": 4516051,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/09/148202/record-ocean-heat-is-intensifying-climate-disasters-data-shows",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Record Ocean Heat is Intensifying Climate Disasters, Data Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T10:53:23.792127+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T10:00:00+00:00",
        "description": "alternative_right shares a report from ScienceAlert: At the Experimental Advanced Superconducting Tokamak (EAST), physicists successfully exceeded what is known as the Greenwald limit, a practical density boundary beyond which plasmas tend to violently destabilize, often damaging reactor components. For a long time, the Greenwald limit was accepted as a given and incorporated into fusion reactor engineering. The new work shows that precise control over how the plasma is created and interacts with the reactor walls can push it beyond this limit into what physicists call a 'density-free' regime.\n \n[...] A team led by physicists Ping Zhu of Huazhong University of Science and Technology and Ning Yan of the Chinese Academy of Sciences designed an experiment to take this theory further, based on a simple premise: that the density limit is strongly influenced by the initial plasma-wall interactions as the reactor starts up. In their experiment, the researchers wanted to see if they could del",
        "id": 4514536,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/09/0319216/fusion-physicists-found-a-way-around-a-long-standing-density-limit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fusion Physicists Found a Way Around a Long-Standing Density Limit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T07:28:04.448827+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T07:00:00+00:00",
        "description": "Researchers at Stanford University have created a programmable synthetic \"skin\" that can independently change color and texture, \"a feat previously only available within the animal kingdom,\" reports the Register. From the report: The technique employs electron beams to write patterns and add optical layers that create color effects. When exposed to water, the film swells to reveal texture and colors independently, depending on which side of the material is exposed, according to a paper published in the scientific journal Nature this week. In an accompanying article, University of Stuttgart's Benjamin Renz and Na Liu said the researchers' \"most striking achievement was a photonic skin in which color and texture could be independently controlled, mirroring the separate regulation... in octopuses.\"\n \nThe research team used the polymer PEDOT:PSS, which can swell in water, as the basis for their material. Its reaction to water can be controlled by irradiating it with electrons, creating te",
        "id": 4513532,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/09/0312218/ultimate-camouflage-tech-mimics-octopus-in-scientific-first",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ultimate Camouflage Tech Mimics Octopus In Scientific First",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T04:12:26.233665+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from NPR: [I]t turns out that some genius dogs can learn a brand new word, like the name of an unfamiliar toy, by just overhearing brief interactions between two people. What's more, these \"gifted\" dogs can learn the name of a new toy even if they first hear this word when the toy is out of sight -- as long as their favorite human is looking at the spot where the toy is hidden. That's according to a new study in the journal Science. \"What we found in this study is that the dogs are using social communication. They're using these social cues to understand what the owners are talking about,\" says cognitive scientist Shany Dror of Eotvos Lorand University and the University of Veterinary Medicine, Vienna. \"This tells us that the ability to use social information is actually something that humans probably had before they had language,\" she says, \"and language was kind of hitchhiking on these social abilities.\"\n \n[...] \"There's only a very small group of",
        "id": 4512674,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/08/2249216/some-super-smart-dogs-can-learn-new-words-just-by-eavesdropping",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some Super-Smart Dogs Can Learn New Words Just By Eavesdropping",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T03:09:27.791046+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T02:10:00+00:00",
        "description": "YouTube is updating search filters so users can explicitly choose between Shorts and long-form videos. The change also replaces view-count sorting with a new \"Popularity\" filter and removes underperforming options like \"Sort by Rating.\" The Verge reports: Right now, a filter-less search shows a mix of longform and short form videos, which can be annoying if you just want to see videos in one format or the other. But in the new search filters, among other options, you can pick to see \"Videos,\" which in my testing has only showed a list of longform videos, or \"Shorts,\" which just shows Shorts.\n \nYouTube is also removing the \"Upload Date - Last Hour\" and \"Sort by Rating\" filters because they \"were not working as expected and had contributed to user complaints.\" The company will still offer other \"Upload Date\" filters, like \"Today,\" \"This week,\" \"This Month,\" and \"This Year,\" and you can also find popular videos with the new \"Popularity\" filter, which is replacing the \"View count\" sort op",
        "id": 4512417,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/08/2238227/youtube-will-now-let-you-filter-shorts-out-of-search-results",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Will Now Let You Filter Shorts Out of Search Results",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T02:04:31.178462+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T01:30:00+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Reuters: Billionaire entrepreneur Elon Musk persuaded a judge on Wednesday to allow a jury trial on his allegations that ChatGPT maker OpenAI violated its founding mission in its high-profile restructuring to a for-profit entity. Musk was a cofounder of OpenAI in 2015 but left in 2018 and now runs an AI company that competes with it.\n \nU.S. District Judge Yvonne Gonzalez Rogers in Oakland, California, said at a hearing that there was \"plenty of evidence\" suggesting OpenAI's leaders made assurances that its original nonprofit structure was going to be maintained. The judge said there were enough disputed facts to let a jury consider the claims at a trial scheduled for March, rather than decide the issues herself. She said she would issue a written order after the hearing that addresses OpenAI's bid to throw out the case.\n \n[...] Musk contends he contributed about $38 million, roughly 60% of OpenAI's early funding, along with strateg",
        "id": 4512095,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/08/2230229/lawsuit-over-openai-for-profit-conversion-can-head-to-trial-us-judge-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lawsuit Over OpenAI For-Profit Conversion Can Head To Trial, US Judge Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T01:00:19.496719+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T00:50:00+00:00",
        "description": "Illinois Department of Human Services disclosed that a misconfigured internal mapping website exposed sensitive personal data for more than 700,000 Illinois residents for over four years, from April 2021 to September 2025. Officials say they can't confirm whether the publicly accessible data was ever viewed. TechCrunch reports: Officials said the exposed data included personal information on 672,616 individuals who are Medicaid and Medicare Savings Program recipients. The data included their addresses, case numbers, and demographic data -- but not individuals' names. The exposed data also included names, addresses, case statuses, and other information relating to 32,401 individuals in receipt of services from the department's Division of Rehabilitation Services.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Illinois+Health+Department+Exposed+Over+700%2C000+Residents'+Personal+Data+For+Years%3A+https%3A%2F%2Fyro.sla",
        "id": 4511737,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/08/2217206/illinois-health-department-exposed-over-700000-residents-personal-data-for-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Illinois Health Department Exposed Over 700,000 Residents' Personal Data For Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T01:00:19.641451+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: Google is putting even more generative AI tools into Gmail as part of its goal to further personalize user inboxes and streamline searches. On Thursday, the company announced a new \"AI Inbox\" tab, currently in a beta testing phase, that reads every message in a user's Gmail and suggests a list of to-dos and key topics, based on what it summarizes. In Google's example of what this AI Inbox could look like in Gmail, the new tab takes context from a user's messages and suggests they reschedule their dentist appointment, reply to a request from their child's sports coach, and pay an upcoming fee before the deadline. Also under the AI Inbox tab is a list of important topics worth browsing, nestled beneath the action items at the top. Each suggested to-do and topic links back to the original email for more context and for verification.\n \n[...] For users who are concerned about their privacy, the information Google gleans by skimming through in",
        "id": 4511738,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/08/2212216/google-is-adding-an-ai-inbox-to-gmail-that-summarizes-emails",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Is Adding an 'AI Inbox' To Gmail That Summarizes Emails",
        "vote": 0
    }
]