[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:36.292805+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T18:00:54+00:00",
        "description": "We all make mistakes, but what if our most shameful moments are actually priceless gifts? In this powerful TEDx talk, backed by psychological research, Theresa M. Ward shares how a literal crash landing — and a series of emotional ones — taught her that our worst mistakes aren’t failures to hide, but truths to own. By confronting her missteps, from broken bones to broken trust, she discovered that our \"villainous\" moments aren't weakness, they're the birthplace of wise alignment, deep connection, and heroic growth. \n\nTheresa M. Ward spent over a decade in the financial technology space before starting her own consultancy in 2017. She now serves as a team effectiveness coach, helping professionals in any industry thrive with a sense of meaningful momentum at work. She lives in Atlanta, Georgia with her fiancé, where she loves to hike, practice yoga, and curl up with her senior dogs and a good book. \n\nThis talk was given at a TEDx event using the TED conference format but independently ",
        "id": 4518318,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gWBYhaufLqc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gWBYhaufLqc/hqdefault.jpg",
        "title": "Why your biggest mistakes might be your greatest gifts | Theresa Ward | TEDxTheHague",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:36.505745+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:42:18+00:00",
        "description": "In this talk, Daniel explores how AI agents are transforming mechanical engineering and product development, creating a new era where human creativity and intelligent systems work side by side.\nDiscover how digital co-workers are reshaping how we imagine, design, and build the world around\nus. The only question that remains: how soon will this future become reality? Daniel Siegel is the co-founder and managing director of Synera, a company reimagining how engineers create by helping them to build digital co-workers that think and collaborate like humans. With more than twenty years of experience in software development and engineering, he has helped some of the world’s leading companies in automotive, aerospace, and consumer goods rethink how products are designed and built. Having studied across six countries, Daniel brings a global perspective to technology, creativity, and innovation. Holding a Master’s in Business & Engineering and a Nanodegree in Deep Learning, he combines techni",
        "id": 4518319,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=tXymCjB25R8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tXymCjB25R8/hqdefault.jpg",
        "title": "The Moment You Can Clone Your Best Engineer | Daniel Siegel | TEDxHochschuleBremerhaven",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:36.687002+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:41:50+00:00",
        "description": "Growing up unheard taught Safa Younes the true cost of silence.\nIn this talk, she shares how change-making listening; listening to inner, social, and systemic realities - can transform pain into projects, and silenced voices into movements for social change. Safa Younes is a social worker, social entrepreneur, and women’s rights advocate whose work bridges healing, heritage, and social innovation. With over 18 years of experience in community development, she founded Arous Elbahar, a women’s organization in Jaffa that advances Arab women’s economic empowerment through financial literacy, entrepreneurship, and leadership training. \nBuilding on that foundation, she later established De Yaffa, a pioneering social enterprise that transforms authentic Arab hospitality into a space for cultural connection and sustainable employment for local women.\n\nThrough her initiatives and her counseling work with Arab families experiencing traumatic loss, Safa promotes what she calls “changemaking list",
        "id": 4518320,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IZMFkj8p6Nc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IZMFkj8p6Nc/hqdefault.jpg",
        "title": "The Cost of Silence & the Power of Change-making Listening | Safa Younes | TEDxJaffaWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:37.006753+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:40:50+00:00",
        "description": "En Medellín, el fútbol ha sido mucho más que un resultado. Sebastián Arango nos cuenta cómo Atlético Nacional ha acompañado a la ciudad en sus momentos más complejos y cómo, cuando el equipo se fortalece, también lo hace el tejido social. Entre historia, identidad y compromiso comunitario, emerge una idea clara: el fútbol puede convertirse en una fuerza silenciosa de inclusión, convivencia y esperanza colectiva. Sebastián Arango Botero es el presidente de Atlético Nacional, un club que él concibe no solo como un equipo de fútbol, sino como una de las plataformas de entretenimiento y transformación social más influyentes de Latinoamérica.\n\nConvencido de que el deporte tiene el poder de inspirar, educar y unir, ha impulsado una visión que conecta tradición, innovación y emoción, llevando a Nacional a entenderse como un movimiento cultural que trasciende la cancha. Como hincha, nunca soñó con ser presidente de Atlético Nacional. Hoy vive, como él mismo dice, el sueño que no soñó, guiado ",
        "id": 4518321,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MLFhP0fn3Bk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MLFhP0fn3Bk/hqdefault.jpg",
        "title": "Detrás del poder invisible del fútbol | Sebastián Arango | TEDxUniversidad EAFIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:37.312951+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:40:31+00:00",
        "description": "Our bodies often respond to spaces and technologies before our minds do. We are shaped by what we touch, see, and feel—often without realizing it.\n\nThis talk explores how materials, environments, and technologies act as extensions of the human body. Through responsive wearables, public art, and AI-driven installations, it examines how perception, power, and connection are negotiated through design. By rethinking perception as active rather than neutral, the talk invites us to imagine technologies that deepen awareness, empathy, and collective well-being. Behnaz Farahi is a designer, creative technologist and critical maker. Currently, she is an Assistant Professor at the MIT Media Lab, where she leads the Critical Matter Research Group. Trained as an architect, she explores how to foster an empathetic relationship between the human body and the space around it through the implementation of emerging technologies. Her goal is to enhance the interaction between human beings and the built",
        "id": 4518322,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pNjp8eB_fUc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pNjp8eB_fUc/hqdefault.jpg",
        "title": "Rethinking perception through design | Behnaz Farahi | TEDxMIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:37.648361+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:40:23+00:00",
        "description": "Inspired by the Voyager Golden Record, this conversation explores hip-hop as a cultural archive and a message to the universe. It examines hip-hop not just as a musical genre, but as a global language shaped by history, innovation, and collective memory. From its deep roots to its role as a living, evolving culture, the discussion asks what it would mean to preserve hip-hop for a billion years—and what future intelligences might learn from it. Harry Allen is a veteran hip-hop journalist, cultural activist, and author whose writing has shaped the way people understand hip-hop history and culture. For more than three decades, he has written about hip-hop, race, and popular culture for major publications including Vibe, The Source, and The Village Voice. Allen played a key role in framing the media narrative around the influential group Public Enemy, serving as the group’s publicist and identifying himself as a “hip-hop activist and media assassin.\" This talk was given at a TEDx event us",
        "id": 4518323,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gJJxWr5gSTA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gJJxWr5gSTA/hqdefault.jpg",
        "title": "Sending Hip-Hop Into Deep Space | Harry Allen | TEDxMIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:38.040040+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:39:45+00:00",
        "description": "Mustafa Üstündağ’ın tiyatro yolculuğu, henüz 5 yaşındayken babasının çalıştığı fabrikada kurulan bir tiyatro sahnesini izlemesiyle başlamıştır. O dönemlerde tiyatro hakkında çok fazla bilgisi olmamasına rağmen, kendisine \"tiyatro okuyacağım\" diyerek bir söz vermiş ve eğitim hayatı boyunca bu hayali aklına kazımıştır. Çevresindeki kimsenin ona inanmamasına rağmen, o inandığı şeyden asla vazgeçmemiş ve üniversitede konservatuar aşamasına gelene kadar kendine verdiği bu sözü tutmuştur.   \n\nÜstündağ’a göre başarı, herkesin kendi hikayesini yazdığı, kişiye özel bir süreçtir ve beylik sözlere kulak asılmamalıdır. O, başarıya ulaşmak için mutlaka \"işin mutfağından geçmek\" ve o işte pişmek gerektiğine inanır. Zorlukların insanı geliştirdiğini ve güçlendirdiğini savunan Üstündağ, gençlere şu mesajı verir: \"İsterseniz yapamayacağınız bir şey yok, yeter ki inandığınız şeyden vazgeçmeyin\".   \n\nOnun için bu süreç, işini severek yaptığı için bir başarı hikayesidir; çünkü bir insan işini severek ve ",
        "id": 4518324,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eCpLetOUogg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eCpLetOUogg/hqdefault.jpg",
        "title": "İnanmanın ve İşi \"Mutfağında\" Öğrenmenin Gücü | Mustafa ÜSTÜNDAĞ | TEDxSivas Cumhuriyet University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:38.404454+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:39:20+00:00",
        "description": "Dr. Sunil Barnwal presents a roadmap for transforming India’s healthcare sector into an AI-enabled intelligent system. He underscores the robust digital infrastructure, such as the Ayushman Bharat Digital Mission, which connects millions of health records, providers, and facilities, laying the foundation for AI-driven healthcare that delivers accurate, scalable, and inclusive services to over 50 crore citizens. Dr. Sunil Kumar Barnwal is a defining figure in Indian Governance and currently serves as the Chief Executive Officer of the National Health Authority (NHA). An IAS topper (Rank 1, 1997 batch) and Director’s Gold Medalist, he holds academic credentials from IIT (ISM), Harvard University, and the National University of Singapore (NUS).\nAs the leader of the world’s largest health assurance initiatives—Ayushman Bharat PM-JAY and the Ayushman Bharat Digital Mission (ABDM)—Dr. Barnwal is widely regarded as an architect of India’s digital health transformation. His work exemplifies a",
        "id": 4518325,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iGbBq8Ni_h4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iGbBq8Ni_h4/hqdefault.jpg",
        "title": "From Fragmented Care to Intelligent Health | Dr. Sunil Kumar Barnwal | TEDxKanke",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:38.719291+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:38:57+00:00",
        "description": "My name is Keren Chen and my TEDx speech explores the intricacies of Asian parenting. It is about finding your own identity and detaching from the expectations already set for you.\n\n\"You don’t have to be the model minority, you just have to be you.\"\n\n Hello, my name is Keren and I am a speaker at TEDx Yingfu 2025. \n\nMy speech is called ‘The second first chance’ it will be centered around Asian parental expectations and the pressure for every kid to be seen as\n“perfect.” \n\nIt aims to address parents and kids; to show them how each person is individual and should follow their own dreams. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4518326,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=uhyfzfm-n7I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uhyfzfm-n7I/hqdefault.jpg",
        "title": "The Second First Chance | Keren Chen | TEDxYingfu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:38.933357+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:38:49+00:00",
        "description": "A 12-year-old movie lover here—eager to share the magic of films!\n\n\"Chinese film is a vessel for our collective memory and poetry.\" Hello everyone, my name is Jack, and I'm 12 years old. I love playing football, badminton and Weiqi. I especially love watching movies.\n\nI am overwhelmed with excitement to join TEDx Yingfu this December and my speech topic is: “How Chinese Films Preserve the Soul of a Changing Nation\".\n\nHave you ever thought that the stories on the screen are more than just stories? They are a mirror of our time, capturing the very soul of who we are as people. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4518327,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nhtt40fIJm0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nhtt40fIJm0/hqdefault.jpg",
        "title": "How Chinese Films Preserve the Soul of a Changing Nation | Jack Chen | TEDxYingfu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:39.205293+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:38:41+00:00",
        "description": "As a storyteller from Sichuan, I explore how language keeps our memories alive.\n\nRemember, \"Your past is the engine of your future.\"\n Hello everyone, my name is Kirby, and I’m 17 years old. I love sports and music, and I’m very excited about participating in TEDx Yingfu.\n\nMy TEDx topic is “The sound that Time Forgot,” a journey about how dialects are more than just ways of speaking — they are time machines that carry our history, identity, and the voices of those who came before us.\n\nIn my talk, I’ll share how one familiar sound from home helped me understand where my roots are, and how they shape the wings I’m growing today. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4518328,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=alnt-XAaX8w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/alnt-XAaX8w/hqdefault.jpg",
        "title": "The Sound that Time Forgot | Kirby Song | TEDxYingfu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:39.417056+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:38:32+00:00",
        "description": "My curiosity shines through my studies, my love for nature, and my passion for exploring diverse cultures, it guided me to uncover a powerful story about the place I call home, which I'm excited to share with you.\n\n\"Let’s not just preserve the past, but activate it, and let it thrive in a new era, nourishing our bright future ahead.\" Hi everyone! My name is Eason and I'm 15 years old. It's a great honor to join TEDx Yingfu, and my speech topic is: \"Growth from the Ground Up\".\n\nHave you ever wondered what truly sustains lasting growth? It doesn't start with a leap into the sky—but with the strength we gather from the ground we stand on.\n\nMy talk invites you to discover how things we inherit can help us build a future that is both grounded and boundless. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4518329,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qNAsRIUieBs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qNAsRIUieBs/hqdefault.jpg",
        "title": "Growth from the Ground Up | Eason Zheng | TEDxYingfu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:39.694270+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:38:19+00:00",
        "description": "Um livro pode ser o primeiro lugar onde uma criança se sente maior do que o mundo ao redor. Ao lembrar como a leitura expande casas pequenas, atravessa limites e autoriza sonhos, esta fala mostra que livros não são somente histórias: são chaves que abrem possibilidades, janelas para outros futuros e espelhos que ajudam a nomear emoções. Quando uma criança se reconhece em um personagem, ela entende que não está sozinha — e esse encontro fortalece a autoestima, a imaginação e a capacidade de aprender. Em um país onde muitas infâncias ainda crescem sem acesso a livros, colocar um exemplar nas mãos de uma criança é oferecer futuro: esperança concreta, repertório e a chance de transformar a própria vida — e, com ela, a sociedade. Escritor, Pós-Doutor em Educação, Doutor em Psicologia Escolar e do Desenvolvimento Humano, é professor, escritor e palestrante internacional. Publicou quase 90 livros sobre formação de professores e literatura para crianças, tem obras traduzidas em vários países.",
        "id": 4518330,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GldR3KU8QmU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GldR3KU8QmU/hqdefault.jpg",
        "title": "Como o livro pode mudar a vida de uma criança?  | Simão de Miranda | TEDxBrasilia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:39.942644+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:38:06+00:00",
        "description": "O consumo não serve apenas para atender necessidades: ele comunica identidade, marca pertencimento e, muitas vezes, sustenta uma performance social. Ao mostrar como cultura, redes sociais e vieses do cérebro influenciam decisões financeiras, esta fala desmonta a ideia de que renda alta garante tranquilidade. A chave não está só em “ter mais”, mas em mudar o contexto: reduzir a disponibilidade, dar novos significados ao dinheiro e criar limites que não dependam somente de força de vontade. No fim, a verdadeira liberdade financeira aparece quando o dinheiro passa a viabilizar sonhos reais — e não a conta invisível do status. Lai Santiago é autista, enfermeira pela UnB, foi pesquisadora na área da criatividade, educação e jogos pelo CNPq por 9 anos. Especialista em economia comportamental e em ESG pela ESPM, especializada em psicologia financeira pelo Instituto Vértice e formada no Neuroeconomia, atua como planejadora financeira independente desde 2017. Tirou mais de 2.500 pessoas do cao",
        "id": 4518331,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=S3AfIS1wBeg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/S3AfIS1wBeg/hqdefault.jpg",
        "title": "Por que ter uma renda alta não garante tranquilidade financeira?  | Lai Santiago | TEDxBrasilia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T18:36:40.143026+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:37:43+00:00",
        "description": "Ezra shares his journey advocating for student representation in civic life after being excluded from political discussions due to his age. He led initiatives to secure a voice for over 40,000 students in his district. His talk urges leaders to value young voices in policymaking and reminds listeners that empowering youth strengthens the foundations of democracy.\n Ezra Anglin (Lafayette) — “Stop Talking to Us; Start Talking with Us”\nEzra shares his journey advocating for student representation in civic life after being excluded from political discussions due to his age. He led initiatives to secure a voice for over 40,000 students in his district. His talk urges leaders to value young voices in policymaking and reminds listeners that empowering youth strengthens the foundations of democracy. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4518332,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=uAf2Batclls",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uAf2Batclls/hqdefault.jpg",
        "title": "Stop Talking to Us; Start Talking with Us | Ezra Anglin | TEDxPaul Laurence Dunbar HS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:26:58.684125+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:16:08+00:00",
        "description": "Silvana Cañote relata cómo, tras una de las crisis más duras de su carrera, encontró en la frustración la respuesta para avanzar. Su charla se centra en el poder de reconciliarte con tu historia utilizando tres conceptos de la sociología para resignificar el pasado. Silvana Cañote es actriz, socióloga y conductora con una trayectoria que inició a los 13 años en cine con la película Tarata. Saltó a la popularidad protagonizando la exitosa serie juvenil América Kids, con seis temporadas ininterrumpidas. Ha participado en producciones como La herencia de Flora, Sebastiana y consolidó su presencia cinematográfica con Sube a mi Nube (2024). Es egresada de Sociología por la PUCP y cuenta con una especialización en Gestión Cultural por el MALI Educación y UNESCO. Su carrera combina arte, pensamiento crítico y compromiso social, construyendo una voz auténtica e influyente en la cultura peruana. This talk was given at a TEDx event using the TED conference format but independently organized by ",
        "id": 4517673,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Ecc1aP3TJVA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Ecc1aP3TJVA/hqdefault.jpg",
        "title": "El poder de reconciliarte con tu historia | Silvana Cañote | TEDxSurco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:26:59.062286+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:15:50+00:00",
        "description": "Miguel Montalvan deconstruye la respuesta automática \"Todo bien\". Explica cómo esta evasiva esconde problemas con repercusiones significativas a nivel personal y, de manera crucial, a nivel organizacional, invitando a la audiencia a adoptar una comunicación más honesta y efectiva. Miguel Montalván es CEO de Santosha SACS, mentor y speaker internacional especializado en Seguridad Psicológica y Liderazgo. Ingeniero Industrial por la Universidad de Lima y MBA por la University of North Carolina (UNC), cuenta además con una especialización en Negociación e Influencia por MIT. Ha sido gerente general en compañías productoras y comercializadoras, así como consultor para empresas multinacionales. Autor de libros sobre paz mental y liderazgo, es miembro de Capitalismo Consciente y Lmas1. TEDx Speaker e influyente corporativo, impulsa culturas organizacionales sanas y de alto desempeño a través de un enfoque humano, estratégico y profundamente transformador. This talk was given at a TEDx event",
        "id": 4517674,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lX4e5uAMMR0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lX4e5uAMMR0/hqdefault.jpg",
        "title": "La verdad del \"todo bien\" | Miguel Montalván | TEDxSurco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:26:59.509190+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:15:37+00:00",
        "description": "Anite Puente, con más de dos décadas trabajando en educación inclusiva, confronta la audiencia sobre la realidad de las personas con discapacidad. Su charla destaca que, ante las limitaciones sociales, el verdadero desafío es ir más allá de la \"inclusión\" para lograr la convivencia y la coexistencia plena en la sociedad. Anite Puente Arnao es profesora de Educación Especial y especialista en discapacidad intelectual con una trayectoria de servicio y liderazgo de alto impacto. Es directora y promotora de la Asociación Educativa Kallpa, institución con 29 años dedicada a mejorar la calidad de vida de personas con discapacidad intelectual y sus familias. Fue presidenta de la Sociedad Peruana de Síndrome de Down y es conferencista nacional e internacional en temas de inclusión y educación especial. Su trabajo ha transformado comunidades, impulsando oportunidades reales, el reconocimiento de capacidades diversas y modelos educativos más humanos, accesibles y respetuosos de la dignidad de c",
        "id": 4517675,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iWxy0AFtPmc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iWxy0AFtPmc/hqdefault.jpg",
        "title": "Incluir y convivir, del dicho al hecho | Anite Puente Arnao | TEDxSurco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:26:59.830183+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:15:17+00:00",
        "description": "Carla Olivieri nos motiva a tratar la vida como una Start-Up. Inspirada en la formación continua, desafía la edad como limitante, demostrando que la curiosidad, el aprendizaje constante y no temer al error son los pilares fundamentales para la reinvención personal y la actualización continua. Carla Olivieri es una destacada líder en educación, innovación y gestión empresarial. Doctora en liderazgo y gestión educativa, con maestrías en marketing y educación, además de Executive Programs en Harvard, MIT y Stanford. Es CEO de Aktiva Group, directora de Cracks Latam y fundadora del movimiento Menos-Pausa. Ha sido Rectora y CEO de UCAL, así como vicepresidenta de Innovación en importantes organizaciones. Integra directorios como Futura Schools, Vidawasi y el International Women’s Forum. Reconocida entre los TOP 10 CEO y ejecutivas digitales, autora del Grupo Planeta, conferencista internacional, creadora de contenido con más de 500 mil seguidores, mamá de cinco y nadadora competitiva. This",
        "id": 4517676,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8rtdlSW5xcI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8rtdlSW5xcI/hqdefault.jpg",
        "title": "Trata tu vida como una Start-Up | Carla Olivieri | TEDxSurco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:00.172727+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:14:59+00:00",
        "description": "Camminare non è solo muoversi nello spazio, ma scegliere un ritmo, uno sguardo, una direzione.\nNel talk “Il cammino come atto di restituzione”, Fede Miceli racconta il cammino come esperienza profonda di ascolto, relazione e responsabilità verso i luoghi attraversati e le persone incontrate.\nAttraverso il passo lento, il silenzio e la fatica, il cammino diventa un gesto consapevole: un modo per restituire attenzione al territorio, valore al tempo e dignità alle storie che spesso passano inosservate. Un atto che trasforma chi cammina e, allo stesso tempo, lascia qualcosa a ciò che viene attraversato.\nUn intervento che invita a riconsiderare il nostro modo di attraversare il mondo, riscoprendo nel cammino un gesto semplice ma profondamente umano.\n Siracusana, classe 1989, Fede Miceli cammina per abitare il mondo, non per attraversarlo in fretta. Content creator, storyteller e nomade digitale, trasforma ogni viaggio in una storia che fa risuonare nuove domande dentro di sé e dentro chi a",
        "id": 4517677,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SQD_doc4kpE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SQD_doc4kpE/hqdefault.jpg",
        "title": "Il cammino come atto di restituzione | Fede Miceli | TEDxCaltanissetta",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:00.428737+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:14:40+00:00",
        "description": "Yas çoğu zaman bir son olarak görülür. Oysa Prof. Dr. Şengül Hablemitoğlu’na göre yas, kayıptan sonra başlayan kaçınılmaz bir değişimle yüzleşme sürecidir. Bu konuşmada Hablemitoğlu, ölümle sınırlı olmayan kayıp kavramını; bir şehirden kopuş, bir inancın sarsılması, bir toplumsal değerin yitimi gibi görünmeyen yaslarla birlikte ele alıyor. Bireysel acıların nasıl toplumsal hafızaya dönüştüğünü, yüzleşilmeyen kayıpların zamanla nasıl başka biçimlerde geri döndüğünü ve iyileşmenin ancak tanıklıkla mümkün olabileceğini anlatıyor. Yasın zayıflık değil, yeniden kim olacağımızı öğrenmenin en kırılgan ama en dönüştürücü yolu olduğunu hatırlatıyor. (TEDxAdana 2025’te, 2 Kasım 2025’te kaydedilmiştir.) Bir kaybın sessizliğinde başlayan, toplumsal bir hafızaya dönüşen bir yolculuk…\nProf. Dr. Şengül Hablemitoğlu, yasın sadece bireysel bir duygu değil; hatırlamanın, tanıklığın ve iyileşmenin ortak dili olduğunu savunan bir akademisyen. Yıllardır görünmeyen kayıplar, duygusal adalet ve toplumsal yü",
        "id": 4517678,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pH0O4kNd64A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pH0O4kNd64A/hqdefault.jpg",
        "title": "Yas Değişimle Yüzleşmektir | Şengül Hablemitoğlu | TEDxAdana",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:00.628288+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:14:26+00:00",
        "description": "Ci sono storie che non hanno bisogno di rumore. Storie che chiedono silenzio, ascolto, presenza.\nNel talk “Frammenti della vita di un veterinario”, Calogero Piscopo condivide momenti di vita professionale e umana che vanno oltre la medicina e arrivano al cuore dell’esperienza umana.\nAttraverso frammenti di lavoro quotidiano, scelte difficili e incontri che lasciano il segno, il talk racconta il confine sottile tra cura, responsabilità e dolore, dove ogni gesto ha un peso e ogni decisione richiede profondo rispetto per la vita. Un racconto intimo, essenziale, che non cerca effetti, ma verità.\nUn intervento che si ascolta in silenzio, perché parla di empatia, di fragilità e di quel legame invisibile che unisce chi cura a chi viene affidato alle sue mani.\nUn silenzio che non è vuoto, ma carico di significato.\n Nato a Piazza Armerina ma cresciuto a Caltanissetta, classe 1980, è un medico veterinario, esperto del comportamento animale. Si laurea nel 2010 in medicina veterinaria presso l'Un",
        "id": 4517679,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FjWjJqR-YIs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FjWjJqR-YIs/hqdefault.jpg",
        "title": "Frammenti della vita di un veterinario | Calogero Piscopo | TEDxCaltanissetta",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:00.830067+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:13:56+00:00",
        "description": "Le parole non sono solo suoni o simboli: sono vere e proprie sostanze attive, capaci di influenzare il nostro cervello e il nostro corpo.\nNel talk, Antonio Sedita ci accompagna tra linguaggio, neuroscienze e benessere, mostrando come ciò che diciamo – e soprattutto come ce lo diciamo – possa generare effetti concreti sul nostro equilibrio emotivo e fisiologico.\nEsplora il potere nutriente delle parole “giuste” e il loro impatto sulla salute, sulle relazioni e sulla qualità della vita. Un invito a diventare più consapevoli del linguaggio che usiamo ogni giorno e a trasformarlo in uno strumento di cura, crescita e cambiamento.\nUn intervento che ci ricorda che le parole non sono mai neutrali: possono ferire, ma possono anche nutrire.\n Nisseno, classe 1986, è un professionista della nutrizione ed esperto sanitario con ampio respiro nazionale. Ha costruito una carriera significativa nell’ambito della nutrizione clinica e sportiva, contribuendo a migliorare percorsi di cura e prevenzione in",
        "id": 4517680,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mvlwJz8vscA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mvlwJz8vscA/hqdefault.jpg",
        "title": "Il segno verde: come le parole nutrono il cervello (e il corpo) | Antonio Sedita | TEDxCaltanissetta",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:01.083010+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:13:37+00:00",
        "description": "Cosa significa davvero disegnare la propria strada in un mondo che ci propone percorsi già tracciati, modelli da seguire e definizioni rigide di successo? In questo talk intenso e autentico, Paolo Amico parte da una domanda semplice solo in apparenza per accompagnarci in un viaggio fatto di scelte, deviazioni, cadute e nuove direzioni.\nPaolo esplora il momento in cui ci si rende conto che la strada su cui stiamo camminando non è stata scelta da noi. È proprio lì, in quello spazio di dubbio e incertezza, che nasce la possibilità di fermarsi, guardarsi dentro e iniziare a tracciare un percorso nuovo, unico, imperfetto ma profondamente nostro.\nIl talk affronta temi universali come il rapporto con le aspettative degli altri, la paura di sbagliare, il valore del fallimento e il coraggio di cambiare rotta. Disegnare la propria strada non significa avere tutto sotto controllo, ma accettare l’idea che il cammino si costruisce passo dopo passo, anche quando non si vede ancora la meta.\nUn inter",
        "id": 4517681,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=rsjMmgNtuQE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rsjMmgNtuQE/hqdefault.jpg",
        "title": "Come disegnare la propria strada | Paolo Amico | TEDxCaltanissetta",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:01.238818+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:12:21+00:00",
        "description": "NOTE FROM TED: TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nEvolution isn’t a straight line—it’s a repeating pattern hiding in plain sight. Let’s explore the fractal shapes that shape life itself. Vishwajeet is a multi-dimensional storyteller bridging technology, creativity, and global impact. With a background in engineering, business, neuropsychology, and international relations, his journey explores the intersection of technology, human behavior, and global systems. \n\nHe co-founded The Blockchain School, empowering over 100,000+ learners globally, and has worked with industry leaders like Nas Daily to drive education and innovation. Through Stanford WiDS, he and his team facilitated $200,000+ in scholarships for women in web3. \n\nAt heart, he is a storyteller writing technical documents by day and crafting plays, films, and novels by ni",
        "id": 4517682,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OVZTVdKlNo0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OVZTVdKlNo0/hqdefault.jpg",
        "title": "The Fractal Shape Of Evolution And Adaptation | Vishwajeet Ranade | TEDxImperialCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:01.372010+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:09:12+00:00",
        "description": "Tres niñas pidieron violines en un lugar donde nadie los pide. Ese gesto inesperado cambió la vida de Walter “Pollo” Díaz y la de toda una comunidad.\n\nEn esta charla, cuenta cómo ese pedido dio origen a la Orquesta Sinfónica Benjaminos, un proyecto social que hoy transforma la vida de cientos de chicos y chicas de barrios vulnerables de Córdoba a través de la música. Asesor y miembro fundador de la Asociación Civil Benjaminos, donde dedica gran parte de su tiempo y energía al trabajo social, una de sus pasiones más profundas. Cree en la empatía, el compromiso y la fuerza de las pequeñas acciones para generar grandes cambios.  En 2013, creó la orquesta Benjaminos en Villa La Tela, un barrio de bajos recursos de la ciudad de Córdoba, por la cual pasaron más de 1000 chicos, afirmando su compromiso de incluir y educar a través de la música. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.co",
        "id": 4517683,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TQuz3Dhe5dk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TQuz3Dhe5dk/hqdefault.jpg",
        "title": "Un niño que toca un violín, no toca un arma | Walter Díaz | TEDxCordoba",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:01.507067+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:08:32+00:00",
        "description": "El maestro Francisco Galán nos explica una manera más democrática de alcanzar la libertad financiera al ritmo y posibilidades de cada individuo. Francisco es filósofo por la Universidad Iberoamericana y maestro en Filosofía por la Universidad de Alberta, Canadá. Le interesa la filosofía moral y política, la escritura y la teoría de la argumentación, además de ser un experto en finanzas. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4517684,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bkBRSu3dOjU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bkBRSu3dOjU/hqdefault.jpg",
        "title": "El camino a la libertad financiera | Francisco Galán | TEDxITAM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:01.662519+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:08:19+00:00",
        "description": "¿Y si el verdadero error del sistema fuera no escucharnos?\nEn esta charla, cuatro líderes religiosos —un sacerdote católico, un pastor evangélico, un rabino y un imám— se suben al mismo escenario para mostrar que el diálogo no solo es posible, sino urgente.\n\nDesde Córdoba, cuentan la experiencia de COMIPAZ, un espacio interreligioso que desde hace más de 25 años construye convivencia, amistad y paz en un mundo atravesado por la polarización. Primer y único Comité Interreligioso formal en la Argentina que cuenta con doce años de trayectoria trabajando en la provincia de Córdoba. Liderado por cuatro líderes religiosos (Marcelo Polakoff, Carlos Ñanez, Norberto Ruffa, Omar Muza), su propósito es compartir la sabiduría de sus tradiciones y mostrar que la convivencia en la diversidad es un desafío posible. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4517685,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CGs-U6XeoCA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CGs-U6XeoCA/hqdefault.jpg",
        "title": "4 líderes religiosos, una falla en el sistema | COMIPAZ . | TEDxCordoba",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:01.826302+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:08:05+00:00",
        "description": "Débora Blanca comienza su charla haciendo una apuesta provocadora: volver a soñar.\nNo habla de los sueños que tenemos al dormir, sino de esos otros, los que imaginamos despiertos y que parecen estar desapareciendo.\n\nEspecialista en ludopatía, reflexiona sobre una época atravesada por pantallas, apuestas, ansiedad y estímulos constantes, donde cada vez hay menos espacio para el aburrimiento, el deseo propio y la imaginación. Psicóloga egresada de la Universidad de Buenos Aires.\nHace muchos años empezó a trabajar coordinando grupos de ludópatas (adictos al juego) y, a causa de lo apasionante que le resultó escuchar relatos que parecían ficcionales, se dedico a investigar y a escribir (además de atender pacientes y familiares).\nDe la investigación nació la posibilidad de representar al país en jornadas científicas en Uruguay, Italia, España y Polonia.\nDe la escritura nacieron 5 libros; y de la clínica, una tarea que condensa tanto su deseo como su pasión por la palabra, la divulgación en",
        "id": 4517686,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=osdBvDI7K3g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/osdBvDI7K3g/hqdefault.jpg",
        "title": "Te apuesto a que volvemos a soñar | Débora Blanca | TEDxCordoba",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T17:27:02.044514+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T17:07:47+00:00",
        "description": "Respiramos sin pensar… y entendemos música sin saberlo.\nEn esta charla, Darío propone una idea tan simple como poderosa: la música es un idioma emocional universal que todos hablamos.\n\nA través de ejemplos en vivo, canciones icónicas y la participación del público, muestra cómo reconocemos ritmos, melodías y emociones sin necesidad de formación técnica. Porque la música, como el aire, nos atraviesa y nos conecta. \"Lo llaman el \"\"Doctor Música\"\"y es un músico multidimensional.Lleva editados diez discos como solista, en los que participaron Fito Páez, y Litto Nebbia, entre otros. \nFue Director de la Licenciatura en Música Popular de la Facultad de Música de la UCA y es Director de Creación Musical en la Academia Otro Mundo, fundada por Cris Morena,\nComo comunicador hizo columnas en Gelatina, Olga, Telefé, Radio Metro y Radio con Vos.\nCon sus videos en Instagram y Tik Tok explicando canciones clásicas creó una comunidad de más de 220.000 seguidores. \nSe presenta en vivo con su show Canci",
        "id": 4517687,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=kEc9oPmMrB4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kEc9oPmMrB4/hqdefault.jpg",
        "title": "La música que respiramos | Darío Jalfin | TEDxCordoba",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:19.438955+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T16:01:42+00:00",
        "description": "Berk MD, karmaşık bilimsel araştırmaları anlaşılır, uygulanabilir ve ilham verici hale getiren bir bilim iletişimi platformudur. Yarım milyondan fazla aboneye ulaşan kanal; sağlık, verimlilik ve eğitim alanlarında bilimsel bilgiyi günlük yaşamla buluşturarak güvenilir ve kanıta dayalı içerikler sunar.\n\nBu projeyle Berk MD, TurkMSIC tarafından “Yılın En İyi Doktor Influencer’ı (2024)” ödülüne layık görülmüş, ayrıca TEDx konuşması ve TRT Kortex programı dahil olmak üzere birçok üniversite ve konferansta davetli konuşmacı olarak yer almıştır. Berk MD is a science communication YouTube Channel, dedicated to making complex scientific researches clear, practical, and inspiring. With an audience of over half a million subscribers and millions of views worldwide, the channel bridges scientific knowledge and everyday life, focusing on health, productivity, and education.\n• Each video is designed to challenge common health myths, present evidence-based productivity methods, and share language-l",
        "id": 4517071,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bhxpVdE-P6o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bhxpVdE-P6o/hqdefault.jpg",
        "title": "Keşke “Çok” Değil, “Akıllıca” Çalışsaydım | Kemal Berk İsler | TEDxErbakir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:19.573137+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T16:01:25+00:00",
        "description": "Edip Gedizlioğlu, hayat yolculuğunu, üretkenliğini şekillendiren deneyimlerini ve başarıya giden süreçte karşılaştığı dönüm noktalarını samimi bir dille paylaşıyor. Hem bireysel gelişime hem de toplumsal katkıya odaklanan bakış açısıyla; azim, disiplin, cesaret ve sorumluluk kavramlarını yeniden düşünmemize ilham veren güçlü bir perspektif sunuyor.\n\nKendi yolunu çizmek, hedeflerine ulaşmak ve potansiyelini gerçeğe dönüştürmek isteyen herkes için değerli içgörüler barındıran bu konuşma, yalnızca bir başarı hikâyesi değil, aynı zamanda bir ilham kaynağı niteliği taşıyor. Edip Gedizlioğlu is the Sales Director of Bank of America Türkiye and a distinguished graduate of our school. Throughout his career, he has built a strong reputation for leadership, strategic vision, and global business insight. His journey from student life to a leading role in one of the world’s most influential financial institutions stands as an inspiring example of dedication, perseverance, and ambition. Today, Edi",
        "id": 4517072,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=JZAiFksk5qw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JZAiFksk5qw/hqdefault.jpg",
        "title": "İnanmadan Olmaz, Çalışmadan Hiç Olmaz | Edip Gedizlioglu | TEDxErbakir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:19.777397+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T16:01:06+00:00",
        "description": "Mukaddes Başkaya, deneyimlerinden ve birikiminden yola çıkarak ilham verici bir perspektif sunuyor. Hayata, üretkenliğe ve kişisel gelişime dair önemli noktalara değinen bu konuşma; düşünmeye sevk eden, farkındalık kazandıran ve izleyicilere yeni bir bakış açısı kazandırmayı amaçlayan içerikler barındırıyor.\n\nBilgi ve deneyimin gücüyle şekillenen bu sohbet, hem öğrenmek hem de kendini geliştirmek isteyen herkes için değerli bir kaynak niteliğinde. Mukaddes Başkaya is a successful female entrepreneur known for her determination, innovation, and visionary leadership. Rising as a strong voice in the male-dominated textile industry, she also serves as the woman president of a leading nonprofit organization, advocating empowerment, equality, and opportunity. Throughout her journey, she has transformed challenges into meaningful achievements, inspiring others to believe in their potential, take courageous steps, and confidently create their own future. This talk was given at a TEDx event us",
        "id": 4517073,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LmIBRC62vyA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LmIBRC62vyA/hqdefault.jpg",
        "title": "Kendimle Başlayan Hikâye | Mukaddes Baskaya | TEDxErbakir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:20.004665+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T16:00:54+00:00",
        "description": "Kuyruklu yıldızlar gibi…\nNadir ama etkileyici, iz bırakan, yolu aydınlatan bir parça olmak isteriz değil mi? İşte bu yol da mutluluğumuzu nasıl tasarlarız?\n\n..................................................................................................................................................................\n\n1986 yılı izmir'de doğdu. Ege Üniversitesi iletisim Fakültesi Radvo, TV ve Sinema Lisans Bölümünden mezun oldu ve ardından aynı üniversitede Sosyal Bilimler Enstitüsü'nde Halkla iliskiler ve Tanitim Bölümünde yüksek lisans eğitimini tamamladı. Halen aynı bölümde doktora eğitimine devam etmektedir.\nKariyerine, telekomünikasyon sektöründe Satış Sorumlusu olarak basladı. Yolculuğuma eğitim sektöründe Halkla iliskiler Yöneticiliği ve Eğitmenliği ile devam ettirdi. Enerji sektöründe Kurumsal iletisim Müdürü olarak uzun yillar görev aldı. Ardindan tekstil ve moda sektöründe Grup Kurumsal iletişim Müdürü pozisyonunda görev yapti. Happy Place to Work ile Türkiye'nin En Mutlu iş",
        "id": 4517074,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KQ3K09CgGbo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KQ3K09CgGbo/hqdefault.jpg",
        "title": "\"Mutluluk Tasarımcısı\" | Gizem Dağ | TEDxİzmir Katip Çelebi Üniversitesi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:20.166850+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T16:00:31+00:00",
        "description": "Richard Torrez Jr. is an Olympic medalist who has trained as a boxer his entire life. As a professional boxer, his experiences inside and outside the ring have shaped his perspective on discipline perseverance and achieving a dream. Richard Torrez Jr. is an Olympic medalist who has trained as a boxer his entire life. As a professional boxer, his experiences inside and outside of the ring have shaped his perspective on discipline, perseverance, and achieving a dream. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4517075,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=O7xEuXBxpqU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/O7xEuXBxpqU/hqdefault.jpg",
        "title": "An Olympic boxer’s guide to becoming a champion | Richard Torrez Jr. | TEDxVisalia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:20.314287+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T16:00:30+00:00",
        "description": "Denizli’nin köklü iş insanlarından biri olan Mustafa Kaynak, tekstil sektöründeki liderliğiyle bölgenin sanayi ve ekonomik gelişimine önemli katkılar sunmuştur. Sadece iş dünyasındaki başarısıyla değil, aynı zamanda eğitime ve toplumsal sorumluluğa olan güçlü bağlılığıyla da geniş bir saygı kazanmıştır.\n\nEğitime verdiği destekle birçok okul ve eğitim kurumunun hayata geçmesini sağlayan Kaynak, genç nesiller için daha güçlü fırsatlar oluşturmayı amaçlayan projelerin öncüsü olmuştur. Yerel iş dünyasıyla kurduğu güçlü bağlar sayesinde yenilik, sürdürülebilir kalkınma ve bölgesel büyümeyi destekleyen stratejik girişimlerde aktif rol almaktadır.\n\nMustafa Kaynak, iş dünyasında vizyonu; toplumda ise örnek duruşu ve gönüllülük ruhuyla ilham veren bir lider olarak tanınmaktadır. Mustafa Kaynak is a distinguished businessman and philanthropist from Denizli, Turkey. Renowned for his leadership in the textile sector, he has significantly contributed to the region’s industrial and economic develop",
        "id": 4517076,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gT0kx2-EG18",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gT0kx2-EG18/hqdefault.jpg",
        "title": "Üretmek ve Paylaşmak: Bir İş İnsanının Hikâyesi | Mustafa KAYNAK | TEDxErbakir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:20.474725+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:59:50+00:00",
        "description": "Cengiz Güneş, bilimsel bakış açısını günlük yaşamla buluşturan yaklaşımıyla sağlık, üretkenlik ve kişisel gelişim alanlarında ilham veren içerikler üreten bir konuşmacıdır. Bu videoda; doğru bilinen yanlışları sorgulayan, kanıta dayalı bilgiye dayanan ve pratik olarak hayata uygulanabilecek değerli içgörüler paylaşıyor.\n\nBilimsel düşünmeyi destekleyen, öğrenmeyi teşvik eden ve izleyicileri daha bilinçli bir hayata yönlendirmeyi amaçlayan bu konuşmada; sağlıktan verimliliğe, öğrenmeden yaşam kalitesine uzanan önemli noktalar ele alınıyor. Dr. Cengiz Güneş is an experienced psychiatrist dedicated to understanding the human mind and supporting emotional well-being. Through his work, he focuses on mental resilience, personal growth, and the psychological turning points that shape our lives. Combining scientific knowledge with a compassionate perspective, he guides individuals toward self-awareness, inner strength, and healthier emotional lives. Dr. Cengiz Güneş continues to inspire others",
        "id": 4517077,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=F1TgITdm4B8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/F1TgITdm4B8/hqdefault.jpg",
        "title": "Benim Yolum , Yol Değil | Cengiz Gunes | TEDxErbakir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:20.621791+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:59:23+00:00",
        "description": "In this talk, he explores how a creative mind shapes a creative world, focusing on the psychological barriers that limit innovation. Drawing on examples from innovations, business environments, and the modern workplace, he discusses how these obstacles can be understood and overcome. Rashid Bayramli graduated from the Baku Engineering University, Faculty of Economics and Management, majoring in Business Management, and received his Master's degree in Management from the Azerbaijan State University of Economics, defending his dissertation topic on the topic \"Comparative analysis of trends in the management of SMEs in an automated environment: on the scale of Azerbaijan and Turkey\" with a high average. He is currently a participant in the Ph.D. program in Economics at Bahçeşehir University, one of the world's most renowned international educational institutions. At various times, he has worked as a Sales Manager, Marketing Manager, Head of Sales Department, and Head of Project Departmen",
        "id": 4517078,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=u9L_TEBaBCg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/u9L_TEBaBCg/hqdefault.jpg",
        "title": "Yaradıcı Dünya İnnovasiya, Psixoloji Maneələri  | Rashid Bayramli, | TEDxBaku Engineering University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:20.772393+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:59:15+00:00",
        "description": "In this talk, he shares his life story — a journey from Turkey to Azerbaijan — reflecting on the challenges he faced throughout his career. Through his experiences, he offers sincere insights and practical advice to inspire and guide young people on their own paths. Experienced General Manager with a demonstrated history of working in the construction industry. Skilled in Process Engineering and Supply Chain Management. Strong management professional with a Master of Business Administration (MBA) focused in Management, Business, Energy and Environment from ADA University. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4517079,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=U74CqLn1n_8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/U74CqLn1n_8/hqdefault.jpg",
        "title": "It’s not hocus-pocus, it’s all about focus. | Alim Şentürk | TEDxBaku Engineering University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:20.886669+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:59:05+00:00",
        "description": "\"Kadınsın yapamazsın\", \"Bu işte çok rekabet var\", \"Pilot olmak için torpil lazım\" gibi yargılara boyun eğmeden tutkularının peşinden giden bir kadın. Peki sen \"Gerçekten burada olmak için yeterli misin?\" A320 First Officer olarak görev yapmaktadır. Havacılık tutkusunu mühendislik altyapısıyla birleştirerek genç kadın pilotlara ilham vermektedir. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4517080,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=uSyy_1P2YQY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uSyy_1P2YQY/hqdefault.jpg",
        "title": "Gökyüzü Gerçekten İsteyen Herkes İçin Açık | Seda Saygı Aktaş | TEDxAdana Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:21.014328+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:58:52+00:00",
        "description": "Gelişen yeni dünyada öğrencilerin ve bireylerin karakterini, başarısını etkileyen çevresel faktörler ve çok daha fazlası... Hacettepe Üniversitesi Tıp Fakültesi mezunudur. Adana Şehir Eğitim ve Araştırma Hastanesi’nde profesör olarak KBB alanında hizmet vermektedir. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4517081,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=aWDkRVdvFHY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aWDkRVdvFHY/hqdefault.jpg",
        "title": "Gelişen Dünyada Öğrenci Ve Çevresi | Orhan Görgülü | TEDxAdana Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:21.170553+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:58:33+00:00",
        "description": "Ceren Atmaca, hayatının en zor dönemlerinden birini, 3. evre kanserle verdiği mücadelesini ve bu süreçten güçlenerek çıkma hikâyesini samimi bir şekilde paylaşıyor. Yalnızca bir hastalıkla mücadele değil, aynı zamanda umut, kararlılık, inanç ve insanın kendi iç gücüyle yeniden ayağa kalkabilmesinin gerçek bir örneğini sunuyor.\n\nBugün yaşadıklarını anlatarak farkındalık oluşturmayı, benzer zorluklarla mücadele eden insanlara güç vermeyi ve pes etmemenin ne kadar büyük bir değer olduğunu hatırlatmayı amaçlıyor. Ceren’in hikâyesi; hayata sarılmanın, pozitif kalmanın ve kendine inanmanın neleri değiştirebileceğinin ilham verici bir kanıtı. Ceren Atmaca is an inspiring cancer survivor who turned one of life’s toughest challenges into a story of strength, resilience, and hope. After being diagnosed with Stage 3 cancer, she fought with unwavering determination and emerged victorious, redefining courage through her journey. Today, she shares her experience to raise awareness, empower others f",
        "id": 4517082,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QRWW6ckQE1E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QRWW6ckQE1E/hqdefault.jpg",
        "title": "Kanserle Değil, Kendi Yolumla Tanımlandım | Ceren Atmaca | TEDxErbakir Fen Lisesi Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:21.391191+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:57:28+00:00",
        "description": "In this TEDx talk, Vivek Agarwal guides us through the past and present of Bangalore, describing how the city's character has evolved from an isolated settlement to a vibrant, chaotic environment. In addition, he highlights the impact of policy on our daily decisions and lifestyles, explains why global poverty has been reduced over the last thirty years, and links the current increase in CO2 levels to the future direction of the planet.\n\nFurthermore, Vivek emphasizes that people must be aware of the transformative possibilities available to them to maximize their chances of success. He points out that while transformation can occur by chance, it is most likely to occur through the exercise of individual choice. He uses the story of 'A Tale of Two Cities', the change from a bipolar to a multipolar world, and the fundamental design vs. destiny theme to elaborate on why people should be aware of transformative possibilities around them.\n\nVivek encourages students to look beyond the class",
        "id": 4517083,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QVoA2HkDQUo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QVoA2HkDQUo/hqdefault.jpg",
        "title": "Aspirations and Ambiguity: Seeing the invisible hand of Policy | Vivek Agarwal | TEDxNITKSurathkal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:21.533028+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:57:11+00:00",
        "description": "In this moving and deeply personal talk, Dr. Ashish Maskay explores how a childhood seed of empathy—planted by watching his father treat underprivileged patients—blossomed into a lifelong mission of saving lives in Shanghai . Known to many as the \"Blood Man,\" Dr. Maskay recounts the birth of Bloodline, a volunteer-driven association founded after a high-stakes emergency involving rare \"Panda Blood\" proved the enduring power of human solidarity . Through heart-wrenching stories of resilience, including a personal struggle with his own daughter's health, he illustrates the critical importance of blood donation and challenges us to look beyond ourselves to hear the cries of a community in need . Ultimately, his journey serves as a powerful reminder that while we cannot change the past, we have the collective power to protect the dreams of the future through simple acts of service . Dr. Ashish Maskay, a Nepalese surgeon in Shanghai for the past 19 years, works in the Department of Orthope",
        "id": 4517084,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fVJkOiuAe4Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fVJkOiuAe4Y/hqdefault.jpg",
        "title": "My Journey To Become A Blood Man | Ashish Maskay | TEDxShanghai Singapore Intl School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-09T16:21:21.691741+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-09T15:57:03+00:00",
        "description": "What if two completely different stories could both be true at the same time?. In this viral-ready talk, Isaac Lai exposes the \"Paradox of Memory\" and why your brain is secretly a historian without your permission. Learn why the air you breathe right now might be \"toxic\" because of events that happened centuries ago. From the ruins of the Rwandan genocide to the miracle of Nelson Mandela’s imagination, find out how to stop being haunted by the past and start using it as a weapon for change.\n\n Isaac, a junior at Shanghai Singapore International School, has long been fascinated by how ideas can change the way we see the world. Growing up in an international environment taught him the power of perspective and how different backgrounds shape the way we think and connect. Involved in Model United Nations, essay competitions, and serving as an organizer for this TEDx event, he has experienced the power of genuine, thought-provoking conversation. For him, history isn’t just about the past—it",
        "id": 4517085,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EoN-E6C6aVk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EoN-E6C6aVk/hqdefault.jpg",
        "title": "Living With The Past | Isaac Lai | TEDxShanghai Singapore Intl School",
        "vote": 0
    }
]