[
    {
        "age": null,
        "album": "",
        "author": "滇西小哥 Dianxi Xiaoge",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T09:31:20.309856+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T09:00:45+00:00",
        "description": "※Click \"cc\" on the lower right menu to choose your subtitle language.\n\n“Shaped like a tree root, sweet like honey preserved in syrup” — this is the most down-to-earth way people describe the raisin tree fruit.\nIn some villages of Yunnan, ancient raisin tree fruit trees still grow. In the past, they were rare treasures, and eating them felt just like eating candy. When fully ripe, the fruits fall with a gust of wind, and children would wait beneath the trees, guarding that moment of sweetness.\nBeyond being eaten fresh, they are also used in cooking:\nSoaked in liquor, they’re sweeter than honey; simmered in soup, they’re more fragrant than red dates.\nThis homely, knobbly, “sweet-in-its-own-ugly-way” fruit — often likened to a little chicken claw — is a seasoning treasure quietly kept by Yunnan mountain families beside their hearths.\n\nHello, everyone! I am Dianxi Xiaoge, a Yunnan native. If you enjoy my videos, please keep subscribing to my channel. I'll continue to share my life and Yun",
        "id": 4494532,
        "language": "cn",
        "link": "https://www.youtube.com/watch?v=QdEQAzqX_HA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 780,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQG_fzADCunBTV1KwjkfAQQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QdEQAzqX_HA/hqdefault.jpg",
        "title": "Raisin Tree Fruit — One of the Oldest Fruits on the Eastern Lands【滇西小哥】",
        "vote": 0
    }
]