[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T23:28:55.352206+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T22:40:00+00:00",
        "description": "According to the Wall Street Journal (paywalled), Goldman Sachs is transferring Apple Card and Apple Savings to JPMorgan Chase. \"It was clear in 2023 that Goldman Sachs would exit the consumer credit game, abandoning its Apple Card partnership with it,\" reports AppleInsider. \"However, it has taken 26 months to reach a point where it can finally hand over issuing control to another bank.\" From the report: Goldman Sachs is reportedly expected to hand over the $20 billion of outstanding balances at a $1 billion discount. Such discounts are rare, and allegedly reflect the higher-than-average delinquency rate found with Apple Card holders. JPMorgan will have to issue new Apple Cards to existing users, but it may be some time before that is done. A new Apple Savings will be opened by JPMorgan as well, but users will be given the option to move or stay.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=JPMorgan+Chase+Reaches+",
        "id": 4501429,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/07/2135246/jpmorgan-chase-reaches-a-deal-to-take-over-the-apple-credit-card",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "JPMorgan Chase Reaches a Deal To Take Over the Apple Credit Card",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T22:19:13.284716+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T22:02:00+00:00",
        "description": "Bose is end-of-lifing its SoundTouch smart speakers but softened the blow by open-sourcing the SoundTouch API and preserving limited local features, AirPlay, and Spotify Connect. Ars Technica reports: In October, Bose announced that its SoundTouch Wi-Fi speakers and soundbars would become dumb speakers on February 18. At the time, Bose said that the speakers would only work if a device was connected via AUX, HDMI, or Bluetooth (which has higher latency than Wi-Fi). After that date, the speakers would stop receiving security and software updates and lose cloud connectivity and their companion app, the Framingham, Massachusetts-based company said. Without the app, users would no longer be able to integrate the device with music services, such as Spotify, have multiple SoundTouch devices play the same audio simultaneously, or use or edit saved presets.\n \nThe announcement frustrated some of Bose's long-time customers, some of whom own multiple SoundTouch devices that still function proper",
        "id": 4500988,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/07/2126224/bose-open-sources-its-soundtouch-home-theater-smart-speakers-ahead-of-end-of-life",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bose Open-Sources Its SoundTouch Home Theater Smart Speakers Ahead of End-of-Life",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T22:19:13.525320+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T21:25:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Warner Bros Discovery's board unanimously turned down Paramount Skydance's latest attempt to acquire the studio, saying its revised $108.4 billion hostile bid amounted to a risky leveraged buyout that investors should reject. In a letter to shareholders on Wednesday, Warner Bros' board said Paramount's offer hinges on \"an extraordinary amount of debt financing\" that heightens the risk of closing. It reaffirmed its commitment to streaming giant Netflix's $82.7 billion deal for the film and television studio and other assets.\n \nTheir assessment comes even after Paramount, which has a market value of around $14 billion, proposed to use $40 billion in equity personally guaranteed by Oracle billionaire co-founder Larry Ellison -- father of Paramount CEO David Ellison -- and $54 billion in debt to finance the deal. The decision keeps Warner Bros on track for its deal with Netflix, even after Paramount amended its bid on December 22 to addres",
        "id": 4500989,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/07/2121252/warner-bros-rejects-revised-paramount-bid-sticks-with-netflix",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Warner Bros Rejects Revised Paramount Bid, Sticks With Netflix",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T21:10:29.757864+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T20:45:00+00:00",
        "description": "The humble power bank has transformed from a simple pocket-sized battery into a feature-laden gadget that now sometimes includes screensavers, Bluetooth connectivity and built-in Wi-Fi hotspots. The Verge's Thomas Ricker highlighted the $270 EcoFlow Rapid Pro X Power Bank 27k at CES 2026 as a prime offender -- a device he declared \"too expensive, too big, too slow, and too heavy.\" Its giant display takes 30 seconds to wake from sleep, plays swirly graphics and blinking eyeballs, and requires a screensaver while slowly draining the battery it's meant to preserve. \n\nThe feature creep is industry-wide. Anker no longer lists a display-less model in its 20,000mAh range, and both companies sell proprietary desk chargers. Basic alternatives exist -- Anker's PowerCore 10k runs $26 -- but they're becoming harder to find.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Power+Bank+Feature+Creep+is+Out+of+Control+%3A+https%3A%2F",
        "id": 4500378,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/07/1913253/power-bank-feature-creep-is-out-of-control",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Power Bank Feature Creep is Out of Control",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T21:10:29.884413+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T20:01:00+00:00",
        "description": "An anonymous reader shares a report: Ever since the federal government began issuing the Dietary Guidelines in 1980, it has told Americans to limit themselves to one or two standard alcoholic drinks a day. Over time, the official advice morphed to no more than two drinks a day for men, and no more than one for women. No longer [non-paywalled source]. \n\nThe updated guidelines issued on Wednesday say instead that people should consume less alcohol \"for better overall health\" and \"limit alcohol beverages,\" but they do not recommend clear limits. The guidelines also no longer warn that alcohol may heighten the risk of breast cancer and other malignancies. It is the first time in decades that the government has omitted the daily caps on drinking that define moderate consumption -- standards that are used as benchmarks in clinical studies, to steer medical advice, and to distinguish moderate from heavy drinking, which is unquestionably harmful. \n\nThe new guidance advises Americans who are p",
        "id": 4500379,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/07/1848240/new-dietary-guidelines-abandon-longstanding-advice-on-alcohol",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Dietary Guidelines Abandon Longstanding Advice on Alcohol",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T20:01:49.662952+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T19:21:00+00:00",
        "description": "Samsung Electronics has once again sidelined Ballie, a long-anticipated robot that was first announced six years ago but never released. Bloomberg News: The device -- designed to roll and roam throughout the home -- is completely absent from this week's CES, the biggest electronics trade show. And though Samsung said last year that Ballie was nearly ready for a retail release, the product is now unlikely to resurface soon. \n\nIn an emailed statement, Samsung referred to Ballie as an \"active innovation platform\" within the company, rather than a forthcoming consumer device. \"After multiple years of real-world testing, it continues to inform how Samsung designs spatially aware, context-driven experiences, particularly in areas like smart home intelligence, ambient AI and privacy-by-design,\" a Samsung spokesperson said in the statement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung's+Rolling+Ballie+Robot+Indefi",
        "id": 4499782,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/07/1749257/samsungs-rolling-ballie-robot-indefinitely-shelved-after-delays",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung's Rolling Ballie Robot Indefinitely Shelved After Delays",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T18:53:51.298203+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T18:39:00+00:00",
        "description": "Several years after Samsung introduced the Frame TV in 2017 -- a television designed to display fine art and resemble a framed painting when switched off -- competitors are finally catching up in meaningful numbers. Amazon announced the Ember Artline TV at CES 2026 this week, a $899 model that can display one of 2,000 works of art for free and includes an Alexa AI tool to recommend pieces suited to your room. Hisense unveiled its CanvasTV late last year, TCL has the NXTvision model, and LG has announced the Gallery TV for later this year. \n\nThe surge in art-focused televisions comes down to two factors: smaller living spaces in cities where younger buyers lack dedicated rooms for large screens, and advances in matte screen technology that enable displays to absorb light like a canvas rather than reflect it like a window. Local dimming and improved backlighting processing allow these newer models to maintain their slim profiles for flush wall-mounting while delivering more realistic ar",
        "id": 4499198,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/07/1743200/the-inevitable-rise-of-the-art-tv",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Inevitable Rise of the Art TV",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T18:53:51.670006+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T18:01:00+00:00",
        "description": "Climate-heating emissions from aviation could be slashed in half -- without reducing passenger journeys -- by getting rid of premium seats, ensuring flights are near full and using the most efficient aircraft, according to analysis. The Guardian: These efficiency measures could be far more effective in tackling the fast-growing carbon footprint of flying than pledges to use \"sustainable\" fuels or controversial carbon offsets, the researchers said. They believe their study, which analysed more than 27m commercial flights out of approximately 35m in 2023, is the first to assess the variation in operational efficiency of flights across the globe. The study, led by Prof Stefan Gossling at Sweden's Linnaeus University, examined flights between 26,000 city pairs carrying 3.5 billion passengers across 6.8 trillion kilometers. First and business class passengers are responsible for more than three times the emissions of economy travelers, and up to 13 times more in the most spacious premium c",
        "id": 4499199,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/07/1728220/how-aviation-emissions-could-be-halved-without-cutting-journeys",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Aviation Emissions Could Be Halved Without Cutting Journeys",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T17:43:19.775069+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T17:21:00+00:00",
        "description": "Microsoft has canceled plans to impose a daily limit of 2,000 external recipients on Exchange Online bulk email senders. From a report: The change was announced in April 2024, when Microsoft said that it would add new External Recipient Rate (ERR) limits starting January 2025 to fight spam, with plans to begin enforcing the limit on cloud-hosted mailboxes of existing tenants between July and December 2025. \n\nAs explained last year, this new Mailbox External Recipient Rate Limit was designed to prevent Microsoft 365 customers from abusing Exchange Online resources and to restrict unfair usage. However, on Tuesday, Microsoft announced that the Exchange Online bulk emailing rate limit is being canceled indefinitely, following negative customer feedback.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Cancels+Plans+To+Rate+Limit+Exchange+Online+Bulk+Emails%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F26%2F01%2F07",
        "id": 4498530,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/07/1659220/microsoft-cancels-plans-to-rate-limit-exchange-online-bulk-emails",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Cancels Plans To Rate Limit Exchange Online Bulk Emails",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T17:43:20.003798+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T16:41:00+00:00",
        "description": "An anonymous reader shares a report: If you're among the macOS users experiencing some weird issues with your Logitech mouse, then good news: Logitech has now released a fix. This comes after multiple Reddit users reported yesterday that Logi Options Plus -- the app required to manage and configure the controls on Logitech accessories -- had stopped working, preventing them from using customized scrolling features, button actions, and gestures. \n\nOne Reddit user said that the scroll directions and extra buttons on their Logitech mouse \"were not working as I intended\" and that the Logi Options Plus app became stuck in a boot loop upon opening it to identify the cause. Logitech has since acknowledged the situation and said that its G Hub app -- a similar management software for gaming devices under the Logitech G brand -- was also affected. \n\nAccording to Logitech's support page, the problem was caused by \"an expired certificate\" required for the apps to run. Windows users were unaffect",
        "id": 4498531,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/07/1636213/logitech-caused-its-mice-to-freak-out-by-not-renewing-a-certificate",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Logitech Caused Its Mice To Freak Out By Not Renewing a Certificate",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T16:35:32.144801+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T16:00:00+00:00",
        "description": "Dell's CES 2026 product briefing, PC Gamer writes, stood out from the relentless AI-focused presentations that have dominated tech events for years, as the company explicitly chose to downplay its AI messaging when announcing a refreshed XPS laptop lineup, new ultraslim and entry-level Alienware laptops, Area-51 desktop refreshes and several monitors. \n\n\"One thing you'll notice is the message we delivered around our products was not AI-first,\" Dell head of product Kevin Terwilliger said during the presentation. \"A bit of a shift from a year ago where we were all about the AI PC.\" The shift stems from Dell's observation that consumers simply aren't making purchasing decisions based on AI capabilities. \"We're very focused on delivering upon the AI capabilities of a device -- in fact everything that we're announcing has an NPU in it -- but what we've learned over the course of this year, especially from a consumer perspective, is they're not buying based on AI,\" Terwilliger said. \"In fac",
        "id": 4497803,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/07/1556212/dell-walks-back-ai-first-messaging-after-learning-consumers-dont-care",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dell Walks Back AI-First Messaging After Learning Consumers Don't Care",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T15:28:27.430997+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T15:20:00+00:00",
        "description": "Microsoft's OneDrive cloud storage service has drawn renewed criticism for a particularly frustrating behavior pattern that can leave users without access to their local files after the service automatically activates during Windows updates. \n\nAuthor Jason Pargin recently outlined the problem: Windows updates can enable OneDrive backup without any plain-language warning or opt-out option, and the service then quietly begins uploading the contents of a user's computer to Microsoft's servers. The trouble begins when users attempt to disable OneDrive Backup. According to Pargin, turning off the feature can result in local files being deleted, leaving behind only a desktop icon labeled \"Where are my files?\" \n\nUsers can redownload their files from Microsoft's servers, but attempting to then delete Microsoft's copies triggers another deletion of the local files. The only workaround requires users to hunt down YouTube tutorials that walk through the steps, as the relevant options are buried ",
        "id": 4497196,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/07/152242/everyone-hates-onedrive-microsofts-cloud-app-that-steals-then-deletes-all-your-files",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Everyone Hates OneDrive, Microsoft's Cloud App That Steals Then Deletes All Your Files'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T15:28:27.623598+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T14:40:00+00:00",
        "description": "Polymarket is disputing that the mission to capture Nicolas Maduro constituted an invasion and said it will only settle a prediction contract if the US military takes control of Venezuelan territory. From a report: The decision by the prediction market has angered gamblers and added to the controversy surrounding a successful wager on the timing of Maduro's capture that netted more than $400,000 in winnings for a mystery trader. \n\nThe dispute over the definition of \"invade\" highlights just one of the controversies faced by the mostly unregulated industry. Polymarket -- which only recently gained regulatory approval to operate legally in the US -- says on its website that it will resolve the \"Will the US invade Venezuela by ... ?\" contract if the US \"commences a military offensive intended to establish control over any portion of Venezuela\" by one of three dates. \"The resolution source for this market will be a consensus of credible sources,\" it adds. Prediction platforms such as Polym",
        "id": 4497197,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/07/1438220/polymarket-refuses-to-pay-bets-that-us-would-invade-venezuela",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Polymarket Refuses To Pay Bets That US Would 'Invade' Venezuela",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T14:21:58.039032+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T14:00:00+00:00",
        "description": "South Korea's President Lee Jae Myung asked at a televised policy meeting last month whether the country's state-run healthcare plan could cover hair-loss treatment, framing it as a question about whether hair loss qualifies as a disease. The health minister told Lee that baldness is generally considered an aesthetic problem and therefore covered out-of-pocket, but the 61-year-old president -- who himself has a full head of hair -- pushed back, arguing that young people experiencing thinning hair view their situation as a \"matter of survival.\" \n\nThe proposal has divided the country. South Korea is known for a cultural phenomenon called \"lookism,\" where physical appearance carries significant weight in professional and social settings. The expression \"your appearance is also a credential\" is common, and nearly all job applications require a photograph, including those for part-time barista positions. \n\nLee first made the pledge to cover hair-loss treatment during his unsuccessful 2022 ",
        "id": 4496566,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/07/094206/south-koreas-president-identifies-a-new-enemy-baldness",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "South Korea's President Identifies a New Enemy: Baldness",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T13:15:24.129407+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: The founder of a U.S.-based spyware company, whose surveillance products allowed customers to spy on the phones and computers of unsuspecting victims, pleaded guilty to federal charges linked to his long-running operation. pcTattletale founder Bryan Fleming entered a guilty plea in a San Diego federal court on Tuesday to charges of computer hacking, the sale and advertising of surveillance software for unlawful uses, and conspiracy.\n \nThe plea follows a multi-year investigation by agents with Homeland Security Investigations (HSI), a unit within U.S. Immigration and Customs Enforcement. HSI began investigating pcTattletale in mid-2021 as part of a wider probe into the industry of consumer-grade surveillance software, also known as \"stalkerware.\"\n \nThis is the first successful U.S. federal prosecution of a stalkerware operator in more than a decade, following the 2014 indictment and subsequent guilty plea of the creator of a phone su",
        "id": 4496020,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/07/0033238/founder-of-spyware-maker-pctattletale-pleads-guilty-to-hacking-advertising-surveillance-software",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Founder of Spyware Maker PcTattletale Pleads Guilty To Hacking, Advertising Surveillance Software",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T11:03:32.924165+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T10:00:00+00:00",
        "description": "Ritchie Torres has introduced a bill to ban government officials from using insider information to trade on political prediction markets like Polymarket. The bill was prompted by reports that traders on Polymarket made large profits betting on Nicolas Maduro's removal, raising suspicions that some wagers were placed using material non-public information. \"While such insider trading in capital markets is already illegal and often prosecuted by the Justice Department and Securities and Exchange Commission, online prediction markets are far less regulated,\" notes Axios. From the report: Rep. Ritchie Torres' (D-N.Y.) three-page bill, a copy of which was obtained by Axios, is called the Public Integrity in Financial Prediction Markets Act of 2026. It would ban federal elected officials, political appointees and bureaucrats from making insider trades on prediction sites sites such as Polymarket. Specifically, the bill prohibits such government officials from trading based on information tha",
        "id": 4495051,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/07/0026210/congressman-introduces-legislation-to-criminalize-insider-trading-on-prediction-markets",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Congressman Introduces Legislation To Criminalize Insider Trading On Prediction Markets",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T07:46:42.260399+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T07:00:00+00:00",
        "description": "National Weather Service pulled an AI-generated forecast graphic after it hallucinated fake town names in Idaho. \"The blunder -- not the first of its kind to be posted by the NWS in the past year -- comes as the agency experiments with a wide range of AI uses, from advanced forecasting to graphic design,\" reports the Washington Post. \"Experts worry that without properly trained officials, mistakes could erode trust in the agency and the technology.\" From the report: At first glance, there was nothing out of the ordinary about Saturday's wind forecast for Camas Prairie, Idaho. \"Hold onto your hats!\" said a social media post from the local weather office in Missoula, Montana. \"Orangeotild\" had a 10 percent chance of high winds, while just south, \"Whata Bod\" would be spared larger gusts. The problem? Neither of those places exist. Nor do a handful of the other spots marked on the National Weather Service's forecast graphic, riddled with spelling and geographical errors that the agency co",
        "id": 4494086,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/07/0014200/an-ai-generated-nws-map-invented-fake-towns-in-idaho",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "An AI-Generated NWS Map Invented Fake Towns In Idaho",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T04:32:24.723479+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T03:30:00+00:00",
        "description": "Boris Cherny, the creator of Claude Code at Anthropic, revealed a deceptively simple workflow that uses parallel AI agents, verification loops, and shared memory to let one developer operate with the output of an entire engineering team. \"I run 5 Claudes in parallel in my terminal,\" Cherny wrote. \"I number my tabs 1-5, and use system notifications to know when a Claude needs input.\" He also runs \"5-10 Claudes on claude.ai\" in his browser, using a \"teleport\" command to hand off work between the web and his local machine. This validates the \"do more with less\" strategy Anthropic's President Daniela Amodei recently pitched during an interview with CNBC. VentureBeat reports: For the past week, the engineering community has been dissecting a thread on X from Boris Cherny, the creator and head of Claude Code at Anthropic. What began as a casual sharing of his personal terminal setup has spiraled into a viral manifesto on the future of software development, with industry insiders calling it ",
        "id": 4493231,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/26/01/06/2239243/creator-of-claude-code-reveals-his-workflow",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Creator of Claude Code Reveals His Workflow",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T02:25:31.622105+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T02:02:00+00:00",
        "description": "According to Bloomberg, Discord has confidentially filed for a U.S. IPO. Reuters reports: The U.S. IPO market regained momentum in 2025 after nearly three years of sluggish activity, but hopes for a stronger rebound were tempered by tariff-driven volatility, a prolonged government shutdown and a late-year selloff in artificial intelligence stocks. Discord, which was founded in 2015, offers voice, video and text chatting capabilities aimed at gamers and streamers. According to a statement in December, the platform has more than 200 million monthly users.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Discord+Files+Confidentially+For+IPO%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F26%2F01%2F07%2F003225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F26",
        "id": 4492724,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/07/003225/discord-files-confidentially-for-ipo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Discord Files Confidentially For IPO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T02:25:31.800515+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T01:25:00+00:00",
        "description": "schwit1 shares a report from Gothamist: Wegmans in New York City has begun collecting biometric data from anyone who enters its supermarkets, according to new signage posted at the chain's Manhattan and Brooklyn locations earlier this month. Anyone entering the store could have data on their face, eyes and voices collected and stored by the Rochester-headquartered supermarket chain. The information is used to \"protect the safety and security of our patrons and employees,\" according to the signage. The new scanning policy is an expansion of a 2024 pilot. \nThe chain had initially said that the scanning system was only for a small group of employees and promised to delete any biometric data it collected from shoppers during the pilot rollout. The new notice makes no such assurances. Wegmans representatives did not reply to questions about how the data would be stored, why it changed its policy or if it would share the data with law enforcement.<p><div class=\"share_submission\" style=\"posi",
        "id": 4492725,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/06/2231258/nyc-wegmans-is-storing-biometric-data-on-shoppers-eyes-voices-and-faces",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NYC Wegmans Is Storing Biometric Data On Shoppers' Eyes, Voices and Faces",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T01:18:36.881515+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T00:45:00+00:00",
        "description": "sinij shares a news release from the Utah Department of Commerce: The state of Utah, through the Utah Department of Commerce's Office of Artificial Intelligence Policy, today announced a first-of-its-kind partnership with Doctronic, the AI-native health platform, to give patients with chronic conditions a faster, automated way to renew medications. This agreement marks the first state-approved program in the country that allows an AI system to legally participate in medical decision-making for prescription renewals, an emerging model that could reshape access to care and ultimately improve care outcomes. Politico provides additional context in its reporting: In data shared with Utah regulators, Doctronic compared its AI system with human clinicians across 500 urgent care cases. The results showed the AI's treatment plan matched the physicians' 99.2 percent of the time, according to the company. \"The AI is actually better than doctors at doing this,\" said Dr. Adam Oskowitz, Doctronic c",
        "id": 4492305,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/06/2227211/utah-allows-ai-to-renew-medical-prescriptions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Utah Allows AI To Renew Medical Prescriptions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T00:13:21.622171+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: On Monday, [Jensen Huang, the chief executive of the chip-making giant Nvidia] said the company would begin shipping a new A.I. chip later this year, one that can do more computing with less power than previous generations of chips could. Known as the Vera Rubin, the chip has been in development for three years and is designed to fulfill A.I. requests more quickly and cheaply than its predecessors. Mr. Huang, who spoke during CES, an annual tech conference in Las Vegas, also discussed Nvidia's surprisingly ambitious work around autonomous vehicles. This year, Mercedes-Benz will begin shipping cars equipped with Nvidia self-driving technology comparable to Tesla's Autopilot.\n \nNvidia's new Rubin chips are being manufactured and will be shipped to customers, including Microsoft and Amazon, in the second half of the year, fulfilling a promise Mr. Huang made last March when he first described the chip at the company's annual con",
        "id": 4491907,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/06/222251/nvidia-details-new-ai-chips-and-autonomous-car-project-with-mercedes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Details New AI Chips and Autonomous Car Project With Mercedes",
        "vote": 0
    }
]