[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T18:24:01.466115+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T17:30:08+00:00",
        "description": "Revisiting Resident Evil Outbreak in 2026 makes it clear that this was not a misguided experiment but something that was ahead of its time. Few survival horror games, even today, commit so fully to vulnerability, cooperation, and restraint. When viewed from a modern-day lens, Outbreak stands as a reminder that horror is often most effective when it limits the player rather than empowering them. \n\nIt may not have received its due in 2003, but in the modern landscape of co-op horror, its influence and ambition are impossible to ignore. It’s still not a perfect game by any stretch of the imagination, and most players would probably give up on the game on account of those tank controls and brutal survival horror mechanics – but those who stick with it in the long run would be able to appreciate its strengths.",
        "id": 4498889,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=GpF9L8wWWHo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GpF9L8wWWHo/hqdefault.jpg",
        "title": "Resident Evil Outbreak Review",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T16:04:37.691463+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T15:30:17+00:00",
        "description": "Among a suite of upcoming action-adventure games is Longevity: Yin and Yang, a title from studio 11 Games that blends precise combat, tactile puzzles, and fluid traversal, presenting a game many are referring to as “Soulslike”. Now, comparisons with FromSoftware are fair, if a little obvious - blades, fantasy, mystical worlds, Longevity certainly drops in this camp. But, there’s much more hidden detail in its action; there’s patience, measured pace, movement, and poise. \n\nThis feature delves into Longevity's gameplay, centring mostly on combat, as 11 Games’ effort demands study. This brand of combat is calm, deliberate, and precise, yet executed with lethal, tempered aggression. If you’re interested in technical yet rewarding action games, then you’ll need to keep your blades sharp for this one.",
        "id": 4497528,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=UNZh_oJVpc8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UNZh_oJVpc8/hqdefault.jpg",
        "title": "If You Are A Fan of Sekiro And Sifu,  Then This Combat Heavy Game Might Be Up Your Alley",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-07T13:50:57.416538+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-07T13:30:59+00:00",
        "description": "Sony's PlayStation Studios have been churning out quite a few hits over the years, giving players who've chosen the gaming juggernaut’s current-gen console some incredible experiences over the past few years. \n\n2025 was a good one with some great titles making their way to the PS5, and 2026 seems all set to usher in a few more! There's Saros to look forward to, bringing the best of Returnal to a new IP with some interesting twists. And of course, Marvel's Wolverine is finally inching closer to its final release! \n\nBut there's more to look forward to over this year and the next as we enter the final leg of the PS5 and PS5 Pro's shelf life. Join us and find out more about what the PS5 is slated to do this year and beyond.",
        "id": 4496379,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=m-TrRLdhlD4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/m-TrRLdhlD4/hqdefault.jpg",
        "title": "What PS5 Games Are PlayStation Studios Working On? | WHAT’S NEXT",
        "vote": 0
    }
]