[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T23:51:23.400713+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T23:45:00+00:00",
        "description": "Remember how California's government negotiated a 2024 deal where Google contributed millions to California's local newsrooms to offset advertisers moving to the search engine? \n\n\"A year after it was cemented &mdash; and billed as a model that could succeed where entire countries and continents had fallen short &mdash; the agreement is tangled in budget cuts, bureaucratic infighting and unresolved questions about who controls the money,\" reports Politico, \"leaving journalists empty-handed and casting doubt on whether the lofty experiment will ever live up to its promise.\"\n\n\n\nThe program, initially framed as a nearly $250 million commitment over five years, has secured just $20 million in new money for journalists in its first year, with no guarantee the funding will continue. It's changed hands twice since the University of California, Berkeley withdrew its support [with school officials \"worried they wouldn't have enough of a say in how the money was distributed\"]. Suggestions that o",
        "id": 4466721,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/03/0351247/googles-250m-deal-with-california-to-fund-newsrooms-may-be-stalled",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's $250M Deal with California to Fund Newsrooms May Be Stalled",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T23:51:23.652430+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T22:45:00+00:00",
        "description": "An anonymous reader shared\nthis report from Neowin:\n\nOffline Windows activation has been possible to do using the phone. However, it looks like Microsoft has quietly killed off that method as users online have found that they are no longer able to activate the OS using it... [As documented by Windows user Ben Kleinberg on his YouTube channel], Now when trying to activate the OS by attempting to call the phone number for Microsoft Product Activation, an automated voice response says the following: \"Support for product activation has moved online. For the fastest and most convenient way to activate your product, please visit our online product activation portal at aka.ms/aoh\" \n\n\nIf you are wondering, that link takes users to the Microsoft Product Activation Portal for online activation. Thus it appears that offline ways to activate Windows may no longer be available even though the official support documentation by the company may not reflect it yet.\n\n<p><div class=\"share_submission\" st",
        "id": 4466722,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/03/1947258/has-microsoft-discontinued-offline-activation-of-windows",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Has Microsoft Discontinued Offline Activation of Windows?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T22:44:45.085246+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T21:45:00+00:00",
        "description": "Why did the U.S. invade Venezuela and capture its leader Nicol&aacute;s Maduro? \"If you asked ChatGPT about it this morning, it told you that you&#226;(TM)re making it up,\" Wired reported Saturday: \n\nWIRED asked leading chatbots ChatGPT, Claude, and Gemini the same question a little before 9 am ET. In all cases, we used the free, default version of the service, since that's what the majority of users experience. We also asked AI search platform Perplexity, which advertises \"accurate, trusted, and real-time answers to any question...\"\n\n ChatGPT did not course-correct. Instead, it emphatically refuted that Maduro had been captured at all. \"That didn't happen,\" it wrote. \"The United States has not invaded Venezuela, and Nicol&#225;s Maduro has not been captured.\" It then rationalized: ChatGPT did not course-correct. Instead, it emphatically refuted that Maduro had been captured at all. \"That didn't happen,\" it wrote. \"The United States has not invaded Venezuela, and Nicol&#225;s Maduro h",
        "id": 4466457,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/03/200236/the-us-invaded-venezuela-and-captured-nicols-maduro---but-chatgpt-and-perplexity-disagree",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The US Invaded Venezuela and Captured Nicol&#225;s Maduro - But ChatGPT and Perplexity Disagree",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T21:38:03.422003+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T20:45:00+00:00",
        "description": "\"Starlink is beginning a significant reconfiguration of its satellite constellation focused on increasing space safety,\" announced Michael Nicolls, Starlink's vice president of engineering:\n\n\"We are lowering all Starlink satellites orbiting at ~550 km to ~480 km (~4400 satellites) over the course of 2026. The shell lowering is being tightly coordinated with other operators, regulators, and USSPACECOM. Lowering the satellites results in condensing Starlink orbits, and will increase space safety in several ways... Starlink satellites have extremely high reliability, with only 2 dead satellites in its fleet of over 9000 operational satellites. Nevertheless, if a satellite does fail on orbit, we want it to deorbit as quickly as possible. These actions will further improve the safety of the constellation, particularly with difficult to control risks such as uncoordinated maneuvers and launches by other satellite operators. \n\nBut orbits are being lowered for another reason (besides quick de",
        "id": 4466132,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/03/075205/spacex-lowering-orbits-of-4400-starlink-satellites-for-safetys-sake",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SpaceX Lowering Orbits of 4,400 Starlink Satellites for Safety's Sake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T20:32:07.379470+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T19:45:00+00:00",
        "description": "\"While a growing number of U.S. employers are mandating workers return to the office five days a week,\" reports the Washington Post, \"some companies say AI is saving them enough time to launch or sustain a four-day workweek. \n\n\"More companies may move toward a shortened workweek, several executives and researchers predict, as workers, especially those in younger generations, continue to push for better work-life balance.\" And \"several companies &mdash; especially those with a largely remote workforce &mdash; have adjusted their work rhythm after delegating many tasks to AI...\"\n\n\nAI \"has such a potential to have so much labor savings, you'll see firms shift to a four-day week in an evolutionary way,\" said Juliet Schor, an economist and sociologist at Boston College who has studied the subject. \"There's enough social consensus that people are exhausted and stressed....\" Small and medium businesses often adopt shortened workweeks to compete with big salaries for new hires and retention, ",
        "id": 4465784,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/03/0510258/could-ai-bring-us-four-day-workweeks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could AI Bring Us Four-Day Workweeks?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T18:18:54.298046+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T17:45:00+00:00",
        "description": "CNBC reports that U.S. airlines have \"canceled hundreds of flights to airports in Puerto Rico and Aruba, according to flight tallies from FlightAware and carriers' sites.\" \n\nJetBlue, Southwest, and American Airlines were among the multiple airlines showing cancelled flights, which \"included close to 300 flights to and from San Juan, Puerto Rico's Luis Mu&ntilde;oz Mar&iacute;n International Airport, more than 40% of the day's schedule, according to FlightAware.\"\n\n\nAirlines canceled flights throughout the Caribbean on Saturday following U.S. strikes on Venezuela after the Federal Aviation Administration ordered commercial aircraft to avoid airspace in parts of the region.... It wasn't immediately clear how long the disruptions would last, though such broad restrictions are often temporary. Airlines said they would waive change fees and fare differences for customers affected by the airspace closures who could fly later in the month. \n\nCNN cites a U.S. official who says more than 150 U.",
        "id": 4465122,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/03/1740239/airlines-cancel-hundreds-of-flights-after-us-attack-on-venezuela",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Airlines Cancel Hundreds of Flights After U.S. Attack on Venezuela",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T17:12:33.811248+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T16:34:00+00:00",
        "description": "86 aircraft were affected by an incident in Denver ,and 256 more in Dallas-Fort Worth, America's Federal Aviation Admistrationtold the Washington Post:\n\n\n\nThe pilots flying into Denver International Airport could tell something was wrong. In urgent calls to air traffic controllers, they reported that the Global Positioning System was going haywire, forcing them to rely on backup navigation systems for more than a day. The Federal Aviation Administration issued a warning to air traffic in the area. Eight months later, in October 2022, it happened again &mdash; this time at Dallas-Fort Worth International Airport, which shut down a runway as pilots and air traffic controllers scrambled over two days without GPS to guide them. Federal officials have not said who was responsible for interfering with the systems or why it took so long to get them back online, though they've said the Denver incident was unintentional. But the disruptions stoked fear about the security vulnerabilities of GPS",
        "id": 4464717,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/03/0429234/interference-with-americas-gps-system-has-grown-dramatically",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Interference With America's GPS System 'Has Grown Dramatically'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T16:05:54.360297+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T15:34:00+00:00",
        "description": "AI startups now outnumber all publicly traded U.S. companies, according to a year-end note to investors from economists at Vanguard. \n\nAnd yet that report also suggest the jobs most susceptible to replacement by AI \"are actually thriving, not dying out,\" writes Forbes:\n\n\n\"The approximately 100 occupations most exposed to AI automation are actually outperforming the rest of the labor market in terms of job growth and real wage increases,\" the Vanguard report revealed. \"This suggests that current AI systems are generally enhancing worker productivity and shifting workers' tasks toward higher-value activities...\" \n\nThe job growth rate of occupations with high AI exposure &mdash; including office clerks, HR assistants, and data scientists &mdash; increased from 1% in pre-COVID-19 years (2015 through 2019) to 1.7% in 2023 and beyond, according to Vanguard's research. Meanwhile, the growth rate of all other jobs declined from 1.1% to 0.8% over the same period. Workers in AI-prone roles are ",
        "id": 4464348,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/03/0259241/jobs-vulnerable-to-ai-replacement-actually-thriving-not-dying-out-report-suggests",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jobs Vulnerable to AI Replacement Actually 'Thriving, Not Dying Out', Report Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T12:54:31.639065+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T12:01:00+00:00",
        "description": "A small section of the International Space Station that has experienced persistent leaks for years appears to have stopped venting atmosphere into space. ArsTechnica: The leaks were caused by microscopic structural cracks inside the small PrK module on the Russian segment of the space station, which lies between a Progress spacecraft airlock and the Zvezda module. The problem has been a long-running worry for Russian and US operators of the station, especially after the rate of leakage doubled in 2024. This prompted NASA officials to label the leak as a \"high likelihood\" and \"high consequence\" risk. However, recently two sources indicated that the leaks have stopped. And NASA has now confirmed this. \n\n\"Following additional inspections and sealing activities, the pressure in the transfer tunnel attached to the Zvezda Service Module of the International Space Station, known as the PrK, is holding steady in a stable configuration,\" a space agency spokesman, Josh Finch, told Ars. \"NASA an",
        "id": 4463360,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/02/196256/after-half-a-decade-the-russian-space-station-segment-stopped-leaking",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "After Half a Decade, the Russian Space Station Segment Stopped Leaking",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T09:38:23.506729+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T09:30:00+00:00",
        "description": "New York City's statewide smartphone ban that went into effect this fall has been largely successful at getting students to focus in class and socialize at lunch, but teachers across the city have discovered an unexpected side effect: many teenagers cannot read analog clocks. \"The constant refrain is 'Miss, what time is it?'\" said Madi Mornhinweg, a high school English teacher in Manhattan, who eventually started responding by asking students to identify the big hand and little hand themselves. \n\nTiana Millen, an assistant principal at Cardozo High School in Queens, said the ban has helped move foot traffic more swiftly through hallways and gotten more students to class on time -- they just don't know it because they can't read the wall clocks. The city's education department says students learn clock-reading in first and second grade. A 2017 Oklahoma study found only one in five children ages 6-12 could read analog clocks, and England began replacing classroom analog clocks with digi",
        "id": 4462523,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/02/1919255/nyc-phone-ban-reveals-some-students-cant-read-clocks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NYC Phone Ban Reveals Some Students Can't Read Clocks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T06:27:35.128701+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T06:01:00+00:00",
        "description": "A new sweeping meta-analysis has found no reliable link between economic inequality and well-being or mental health, challenging a long-held assumption that has shaped public health policy discussions for decades. The study, led by Nicolas Sommet at the University of Lausanne and Annahita Ehsan at the University of British Columbia, synthesized 168 studies involving more than 11 million participants across most world regions. The researchers screened thousands of scientific papers and contacted hundreds of researchers to compile the dataset, extracting more than 100 study features from each paper and linking them to more than 500 World Bank indicators. \n\nThey also replicated their findings using Gallup World Poll data spanning 2005 to 2021, which surveyed more than two million respondents from more than 150 countries. People living in more economically unequal places did not, on average, report lower life satisfaction or happiness than those in more equal places. The average effect ac",
        "id": 4461886,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/02/1954229/economic-inequality-does-not-equate-to-poor-well-being-or-mental-health-massive-meta-analysis-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Economic Inequality Does Not Equate To Poor Well-Being or Mental Health, Massive Meta-Analysis Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T04:21:14.722569+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T03:30:00+00:00",
        "description": "Dell is planning to bring back its XPS laptop branding, according to a news report, just one year after the company retired the storied name in favor of a simplified naming scheme that organized its consumer and professional lineup into Dell, Dell Pro and Dell Pro Max tiers. VideoCardz reported this week that Dell has presented an updated XPS lineup during prebriefings ahead of CES 2026, though the company has not officially confirmed the badge's return. \n\nThe reported reversal would come after Dell launched the Dell 14 Premium and Dell 16 Premium in mid-2025 as flagship consumer models meant to carry the XPS legacy forward. Those machines replaced the XPS 14 and XPS 16 in Dell's lineup.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Dell's+XPS+Brand+May+Return+Just+a+Year+After+Being+Retired%2C+Report+Claims%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F26%2F01%2F02%2F192248%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtw",
        "id": 4461532,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/02/192248/dells-xps-brand-may-return-just-a-year-after-being-retired-report-claims",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dell's XPS Brand May Return Just a Year After Being Retired, Report Claims",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T02:13:00.081004+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-03T01:30:00+00:00",
        "description": "The tech industry needs to move \"beyond the arguments of slop vs sophistication\" and develop a new \"theory of the mind\" that accounts for humans now equipped with \"cognitive amplifier tools,\" Microsoft CEO Satya Nadella wrote in a year-end reflection blog. The post frames 2026 as yet another \"pivotal year for AI\" -- but one that \"feels different in a few notable ways.\" Nadella claims the industry has moved past the initial discovery phase and is now \"beginning to distinguish between 'spectacle' and 'substance.'\" He argues for evolving beyond Steve Jobs' famous \"bicycles for the mind\" framing, positioning AI instead as \"scaffolding\" for human potential rather than a substitute. \n\n\"We will evolve from models to systems when it comes to deploying AI for real world impact,\" Nadella writes, adding that these systems must consider their societal impact on people and the planet. \"For AI to have societal permission it must have real world eval impact.\"<p><div class=\"share_submission\" style=\"p",
        "id": 4461145,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/02/1851202/microsoft-ceo-time-to-move-beyond-the-arguments-of-slop-vs-sophistication",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft CEO: Time To Move 'Beyond the Arguments of Slop vs Sophistication'",
        "vote": 0
    }
]