[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T18:58:51.964162+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T18:00:02+00:00",
        "description": "As a private wealth banker and mortgage lender, Nicole Hopkins has seen firsthand how people’s shame regarding their money situation perpetuates their struggle. She encourages everyone to open up about their honest money situation to destigmatize financial problems like debt and loans and help everyone solve problems while they are still small. \n\nAs a former private wealth banker and current mortgage lender, Nicole has spent thousands of hours having open conversations with individuals about their financial situations. In her talk, she dives into this vulnerable concept with our TEDx community as we explore the power of authentic money conversations. \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4508964,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1Dc8YHte-Aw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1Dc8YHte-Aw/hqdefault.jpg",
        "title": "How honest money conversations can boost your financial health | Nicole Hopkins | TEDxUTulsa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:42.311890+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:35:48+00:00",
        "description": "Gina Samman takes us back to 1959—the year humanity decided to eradicate smallpox. She tells the story of a frontline worker who used a small photo book to help villagers identify cases, ultimately driving innovation in global prevention and control models. “Great changes often start with a simple idea,” she says. From smallpox to COVID-19, pandemics have exposed inequalities and divisions, yet they have also shown her hope: the new global Pandemic Agreement is making data sharing, collaborative technology creation, and equitable distribution possible. “How can we truly stop the next pandemic? Is it vaccines or drugs? These are certainly important,” she notes. “But I believe we need to think more about solidarity, our perspective on equity, and our collective action. The strongest defense against a pandemic will always be ourselves.” Dr Gina SAMAAN is the Regional Emergency Director of the World Health Organization (WHO) Regional Office for the Western Pacific.  She is an infectious d",
        "id": 4508207,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KX22HJs8t3o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KX22HJs8t3o/hqdefault.jpg",
        "title": "What it really takes to stop the next pandemic | Gina Samaan | TEDxZizhu Park",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:42.412061+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:35:33+00:00",
        "description": "Hummingbirds reveal some of the world’s greatest lessons in survival, resilience, and wonder. Through rare footage of nests, hatchings, and one remarkable bird with a broken leg, discover why noticing nature’s “little miracles” can change how we see and protect the world around us. Eric Pittman is an adventurer, conservationist, and artist with a diverse career spanning the Canadian Coast Guard, aviation, and environmental activism. A former commercial helicopter pilot, he worked in search and rescue, firefighting, and exploration. In the arts, he developed Spectral Visions, performed for Prince Charles and Princess Diana, and was featured in National Geographic. He later founded Sterling Glass Foundry, repurposing waste glass into art. In 2017, he co-founded the Canadian Orca Rescue Society, working with First Nations to remove fish farms. Recognized for bravery and conservation, he has collaborated with BBC, Netflix, and recently presented to the House of Commons on environmental is",
        "id": 4508208,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=i0lhWL1N81c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/i0lhWL1N81c/hqdefault.jpg",
        "title": "The miraculous life of a hummingbird | Eric Pittman | TEDxVictoria",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:42.509522+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:35:25+00:00",
        "description": "Oupa Sibeko’s interactive performance art at TEDxJohannesburg challenges us to handle our fragile planet with care amidst a global water scarcity crisis | A fragile egg hurtles through the air, binding strangers in a high-stakes game of trust where a single slip means failure. This Oupa Sibeko performance art piece, captured live at TEDxJohannesburg Countdown 2025, is a visceral exploration of our precarious relationship with the natural world. Beneath suspended droplets mimicking a water scarcity crisis, playful interaction shifts into a stark ritual on consumption. Through satire and tension, we are forced to confront the absurdity of prioritising synthetic luxuries while the planet’s essential resources dwindle. In the climate crisis, as in a game of catch, we are all holding the future in our hands. Oupa Sibeko is an interdisciplinary artist and scholar whose work bridges performance, ritual, and African Indigenous Knowledge to confront the spiritual and ecological legacies of col",
        "id": 4508209,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=yL43y5Ahr1w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 1,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yL43y5Ahr1w/hqdefault.jpg",
        "title": "The playful urgency of climate action | Oupa Sibeko | TEDxJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:42.599391+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:34:56+00:00",
        "description": "In this inspiring talk, the speaker explores how embracing failure can become the most powerful tool for growth and success. Drawing from the demanding journey of pursuing Chartered Accountancy (CA), he highlights the importance of resilience, perseverance, and a positive mindset in overcoming setbacks. Through real-life insights and personal reflections, the talk emphasizes that failure isn’t the opposite of success, it’s part of the path toward it. With the right mindset, every fall becomes a lesson, every struggle a stepping stone, and every setback a setup for a greater comeback. Anup Thomas is an Executive Director at Grant Thornton Bharat LLP, with over 15 years of experience in managing projects using agile principles to deliver risk advisory services. He is a Chartered Accountant, a Certified Internal Auditor, and a Certified ScrumMaster®. He has also led and contributed to multiple international engagements, publications, and thought leadership initiatives. This talk was give",
        "id": 4508210,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9hqxxIp4UhI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9hqxxIp4UhI/hqdefault.jpg",
        "title": "Mindset matters, make the most out of failure. | Anup Thomas | TEDxSJCC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:42.687453+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:34:00+00:00",
        "description": "In the talk, David argues that the world is changed by the \"Virtuosity of Community,\" where open collaboration among \"little people\" in places like Huaqiangbei and Shaji drives global innovation. From the rapid hardware iterations in Shenzhen to the digital \"make when sold\" furniture factories in rural Taobao villages, he shows how technology like CNC and AI empowers workers rather than replacing them. By focusing on practical, results-first AI in markets like Yiwu, these grassroots communities are building the \"new quality productive forces\" essential for achieving Common Prosperity and doubling the middle-income group by 2040. Entrepreneur & technologist behind early virtual worlds, immersive tech, and metaverse platforms\nCo-founder of Xinchejian, China's first makerspace and catalyst for the national maker movement\nOpen-source leader, contributing to Apache projects and serving with the Free Software Foundation & ObjectWeb Foundation This talk was given at a TEDx event using the TE",
        "id": 4508211,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WXBCpbvAUNk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WXBCpbvAUNk/hqdefault.jpg",
        "title": "Virtuosity of Community: How collaboration changes the world? | David Li | TEDxNYU Shanghai Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:42.774708+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:33:29+00:00",
        "description": "In The Power of Presence: Becoming Unstoppable, Heidi Dugan shares how her experiences of self-doubt and cultural displacement, particularly after moving from Australia to China, led her realize the difference between fitting in and truly belonging. She argues that success comes not from perfection or performance, but from presence and alignment with one’s authentic self. Using Michelangelo’s metaphor of carving away what does not belong, she emphasizes that mastery is the process of uncovering who we truly are. She concludes that real success should be measured by the person we become, not by external achievements. Host of an award-winning TV show withn6M+ daily viewers \nGenerated $1.5M+ in live sales on national TV\nFeatured in Channel 9 News, Harper's Bazaar, The Financial Times, SCMP\nRenowned for her ability to command attention & inspire action This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https:",
        "id": 4508212,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Z2drPiNEyG8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z2drPiNEyG8/hqdefault.jpg",
        "title": "The Power of Presence: becoming UNSTOPPABLE | Heidi Dugan | TEDxNYU Shanghai Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:42.862328+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:33:11+00:00",
        "description": "In the talk, Dr. George Hu examines why people pursue mastery and argues that the motivation behind virtuosity matters deeply for mental health. Drawing on psychological research, he distinguishes between pursuing mastery out of genuine passion and pursuing it out of fear, lack, or the need for validation. Using concepts such as satisficers versus maximizers and Maslow’s hierarchy of needs, he shows how modern society and consumer culture amplify unhealthy striving. He ultimately argues that while virtuosity seeks individual excellence, virtue—moral behavior grounded in care for others—leads to greater well-being, stronger relationships, and longer, healthier lives. U.S.-licensed clinical psychologist with 10+ years of cross-cultural experience\nDirector of Counseling & Wellness at Duke Kunshan University\nPresident of the Shanghai International Mental Health Association \nBA, UC Berkeley; MA& PsyD, Alliant International University This talk was given at a TEDx event using the TED confer",
        "id": 4508213,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=l3Gz46-uhvI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/l3Gz46-uhvI/hqdefault.jpg",
        "title": "The Virtuoso’s Dilemma | Dr. George Hu | TEDxNYU Shanghai Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:42.949508+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:32:37+00:00",
        "description": "Innovation doesn’t start in boardrooms—it starts in lived experience.\n\nIn this talk, investor and cultural strategist Chris Lyons traces his unconventional path from restaurant server and music producer to venture capitalist leading one of the world’s largest crypto-focused investment platforms. Along the way, he reveals how culture, curiosity, and bold experimentation shaped his understanding of where wealth is actually created—and who gets access to it.\n\nLyons reframes venture capital, blockchain, and cryptocurrency not as abstract financial systems, but as tools for expanding ownership, especially for creators and communities historically excluded from early-stage opportunity. Through stories about private markets, decentralized technology, and the power of “earned secrets,” he shows how the next generation of wealth will be built not just through capital—but through access, networks, and imagination. Chris Lyons is a venture capitalist, cultural strategist, and technology investor",
        "id": 4508214,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=E12vZwobq48",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/E12vZwobq48/hqdefault.jpg",
        "title": "Hiding the Wires: How Technology Creates New Wealth | Chris Lyons | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:43.038247+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:32:11+00:00",
        "description": "What does it mean to “go back and get it”—especially when the very premise of democracy feels fragile?\n\nDrawing on the Akan concept of sankofa, Tulane Montgomery invites us to reflect on America’s approaching 250th anniversary with honesty and courage. She names the country’s central contradiction: a nation founded on bold ideals, built through stolen land and stolen labor—brilliant and brutal at once. And yet, she argues, this moment is not proof that the project has failed. It is proof that the work is unfinished—and urgent.\n\nAs a student of history and a futurist, Montgomery frames the coming decades as a rare window of possibility: the U.S. is moving toward a future with no single racial majority and unprecedented age diversity, creating an opportunity to rebuild institutions that can finally match the nation’s “poetry” with real practice.\n\nShe offers a practical toolkit for recommitting to an “American evolution”: reject “lazy proxies” for excellence, invest in proximate leaders,",
        "id": 4508215,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=aomR9BpTJ_Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aomR9BpTJ_Q/hqdefault.jpg",
        "title": "Sankofa and the American Evolution: Going Back to Move Forward | Tulaine Montgomery | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:43.126724+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:30:38+00:00",
        "description": "What can 27 AI unicorns founded by Harvard and MIT affiliates teach us about the next era of the intelligence revolution? In this talk, Devon Triplett, an AI researcher, founder, and investor, shares surprising insights from his 2025 Harvard-MIT AI Unicorns Trends Report, revealing how the abundance of intelligence is becoming both compounding and democratizing, and why Cambridge–Boston is positioned to emerge as a leader in this new technological paradigm. This is a data-driven exploration of the future of intelligence and the ambitious founders defining it. Devon Triplett is an AI researcher, founder, and investor. He is the Founder and Managing Partner of 021T Capital, an early-stage venture capital firm partnering with ambitious intelligence-era startups. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4508216,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nE5AegmvsUQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nE5AegmvsUQ/hqdefault.jpg",
        "title": "Harvard-MIT’s AI Unicorns and Truths About the Future of Intelligence | Devon Triplett | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:43.230036+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:30:22+00:00",
        "description": "In this forward-looking and rigorously grounded talk, Ayush Chopra invites us into a near future where millions of AI agents act simultaneously—shopping, trading, commuting, and optimizing—only to overwhelm the very systems they were meant to improve. Through the vivid metaphor of a Black Friday “digital stampede,” he reveals a core truth about modern artificial intelligence: today’s AI can communicate, but it cannot coordinate.\n\nDrawing from years of research at MIT, Chopra reframes the challenge of AI not as a question of individual intelligence, but of collective behavior. He introduces Large Population Models—an entirely new paradigm that simulates millions of interacting agents and billions of interactions—to show how coordination transforms chaos into order. When AI systems learn to anticipate one another, share intent, and align with human goals, entire economies become more stable, efficient, and resilient. Ayush Chopra is an AI researcher, systems designer, and entrepreneur f",
        "id": 4508217,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gFAKz5R9Xt4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gFAKz5R9Xt4/hqdefault.jpg",
        "title": "Why AI Needs to Learn How to Work Together | Ayush Chopra | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:43.374311+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:29:53+00:00",
        "description": "In this quietly astonishing talk, master glass artist Josh Simpson takes us far beyond the studio—and all the way to the surface of the Moon. Drawing on more than fifty years of experimentation with glass, cosmology, and material science, Simpson asks a deceptively simple question: what if we could build human habitats in space using materials already there?\n\nRather than focusing on art alone, Simpson walks us through a radical collaboration with architect Martin Bermudez and NASA’s Innovative Advanced Concepts program. Using lunar regolith—the dust and rock that covers the Moon’s surface—he demonstrates that it is chemically suited to be melted into glass. With only minimal materials brought from Earth, it may be possible to blow massive glass structures capable of holding atmosphere, withstanding extreme temperature swings, and shielding humans from radiation.\n\nWhat unfolds is a vision where ancient techniques meet frontier science: a 2,300-year-old glassblowing process applied to a",
        "id": 4508218,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WjfnNenFaJM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WjfnNenFaJM/hqdefault.jpg",
        "title": "When ancient craft meets deep space | Josh Simpson | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:43.528867+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:29:44+00:00",
        "description": "Robots have been promised to reshape our everyday lives, but that future still hasn’t arrived. Roboticist Navid Aghasadeghi explores the evolution of robotics software and how modern AI is finally changing what robots can do, and what it will take for robots to be deployed at scale in the world around us. Navid Aghasadeghi is a roboticist and entrepreneur with over a decade of experience in robotics and AI. He earned his PhD in Electrical and Computer Engineering from the University of Illinois Urbana-Champaign and has worked at leading robotics companies including Boston Dynamics and Rethink Robotics. At Boston Dynamics, he led the development of manipulation skills for Spot to operate industrial objects in the real world, such as levers, wheels, and switch boxes. He is now the founder of a robotics company developing the next generation of intelligent robotic systems. This talk was given at a TEDx event using the TED conference format but independently organized by a local community",
        "id": 4508219,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mg7qmDZS1Pk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 1,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mg7qmDZS1Pk/hqdefault.jpg",
        "title": "Robotics today: hype or reality? | Navid Aghasadeghi | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:43.824203+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:28:31+00:00",
        "description": "Dr. Mehak Bansal shares how parents can detect danger in children, hours before ICU monitors, act decisively in emergencies, and choose the right care to save lives. It highlights the three-step framework of early recognition, timely action, and seeking appropriate help, showing how parental instinct, observation, and preventive measures at home play a crucial role in child safety. The talk reframes parents as the first and most vital members of a child’s critical care team. Dr. Mehak Bansal is a Senior Consultant in Pediatrics and a Child Critical Care Specialist at Clio Mother and Child Institute. With over two decades of dedicated service in treating critically ill children with compassion and excellence; she has served at renowned institutions including King’s College Hospital and Great Ormond Street Hospital for Children, London, UK. Her clinical expertise spans Pediatric Cardiac Intensive Care, Pediatric Critical Care Nephrology, and Point-of-Care Ultrasound. An accomplished aca",
        "id": 4508220,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SUeXqGQacvY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SUeXqGQacvY/hqdefault.jpg",
        "title": "Parents are the First Monitors: Saving Lives Before the ICU | Dr. Mehak Bansal | TEDxIKGPTU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:49:44.080947+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:25:08+00:00",
        "description": "Kati Zaragoza reflexiona sobre la capacidad humana de reinventarse después de una pérdida, un error o un cambio inesperado. A través de experiencias personales y aprendizajes significativos, la ponente plantea el volver a empezar no como un retroceso, sino como un proceso creativo que requiere valentía, conciencia y decisión. Television presenter, content creator, entrepreneur and founder of a community to empower women. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4508221,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CfQpQ5SMiiE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CfQpQ5SMiiE/hqdefault.jpg",
        "title": "El arte de volver a empezar | Katerine Yohana Zaragoza | TEDxOxford Instituto Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:54.200397+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:35:33+00:00",
        "description": "Radhika Cheema presents a thoughtful reflection on how small, consistent improvements can lead to lasting change. The talk highlights the power of everyday choices and steady effort in shaping mindset, habits, and balance in life. Drawing from common life experiences, it shows how becoming just a little better each day can create meaningful progress, reminding us that real transformation is built on everday basis. Radhika Cheema, born in Ambala, is a distinguished entrepreneur, committed social worker, and a passionate advocate of women’s empowerment. She serves as the Managing Director of Deerghayurveda, Director E-Commerce & Digital Marketing at Divisa Herbals Pvt. Ltd., and Trustee of the IKJ Care Foundation, through which she has made meaningful contributions to health, education, cleanliness, and skill development initiatives. As the Brand Ambassador of Swachh Bharat Abhiyan, Ambala, and President of the District Youth Development Organization (Women’s Wing), her leadership and s",
        "id": 4507599,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3M0Io6ABNGM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3M0Io6ABNGM/hqdefault.jpg",
        "title": "1% Rule: Learn Something New Everyday | Radhika Cheema | TEDxIKGPTU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:54.382438+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:35:20+00:00",
        "description": "Dans son talk, Damiens Nicolas nous invite à changer de perspective sur la crise environnementale des sargasses, un mur d’algues invasives qui s’abat périodiquement sur les Caraïbes. À partir de son expérience en diplomatie climatique, il interroge les réponses fragmentées des Etats et territoires de la mer des Caraïbes face à ce risque émergent. En représentant les sargasses comme un commun négatif, c'est-à-dire un bien commun qui ne nous unit pas par choix, mais par contrainte, il appelle à construire des ponts pour une Caraïbe plus unie et plus résiliante. \n\nCrédits Interprétation LSF : Chloé JUMET.\n\n Damiens NICOLAS travaille entre la Guadeloupe, la France hexagonale et les Caraïbes. Ses centres d’intérêt portent sur l’écologie politique, les théories critiques de la modernité et le design de l’action publique dans les territoires d’Outre-mer.\nDepuis 2020, il est membre co-fondateur de l’Observatoire Terre-Monde, dédié aux écologies politiques des Outre-mer et de leurs régions voi",
        "id": 4507600,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=N7sgEKEVfyA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/N7sgEKEVfyA/hqdefault.jpg",
        "title": "Sargasses : un bien commun pour une Caraïbe plus unie (LSF) | Damiens NICOLAS | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:54.515150+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:35:17+00:00",
        "description": "Dans son talk, Damiens Nicolas nous invite à changer de perspective sur la crise environnementale des sargasses, un mur d’algues invasives qui s’abat périodiquement sur les Caraïbes. À partir de son expérience en diplomatie climatique, il interroge les réponses fragmentées des Etats et territoires de la mer des Caraïbes face à ce risque émergent. En représentant les sargasses comme un commun négatif, c'est-à-dire un bien commun qui ne nous unit pas par choix, mais par contrainte, il appelle à construire des ponts pour une Caraïbe plus unie et plus résiliante. \n\n Damiens NICOLAS travaille entre la Guadeloupe, la France hexagonale et les Caraïbes. Ses centres d’intérêt portent sur l’écologie politique, les théories critiques de la modernité et le design de l’action publique dans les territoires d’Outre-mer.\nDepuis 2020, il est membre co-fondateur de l’Observatoire Terre-Monde, dédié aux écologies politiques des Outre-mer et de leurs régions voisines. Fellow de la Caribbean Climate Justi",
        "id": 4507601,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=z3K-Toz4JIE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z3K-Toz4JIE/hqdefault.jpg",
        "title": "Les sargasses : un bien commun pour une Caraïbe plus unie | Damiens NICOLAS | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:54.625663+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:35:08+00:00",
        "description": "Et si le partage d’une simple recette pouvait changer votre regard sur le monde?\nEn explorant sa double identité bretonne et malgache, Mahité Perrault révèle comment la cuisine devient un espace d’identité, de lien et d’ouverture à l’autre; un moyen de construire des ponts et de révéler son plein potentiel.\n\nCrédits Interprétation LSF : Chloé JUMET.\n\n Agronome de formation, entrepreneure et communicante, passionnée par la culture, l’agriculture et le bien-être, elle est diplômée d’un double master en sciences agronomiques et en géographie, elle a commencé sa carrière à l’INRA en Guadeloupe avant de se tourner vers la communication et l’événementiel, guidée par un fil rouge constant : la connexion humaine.\nFondatrice de l’agence Rézo, elle accompagne institutions, entreprises et initiatives locales en valorisant la richesse culturelle et sociale des territoires caribéens. Elle est la fondatrice de projets tels que KKFèt, l'agenda culturel numérique incontournable en Guadeloupe depuis p",
        "id": 4507602,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ycaiDv2bzOo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ycaiDv2bzOo/hqdefault.jpg",
        "title": "Quand cuisiner nous relie aux mondes ! (avec LSF) | Mahité PERRAULT | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:54.765047+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:35:01+00:00",
        "description": "Et si le partage d’une simple recette pouvait changer votre regard sur le monde?\nEn explorant sa double identité bretonne et malgache, Mahité Perrault révèle comment la cuisine devient un espace d’identité, de lien et d’ouverture à l’autre; un moyen de construire des ponts et de révéler son plein potentiel.\n\n Agronome de formation, entrepreneure et communicante, passionnée par la culture, l’agriculture et le bien-être, elle est diplômée d’un double master en sciences agronomiques et en géographie, elle a commencé sa carrière à l’INRA en Guadeloupe avant de se tourner vers la communication et l’événementiel, guidée par un fil rouge constant : la connexion humaine.\nFondatrice de l’agence Rézo, elle accompagne institutions, entreprises et initiatives locales en valorisant la richesse culturelle et sociale des territoires caribéens. Elle est la fondatrice de projets tels que KKFèt, l'agenda culturel numérique incontournable en Guadeloupe depuis plus de 12 ans, Kannaval Rivé, le guide prat",
        "id": 4507603,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=85f9ovoSA60",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/85f9ovoSA60/hqdefault.jpg",
        "title": "Quand cuisiner nous relie aux mondes ! | Mahité PERRAULT | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:54.869766+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:34:48+00:00",
        "description": "Swaraj Swain, the student of IKGPTU, explains why traditional classrooms often stifle innovation and fail to prepare students for the knowledge economy. Using data, real-world examples, and success stories from student startups, it contrasts the stagnant academic system with the dynamic, risk-friendly environments of dorms, labs, and incubation cells. Swaraj Swain highlights the shifts needed safety nets, creator-owned IP, and interdisciplinary collaboration to unleash student creativity, turning the “Trap of the Average” into the “Outlier Advantage,” where meaningful ideas and real-world value are created. Swaraj Swain is an ordinary student who chose to take risk & be different. A proud student of IKGPTU - IK Gujral Punjab Technical University, with a B.Tech in Electronics, he is currently pursuing ideas in AI (Education & Automation related). Yet, his professional footprint defies these traditional labels. Being an Engineer, Swaraj has command over Content Strategy, Marketing, AI, ",
        "id": 4507604,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5RQEvCGfw9s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5RQEvCGfw9s/hqdefault.jpg",
        "title": "From Trap of the Average to the Outlier Advantage | Swaraj Swain | TEDxIKGPTU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.000844+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:34:33+00:00",
        "description": "Partout où il existe, le Carnaval, floraison de couleurs, de musiques, de thématiques, est devenu un fait social total et, à ce titre, peut être observé et étudié par le biais des différentes sciences sociales.\nLa Guadeloupe n’échappe pas à ce phénomène. Le Carnaval y occupe une place chaque année plus importante. Les associations se multiplient, les groupes font assaut de créativité. Dans quasiment toutes les communes, les rues deviennent des scènes d’un spectacle toujours au rendez-vous.\nDonnant à voir et se faisant voir, ce Carnaval est un lieu de représentations et de discours : discours des carnavaliers, discours des responsables de groupes et des organisateurs, discours à propos et autour du carnaval. Ils sont donc d’une grande variété. Pourtant, parmi les plus répandus, se développe depuis de nombreuses années un discours sur la tradition carnavalesque en Guadeloupe et ses rapports avec la culture.\nUn bref retour historique permet de remettre en perspective l’origine, le dévelo",
        "id": 4507605,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SL6RNx6lXts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SL6RNx6lXts/hqdefault.jpg",
        "title": "Carnaval en Guadeloupe. Vous avez dit tradition ? (avec LSF) | Eric NABAJOTH | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.105066+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:34:25+00:00",
        "description": "Partout où il existe, le Carnaval, floraison de couleurs, de musiques, de thématiques, est devenu un fait social total et, à ce titre, peut être observé et étudié par le biais des différentes sciences sociales.\nLa Guadeloupe n’échappe pas à ce phénomène. Le Carnaval y occupe une place chaque année plus importante. Les associations se multiplient, les groupes font assaut de créativité. Dans quasiment toutes les communes, les rues deviennent des scènes d’un spectacle toujours au rendez-vous.\nDonnant à voir et se faisant voir, ce Carnaval est un lieu de représentations et de discours : discours des carnavaliers, discours des responsables de groupes et des organisateurs, discours à propos et autour du carnaval. Ils sont donc d’une grande variété. Pourtant, parmi les plus répandus, se développe depuis de nombreuses années un discours sur la tradition carnavalesque en Guadeloupe et ses rapports avec la culture.\nUn bref retour historique permet de remettre en perspective l’origine, le dévelo",
        "id": 4507606,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=YdcnQIUrO6w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YdcnQIUrO6w/hqdefault.jpg",
        "title": "Carnaval en Guadeloupe. Vous avez dit tradition ? | Eric NABAJOTH | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.232324+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:33:55+00:00",
        "description": "This talk explores the “hidden curriculum” that schools often overlook: essential life skills like problem-solving, financial literacy and teamwork. Drawing from hands-on experiences running small entrepreneurial stalls, Arzoi Makkar just at the age of 10, demonstrates how real-world challenges teach creativity, negotiation, and money management skills that academics alone cannot provide. Using global examples from Finland and Norway, the talk highlights why schools must complement textbooks with practical experiences to prepare students not just for exams, but for life’s unpredictable challenges. Arzoi Makkar, a young visionary and Grade 5 student at Dass and Brown Experiential School, Panchkula, where experiential learning fuels her curiosity. She is a 10 year old young entrepreneur-in-making. She is turning ideas into action. With an unstoppable spirit, she showcased her skills through multiple exciting stalls, proving that age is no barrier to innovation. When she's not ideating h",
        "id": 4507607,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pdgTOTD9Ul8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pdgTOTD9Ul8/hqdefault.jpg",
        "title": "The Hidden Curriculum most of the Schools Never Teach | Arzoi Makkar | TEDxIKGPTU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.350172+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:33:47+00:00",
        "description": "La transition énergétique est en cours en Guadeloupe. Elle se traduit par deux grandes volontés : bénéficier d’une énergie électrique décarbonée et améliorer notre autonomie pour produire cette électricité. Pour réussir cette transition, cela suppose de substituer progressivement les moyens de production dits « conventionnels », fonctionnant au fuel ou au charbon par des énergies dont la source de production est renouvelable, locale.\nDu fait de l’insularité de la Guadeloupe, le système électrique subit de fortes variations de fréquence que l’apport d’inertie peut limiter. Or, les moyens conventionnels apportent cette inertie, tandis que l’éolien et le photovoltaïque produisent de l’électricité mais aucune inertie. Ainsi, pour sécuriser le système électrique, éoliens et photovoltaïques, gratuits et disponibles sont parfois limités pour privilégier les moyens conventionnels, chers et polluants, contraire au principe de transition énergétique.\nPour mettre fin à ce paradoxe, le compensate",
        "id": 4507608,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=dumDn9yQt1Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dumDn9yQt1Y/hqdefault.jpg",
        "title": "Voyage en tandem sur le terrain de la transition énergétique (LSF) | Hugo GEVRET | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.462915+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:33:38+00:00",
        "description": "La transition énergétique est en cours en Guadeloupe. Elle se traduit par deux grandes volontés : bénéficier d’une énergie électrique décarbonée et améliorer notre autonomie pour produire cette électricité. Pour réussir cette transition, cela suppose de substituer progressivement les moyens de production dits « conventionnels », fonctionnant au fuel ou au charbon par des énergies dont la source de production est renouvelable, locale.\nDu fait de l’insularité de la Guadeloupe, le système électrique subit de fortes variations de fréquence que l’apport d’inertie peut limiter. Or, les moyens conventionnels apportent cette inertie, tandis que l’éolien et le photovoltaïque produisent de l’électricité mais aucune inertie. Ainsi, pour sécuriser le système électrique, éoliens et photovoltaïques, gratuits et disponibles sont parfois limités pour privilégier les moyens conventionnels, chers et polluants, contraire au principe de transition énergétique.\nPour mettre fin à ce paradoxe, le compensate",
        "id": 4507609,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0_chIO9XZns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0_chIO9XZns/hqdefault.jpg",
        "title": "Voyage en tandem sur le terrain de la transition énergétique | Hugo GEVRET | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.590848+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:33:27+00:00",
        "description": "In this talk, cultural researcher Beatriz Salas explores the global significance of the Shahnameh and Persian literature, and how these works have traveled across languages, borders, and centuries. She reflects on storytelling as a shared human inheritance, showing how Persian epics continue to shape imagination, ethics, and identity far beyond Iran. This talk reveals literature as a bridge a place where light enters through words that endure. Literary translator and university professor This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4507610,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KSofINX5hc4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KSofINX5hc4/hqdefault.jpg",
        "title": "Iam Gordafarid | Beatriz Salas | TEDxSUT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.695122+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:33:23+00:00",
        "description": "Dans son talk, Laurent Gaudens raconte comment le regard des autres a façonné son enfance et sa vie d’adulte : le choc des cicatrices, la douleur des soins, les malaises et les moqueries… mais aussi la douceur des rencontres et la force de l’amour.\nÀ travers son parcours, il partage un chemin intime vers l’acceptation de soi, la confiance et la réconciliation avec son image, montrant comment il a appris à transformer chaque regard en un moteur de résilience et de puissance personnelle.\n\nCrédits Interprétation LSF : Chloé JUMET.\n\n Victime d’un grave accident durant son enfance, il est brûlé sur tout le corps à plus de 60%. Fort de 25 ans d’expérience dans la relation client — en tant que salarié, consultant, commercial et entrepreneur —, il se consacre depuis dix ans à trois projets engagés : fondateur de Dulcenae, première maison de beauté inclusive, président de l’association Burns and Smiles, qui accompagne les personnes brûlées, et producteur du spectacle militant \"Ma différence t’",
        "id": 4507611,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QpmLwayTXGI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QpmLwayTXGI/hqdefault.jpg",
        "title": "Transformer le monde, regard après regard (avec LSF) | Laurent GAUDENS | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.827397+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:33:15+00:00",
        "description": "Dans son talk, Laurent Gaudens raconte comment le regard des autres a façonné son enfance et sa vie d’adulte : le choc des cicatrices, la douleur des soins, les malaises et les moqueries… mais aussi la douceur des rencontres et la force de l’amour.\nÀ travers son parcours, il partage un chemin intime vers l’acceptation de soi, la confiance et la réconciliation avec son image, montrant comment il a appris à transformer chaque regard en un moteur de résilience et de puissance personnelle.\n\n Victime d’un grave accident durant son enfance, il est brûlé sur tout le corps à plus de 60%. Fort de 25 ans d’expérience dans la relation client — en tant que salarié, consultant, commercial et entrepreneur —, il se consacre depuis dix ans à trois projets engagés : fondateur de Dulcenae, première maison de beauté inclusive, président de l’association Burns and Smiles, qui accompagne les personnes brûlées, et producteur du spectacle militant \"Ma différence t’emmerde !\".\nSon objectif ? Redonner confian",
        "id": 4507612,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=afhM8SG5JVM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/afhM8SG5JVM/hqdefault.jpg",
        "title": "Transformer le monde, regard après regard | Laurent GAUDENS | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T16:43:55.934446+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:33:03+00:00",
        "description": "In this talk, economist and policy researcher Farhad Nili discusses the rise of generative artificial intelligence and its growing role in reshaping the global landscape. He explores how this technology creates a rare opportunity for countries and communities to narrow long-standing gaps with the world, not by scale or resources, but through access, learning, and adaptation. This talk looks at AI as a moment where light can enter opening new paths toward connection and possibility. Economist This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4507613,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=JRgW0rnZ7q4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JRgW0rnZ7q4/hqdefault.jpg",
        "title": "A rare chance to close the gap | Farhad Nili | TEDxSUT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:48.385186+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:32:28+00:00",
        "description": "ครูตี๋-นิวัฒน์ ร้อยแก้ว ผู้ก่อตั้ง “กลุ่มรักษ์เชียงของ” และ “โฮงเฮียนแม่น้ำของ” ที่มีเป้าหมายเพื่อปกป้องแม่น้ำและสร้างความเข้าใจเรื่องสิทธิในการจัดการทรัพยากรธรรมชาติแก่ชุมชน ครูตี๋เคยคว้ารางวัล Goldman Environmental Prize ประจำปี 2565 แม้ต้องเผชิญกับอุปสรรคนานหลายทศวรรษ แต่ครูตี๋ยังมีฝันที่จะมุ่งมั่นทำให้สำเร็จ บนเวที TEDxChiangRai เขาหว่านเมล็ดพันธุ์แห่งแรงบันดาลใจลงในหัวใจ  สมกับคำว่า “ครู” ที่คนมักเรียกเขาเสมอมา\n\nKru Tee – Niwat Roikaew, founder of the “Rak Chiang Khong Conservation Group” and “Mekong School,” is dedicated to protecting rivers and empowering communities with knowledge about their rights to manage natural resources. Kru Tee won the 2022 Goldman Environmental Prize, and despite facing decades of challenges, he continues to pursue his dreams with unwavering determination.\nOn the TEDxChiangRai stage, he planted seeds of inspiration in the hearts of the audience, truly living up to the title “Kru” (Teacher) that people have long called him. Niwat Roykaew, widely known ",
        "id": 4506898,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1W9lzHtZ_VA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1W9lzHtZ_VA/hqdefault.jpg",
        "title": "จากครูโรงเรียนบ้านนอกสู่ครูนักปกป้องสิทธิ | Dear to dream | Niwat Roykaew | TEDxChiang Rai",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:48.767547+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:32:16+00:00",
        "description": "This is about finding your place in nature when it seems like it is not the right fit for you. A path towards growth and activism. Senior at the University of Vermont, Sustainability, Ecology, and Policy Major This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506899,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=64vZeOJ7QNw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/64vZeOJ7QNw/hqdefault.jpg",
        "title": "Finding the \"Me\" In Nature | Andrea Falar | TEDxUVM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:49.049550+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:32:15+00:00",
        "description": "NOTE FROM TED: We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nGreat ideas do not always start in labs, sometimes they start with a problem no one else thought to solve. Annabel Hay tells the story of turning a simple fashion fix into Clutch Glue, showing how creativity, resilience, and persistence can transform setbacks into breakthrough success. Forbes 30U30 alumni Annabel Hay is the Founder and CEO of CLUTCH Glue, a globally patented, world-first clothing adhesive that’s been hailed as a \"game changer\" in fashion. Within 18 months of business CLUTCH was valued at $10M, stocked in 20,000+ stores worldwide, with rapid international expansion still underway. Annabel Hay has not only introduced a revolutionary product but is leading a movement t",
        "id": 4506900,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ARREGrPt-GI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ARREGrPt-GI/hqdefault.jpg",
        "title": "How I Turned Glue Into Gold | Annabel Hay | TEDxUniversity of Sydney",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:49.411117+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:57+00:00",
        "description": "This talk explores how communication is changing - and how brainwave\ninterfaces may soon let us control technology, and even digital versions of\nourselves, with the power of thought. Natia Kukhilava is the Co-Founder and CTO of Helio AI, an international startup backed by 500 Eurasia, with $1M raised and a fast-growing customer base across six countries. She leads the engineering strategy and designed the world’s first Recruiting AI Agent, transforming how companies hire and automating tasks for thousands of recruiters. She is a Forbes Under 30 honoree in Tech and E-Commerce (2024) and a frequent speaker at global events, including ICML 2025 in Singapore and Data Science Summit Poland 2025. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506901,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gr4s_BMF60c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gr4s_BMF60c/hqdefault.jpg",
        "title": "From Pictograms to Brainwaves | Natia Kukhilava | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:49.765058+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:53+00:00",
        "description": "“Lost in the Choice” examines the pressure students face to choose a career too\nearly and argues that confusion is a natural part of finding one’s path. Timur Gagetashvili is a 16-year-old student and boxer whose life is shaped by a wide range of interests and pursuits. Timur is passionate about studying History. He has always been deeply fascinated by this subject. Studying history comes naturally to him and allows him to explore the rich and intriguing past of our world. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506902,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=-nIpFOs8mKE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-nIpFOs8mKE/hqdefault.jpg",
        "title": "Lost in the Choice | Timur Gagetashvili | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:50.069720+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:47+00:00",
        "description": "Through his talk, the speaker invites the audience to rethink success as fulfillment, balance, and inner peace, before it’s too late. Mohamad Tahmasbi is a high school student passionate about redefining the meaning of success. He believes that true success comes from happiness, mental well-being, and personal growth, rather than solely from material achievements. Mohamad is caring and thoughtful, always striving to help others and deepen his own self-understanding. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506903,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=aYzG4oWf_Ac",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aYzG4oWf_Ac/hqdefault.jpg",
        "title": "Redefining Success   | Mohamad Tahmasbi | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:50.215097+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:39+00:00",
        "description": "Through her talk, the speaker hopes to inspire others to look beyond\nappearances and rediscover what truly makes people stand out. Marika Janashvili is a curious and creative student with a passion for exploring ideas that challenge the way we see ourselves and the world. Known for her thoughtful perspective and love of storytelling, she seeks to spark meaningful conversations about confidence, identity, and contemporary culture. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506904,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pyN1SaJ-ub0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pyN1SaJ-ub0/hqdefault.jpg",
        "title": "The Currency of Appearance  | Marika Janashvili | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:50.360739+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:29+00:00",
        "description": "The talk introduces the idea that real life changes often start with small, almost\ninvisible actions rather than dramatic turning points, shows how everyday habits\nslowly shape who a person becomes. Merab Dzuliashvili is a disciplined and forward-thinking student from Georgia who balances academic ambition with a passion for sports and personal growth. A competitive athlete and curious learner, he approaches life with intensity and clarity, studying self-improvement not just in theory but through daily practice. Merab sets long-term goals, breaks them into actionable steps, and pursues them consistently—whether training, learning, or creating. Driven, introspective, and curious, he embodies the new generation of young thinkers, striving to grow himself and inspire others through action. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506905,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ogWwQnANyIE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ogWwQnANyIE/hqdefault.jpg",
        "title": "Power of Small Actions | Merab Dzuliashvili | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:50.491810+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:25+00:00",
        "description": "The talk Something Borrowed explores the effects of uncontrolled influx of \nloanwords on the language and society. Constantino Giaquinto is a high school senior at the European School in Tbilisi, Georgia. A son of a Georgian mother and an American father, he grew up bilingual, spending most of his childhood in the U.S. and moving to Georgia during high school. Constantino is passionate about language and society, democracy, and building connections across communities. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506906,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TD2bTMMpC6w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TD2bTMMpC6w/hqdefault.jpg",
        "title": "Something Borrowed  | Constantino Giaquinto | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:50.660608+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:17+00:00",
        "description": "In her talk, “We Become Who We Meet” Ekaterine Korchilava shares how the\npeople we meet shape the person we become. Ekaterine Korchilava is a 16-year-old 11th-grade student in the Georgian Program at the European School. She has a deep passion for anatomy and plans to pursue a career in medicine. Outside of academics, Ekaterine enjoys cooking, playing the piano, and tennis. Her friends describe her as kind, positive, and an attentive listener. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506907,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=r7YXd_o575Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/r7YXd_o575Y/hqdefault.jpg",
        "title": "We Become Who We Meet  | Ekaterine Korchilava | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:50.856537+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:13+00:00",
        "description": "Through her talk, Tekla hopes to inspire others to reconnect with their inner artist\nand rediscover the creativity we are all born with. Tekla Sokhadze is a 16-year-old student at the European School in Tbilisi, Georgia. Passionate about both science and creativity, Tekla finds inspiration at the intersection of biology and art. She has been drawing since childhood and continues to use art as a way to express curiosity and emotion. Her love for creativity extends beyond the canvas—she believes imagination plays a vital role in understanding the world and solving problems. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506908,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gdmlUKotfo8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gdmlUKotfo8/hqdefault.jpg",
        "title": "Rediscover the Artist You Still Are | Tekla Sokhadze | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:51.023853+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:31:05+00:00",
        "description": "In this inspiring talk, Nino Chichinadze explores how the pursuit of perfection\noften prevents us from making real progress. Nino Chichinadze is a passionate and curious student from Georgia with a strong interest in creativity, science, and personal growth. She enjoys exploring how mindset influences learning and success, and she believes in the power of progress over perfection. Nino loves sharing ideas that inspire others to take small, courageous steps toward their goals and to find meaning in everyday experiences. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4506909,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xFVsgrawSRY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xFVsgrawSRY/hqdefault.jpg",
        "title": "Perfection Is the Enemy of Progress  | Nino Chichinadze | TEDxIBEuropeanSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:51.310691+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:30:50+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker’s personal views and experiences in the military. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nThe speaker addresses the invisible \"bubbles\" that influence our thinking—from digital algorithms to social and professional circles. Drawing on philosophy, military experiences, and real-world events, the talk highlights how comfort zones can restrict our understanding in an increasingly volatile world. \n\nThe central message encourages young people to challenge assumptions, embrace uncertainty, and grow by deliberately stepping outside these self-imposed boundaries. A second-generation Army officer and alumnus of The Doon School, Major General Singh brings with him a legacy of leadership and ded",
        "id": 4506910,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LNFPOvsqehs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LNFPOvsqehs/hqdefault.jpg",
        "title": "Burst the bubble for personal growth | Maj Gen Jagatbir Singh | TEDxBMU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:51.776144+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:30:43+00:00",
        "description": "Artist and storyteller Beth Bobbitt knows the power of creativity to heal. In this honest and hopeful talk, she explores how to reconnect with art as a source of vitality and what happens when our passion becomes our pressure. Blending science, reflection, and her own artistic journey, Beth shares tools for pausing, checking in, and creating with intention in a world that glorifies hustle and productivity. This talk is a reminder that the art we make can sustain us — if we let it. Beth Bobbitt — Artist & Well-Being Advocate\n Beth Bobbitt is an artist based in Bella Vista, AR, who uses encaustics to explore natural and built environments. After two decades in PR and communications—and roles at Crystal Bridges Museum of American Art and Alice L. Walton School of Medicine—Beth returned to her roots, centering art around themes of nature, well-being, and language.\nHer paintings are held in private and corporate collections nationwide, including Square, Homegrown Restaurant, and Washington",
        "id": 4506911,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=n7I9dxTx39E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/n7I9dxTx39E/hqdefault.jpg",
        "title": "The art of staying well | Beth Bobbitt | TEDxBentonville",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:36:52.119839+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:30:18+00:00",
        "description": "Театр режиссері, Астана қаласындағы Музыкалық жас көрермен театрының директоры Асхат Маемиров TEDxAstana сахнасында өнердің қоғамдағы орны мен мұраның маңызы туралы ой қозғады.\nСпикердің айтуынша, театр – халықтың тірі жады. Театр тарихты қайта тірілтіп қана қоймай, оны бүгінгі ұрпақтың тілімен сөйлетеді. Бұған мысал ретінде режиссер «Қыз Жібек» жырын мысалға келтіріп, оның ғасырлар бойы түрлі формада жаңарып әрі жаңғырып отырғанын атап өтті.\n«Жаңашылдық — ескіні жоққа шығару емес, керісінше, оны жаңаша сөйлету», — дейді спикер. \nОл көрерменді жай ғана бақылаушы емес, сахнадағы тарихқа үлес қоса алатын тұлға ретінде сезінуге шақырды. Режиссердің айтуынша, тарихқа жаңа тараулар қосып, болашаққа толыққанды картина қалдыру – бүгінгі ұрпақтың басты миссиясы.\nАсхат Маемировтың баяндамасынан кейін Музыкалық жас көрермен театры TEDxAstana қауымдастығына қазақ руханиятының інжу-маржаны саналатын «Қыз Жібек» музыкалық драмасынан үзінді ұсынды. Жазушы-драматург Ғ. Мүсіреповтің либреттосы мен ко",
        "id": 4506912,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7ENnY4PykEU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7ENnY4PykEU/hqdefault.jpg",
        "title": "Мұра мен жаңашылдық – өнердің қос қанаты | Асхат Маемиров | TEDxAstana",
        "vote": 0
    }
]