[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T23:53:28.381137+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T23:30:00+00:00",
        "description": "Paris Judicial Court ordered Google to block additional pirate sports-streaming domains at the DNS level, rejecting Google's argument that enforcement should target upstream providers like Cloudflare first. \"The blockade was requested by Canal+ and aims to stop pirate streams of Champions League games,\" notes TorrentFreak. From the report: Most recently, Google was compelled to take action following a complaint from French broadcaster Canal+ and its subsidiaries regarding Champions League piracy.. Like previous blocking cases, the request is grounded in Article L. 333-10 of the French Sports Code, which enables rightsholders to seek court orders against any entity that can help to stop 'serious and repeated' sports piracy. After reviewing the evidence and hearing arguments from both sides, the Paris Court granted the blocking request, ordering Google to block nineteen domain names, including antenashop.site, daddylive3.com, livetv860.me, streamysport.org and vavoo.to.\n \nThe latest blo",
        "id": 4511365,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/08/224243/french-court-orders-google-dns-to-block-pirate-sites-dismisses-cloudflare-first-defense",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "French Court Orders Google DNS to Block Pirate Sites, Dismisses 'Cloudflare-First' Defense",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T23:53:28.588221+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T22:50:00+00:00",
        "description": "Microsoft is embedding full e-commerce checkout directly into Copilot chats, letting users buy products without ever visiting a retailer's website. \"If checkout happens inside AI conversations, retailers risk losing direct customer relationships -- while platforms like Microsoft gain leverage,\" reports Axios. From the report: Microsoft unveiled new agentic AI tools for retailers at the NRF 2026 retail conference, including Copilot Checkout, which lets shoppers complete purchases inside Copilot without being redirected to a retailer's website. The checkout feature is live in the U.S. with Shopify, PayPal, Stripe and Etsy integrations.\n \nCopilot apps have more than 100 million monthly active users, spanning consumer and commercial audiences, according to the company. More than 800 million monthly active users interact with AI features across Microsoft products more broadly. Shopping journeys involving Copilot are 33% shorter than traditional search paths and see a 53% increase in purcha",
        "id": 4511366,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/08/2156225/microsoft-turns-copilot-chats-into-a-checkout-lane",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Turns Copilot Chats Into a Checkout Lane",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T22:45:19.250373+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The Federal Communications Commission plans to authorize a new category of wireless devices in the 6 GHz Wi-Fi band that will be permitted to operate at higher power levels than currently allowed. The FCC will also consider authorizing higher power levels for certain wireless devices that are only allowed to operate indoors. The FCC said it scheduled a vote for its January 29 meeting on an order \"to create a new category of unlicensed devices... that can operate outdoors and at higher power than previously authorized devices.\" These so-called Geofenced variable power (GVP) devices operating on the 6 GHz band will \"support high data rates suitable for AR/VR, short-range hotspots, automation, and indoor navigation,\" and \"overcome limitations of previous device classes by allowing higher power and outdoor mobility,\" the FCC said. They will be required to work with geofencing systems to avoid interference with fixed microwave links an",
        "id": 4510855,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/26/01/08/2151202/wi-fi-advocates-get-win-from-fcc-with-vote-to-allow-higher-power-devices",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wi-Fi Advocates Get Win From FCC With Vote To Allow Higher-Power Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T21:38:56.231111+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T21:30:00+00:00",
        "description": "The long-standing hierarchy in the TV market -- Sony, Samsung and LG at the top, TCL and Hisense fighting it out in the midrange -- is eroding as the budget brands close the performance gap and increasingly lead on technology innovation, The Verge writes. Hisense debuted the first RGB LED TV last year, and TCL's X11L announced at CES 2026 is the first TV to use reformulated quantum dots and a new color filter. TCL's QM9K release last year was \"a pretty clear statement that they're ready to fight with the big boys.\" \n\nThe premium brands retain certain advantages: Sony's processing remains unmatched and LG's OLEDs deliver contrast that mini LED cannot match. \"Even as the gap in performance across technologies continues to shrink, and TVs from all the manufacturers get closer to parity, the challenge for TCL and Hisense shifts from creating incredible, competitive products to altering perception,\" The Verge notes. \n\nSamsung once owned the art TV segment entirely; CES 2026 saw announcemen",
        "id": 4510383,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/08/1925221/the-gap-between-premium-and-budget-tv-brands-is-quickly-closing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Gap Between Premium and Budget TV Brands is Quickly Closing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T21:38:56.547413+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T20:44:00+00:00",
        "description": "An anonymous reader shares a report: Internet access available through mobile devices in Iran appears to be limited, according to several social media accounts that routinely track such developments. Cloudflare Radar, which monitors internet traffic on behalf of the internet infrastructure firm Cloudflare, said on Thursday that IPv6 (Internet Protocol version 6), a standard widely used for mobile infrastructure, was affected. \n\n\"IPv6 address space in Iran dropped by 98.5 per cent, concurrent with IPv6 traffic share dropping from 12 per cent to 1.8 per cent, as the government selectively blocks internet access amid protests,\" read Cloudflare Radar's social post. NetBlocks, which tracks internet access and digital rights around the world, also confirmed it was seeing problems with connectivity through various internet providers in Iran. \"Live network data show Tehran and other parts of Iran are now entering a digital blackout,\" NetBlocks posted on X.<p><div class=\"share_submission\" styl",
        "id": 4510384,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/08/1929218/iran-in-digital-blackout-as-tehran-throttles-mobile-internet-access",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Iran in 'Digital Blackout' as Tehran Throttles Mobile Internet Access",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T20:27:20.577458+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T20:01:00+00:00",
        "description": "The promise of AI-powered workplace tools that sort emails, take meeting notes, and file expense reports is finally delivering meaningful productivity gains -- one software startup reported a 20% boost around mid-2025 -- but companies are discovering an unexpected tradeoff: employees are burning out from the relentless pace of high-level cognitive work. \n\nRoger Kirkness, CEO of 14-person software startup Convictional, noticed that after AI took the scut work off his team's plates, their days became consumed by intensive thinking, and they were mentally exhausted and unproductive by Friday. The company transitioned to a four-day workweek; the same amount of work gets done, Kirkness says. \n\nThe underlying problem, according to Boston College economist and sociologist Juliet Schor, is that businesses tend to simply reallocate the time AI saves. Workers who once mentally downshifted for tasks like data entry are now expected to maintain intense focus through longer stretches of data analy",
        "id": 4509805,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/08/1918257/the-downside-to-using-ai-for-all-those-boring-tasks-at-work",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'The Downside To Using AI for All Those Boring Tasks at Work'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T20:27:20.752662+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T19:24:00+00:00",
        "description": "TV manufacturers at CES 2026 in Las Vegas this week unveiled a wave of AI features that frequently consume significant screen space and take considerable time to deliver results -- all while global TV shipments declined 0.6% year over year in Q3, according to Omdia. Google demonstrated Veo generating video from a photo on a television, a process that took about two minutes to produce eight seconds of footage, The Verge writes in a column. Samsung presented a future where viewers ask their sets for sports predictions and recipes to share with kitchen displays. Hisense showed an AI agent that displays real-time stats for every soccer player on screen, a feature requiring so much space the company built a prototype 21:9 aspect ratio display to accommodate it. \n\nDemos repeatedly showed video shrinking to make room for sports scores and information when viewers asked questions -- noticeable on 70-inch displays and likely worse on anything 50 inches or smaller. Amazon's Alexa Plus can jump ",
        "id": 4509806,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/08/1912203/tv-makers-are-taking-ai-too-far",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "TV Makers Are Taking AI Too Far",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T19:17:42.970360+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T18:45:00+00:00",
        "description": "An anonymous reader shares a report: Prior to World War II the vast majority of telescopes built around the world were funded by wealthy people with an interest in the heavens above. \n\nHowever, after the war, two significant developments in the mid-20th century caused the burden of funding large astronomical instruments to largely shift to the government and academic institutions. First, as mirrors became larger and larger to see deeper into the universe, their costs grew exponentially. And then, with the advent of spaceflight, the expense of space-based telescopes expanded even further. \n\nBut now the tide may be turning again. \n\nOn Wednesday evening, former Google CEO Eric Schmidt and his wife, Wendy, announced a major investment in not just one telescope project, but four. Each of these new telescopes brings a novel capability online; however, the most intriguing new instrument is a space-based telescope named Lazuli. This spacecraft, if successfully launched and deployed, would off",
        "id": 4509136,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/08/1832238/former-google-ceo-plans-to-singlehandedly-fund-a-hubble-telescope-replacement",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Former Google CEO Plans To Singlehandedly Fund a Hubble Telescope Replacement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T18:10:19.094348+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T18:05:00+00:00",
        "description": "Adam Wathan, the creator of the popular CSS framework Tailwind CSS, has let go of 75% of his engineering team -- reducing it from four people to one -- because AI-generated search answers have decimated traffic to the project's documentation pages. \n\nTraffic to Tailwind's documentation has fallen roughly 40% since early 2023 despite the framework being more popular than ever, Wathan wrote in a post. The documentation is the primary channel through which developers discover Tailwind's commercial products, and without that traffic the business has struggled to sustain itself; revenue has dropped close to 80%. \n\nThe reduced team also means Wathan cannot currently prioritize implementing LLMS.txt, a proposed feature that would make documentation more accessible to large language models. \"Tailwind is growing faster than it ever has and is bigger than it ever has been, and our revenue is down close to 80%,\" he wrote in the forum post.<p><div class=\"share_submission\" style=\"position:relative",
        "id": 4508480,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/08/1756211/tailwind-css-lets-go-75-of-engineers-after-40-traffic-drop-from-google",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tailwind CSS Lets Go 75% Of Engineers After 40% Traffic Drop From Google",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T18:10:19.322238+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T17:30:00+00:00",
        "description": "Texas Attorney General Ken Paxton has secured a temporary restraining order against Samsung, blocking the company from continuing to collect data through its smart TVs' Automated Content Recognition technology. \n\nThe ACR system captured screenshots of what users were watching every 500 milliseconds, according to the state's lawsuit, and did so without consumer knowledge or consent. The District Court found good cause to believe Samsung's actions violated the Texas Deceptive Trade Practices Act. The TRO prohibits Samsung and any parties working in concert with the company from using, selling, transferring, collecting, or sharing ACR data tied to Texas consumers. \n\nSamsung is one of five major TV manufacturers the Texas Attorney General's office has sued over ACR deployment. Paxton previously secured a similar order against Hisense.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung+Hit+with+Restraining+Order+Over",
        "id": 4508481,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/08/1729204/samsung-hit-with-restraining-order-over-smart-tv-surveillance-tech-in-texas",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung Hit with Restraining Order Over Smart TV Surveillance Tech in Texas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:00:32.705227+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:45:00+00:00",
        "description": "Germany's Harz mountains, once known for their verdant spruce forests, have become a graveyard of skeletal trunks after a bark beetle outbreak ravaged the region starting in 2018 -- an infestation made possible by successive droughts and heatwaves that fatally weakened the trees. Between 2018 and 2021, Germany lost half a million hectares of forest, nearly 5% of the country's total. \n\nSince 2010, EU land carbon absorption has declined by a third, and Germany is now almost certain to miss its carbon sequestration targets, according to Prof Matthias Dieter, head of the Thunen Institute of Forestry. \"You cannot force the forest to grow -- we cannot command how much their contribution should be towards our climate targets,\" he said. \n\nForesters in the Harz are responding by abandoning monoculture plantations in favor of mixed-species approaches. Pockets of beech, firs, and sycamore are now being planted around surviving spruce. A 2018 study in Nature found tree diversity was the best prot",
        "id": 4507827,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/08/1627239/germanys-dying-forests-are-losing-their-ability-to-absorb-co2",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Germany's Dying Forests Are Losing Their Ability To Absorb CO2",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T17:00:32.883837+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T16:02:00+00:00",
        "description": "China has hacked the emails used by congressional staff on powerful committees in the US House of Representatives, as part of a massive cyber espionage campaign known as Salt Typhoon. An anonymous reader shares a report: Chinese intelligence accessed email systems used by some staffers [non-paywalled source] on the House China committee in addition to aides on the foreign affairs committee, intelligence committee and armed services committee, according to people familiar with the attack. The intrusions were detected in December. \n\nThe attacks are the latest element of an ongoing cyber campaign against US communication networks by the Ministry of State Security, China's intelligence service. One person familiar with the attack said it was unclear if the MSS had accessed lawmakers' emails. The MSS has been operating Salt Typhoon for several years. It allows China to access the unencrypted phone calls, texts and voicemails of almost every American, and in some cases enables access to ema",
        "id": 4507828,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/08/1559224/china-hacked-email-systems-of-us-congressional-committee-staff",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Hacked Email Systems of US Congressional Committee Staff",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:54:17.328853+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T15:25:00+00:00",
        "description": "A 50-inch TV that would have set you back $1,100 at Best Buy during Black Friday 2001 now costs less than $200, and the price per area-pixel -- a metric accounting for both screen size and resolution -- has dropped by more than 90% over the past 25 years. The story behind this decline is largely one of liquid crystal display technology maturing from a niche product to a mass-manufactured commodity. \n\nLCDs represented just 5% of the TV market in 2004; by 2018, they commanded more than 95%. The largest driver of cost reduction has been the scaling up of \"mother glass\" sheets -- the large panels of extremely clear glass onto which semiconductor materials are deposited before being cut into individual displays. The first generation sheets measured roughly 12 by 16 inches. Today's Generation 10.5 sheets span 116 by 133 inches, nearly 100 times the original area. This scaling delivers substantial savings because equipment costs rise more slowly than glass area increases. \n\nMoving from Gen 4",
        "id": 4507124,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/08/1524256/how-did-tvs-get-so-cheap",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Did TVs Get So Cheap?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T15:54:17.450424+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T14:44:00+00:00",
        "description": "Disney+, which is looking to catch up with some streaming and digital rivals in terms of daily engagement, is adding vertical videos to the service. From a report: The arrival of the new format later this year was one of several advertising-oriented announcements the company made Wednesday at its Tech + Data Showcase at CES in Las Vegas. Other new offerings include a new \"brand impact\" metric and a new video generation tool that helps advertisers create high-quality connected-TV-ready commercials using existing assets and guidelines. \n\n[...] In an interview prior to the Wednesday showcase, Erin Teague, EVP of Product Management for Disney Entertainment and ESPN, said \"everything's on the table\" in terms of how vertical video is delivered on Disney+. It could be original short-form programming, repurposed social clips, refashioned scenes from longer-form episodic or feature titles or a combination. \"We're obviously thinking about integrating vertical video in ways that are native to co",
        "id": 4507125,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/08/1444209/disney-to-add-vertical-videos-in-push-to-boost-daily-engagement",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Disney+ To Add Vertical Videos In Push To Boost Daily Engagement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T14:47:41.353686+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T14:05:00+00:00",
        "description": "LEGO has responded to concerns that its newly announced Smart Brick technology represents a departure from the company's foundation in physical, non-digital play, a day after the official reveal at CES drew criticism from child development advocates. Federico Begher, SVP of Product, New Business, told IGN the sensor-packed bricks are \"an addition, a complementary evolution\" and emphasized that the company would \"still very much nurture and innovate and keep doing our core experience.\" \n\nA BBC News report on the CES announcement noted \"unease\" among \"play experts\" at the unveiling. Josh Golin, executive director of children's wellbeing group Fairplay, said he believed Smart Bricks could \"undermine what was once great about Lego\" and curtail imagination during play. Begher compared the rollout to the Minifigure's gradual introduction decades ago. The Smart Brick launches in March in Star Wars sets including an X-Wing that produces engine sounds based on movement. The technology is scree",
        "id": 4506535,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/08/145236/lego-says-smart-brick-wont-replace-traditional-play-after-ces-backlash",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LEGO Says Smart Brick Won't Replace Traditional Play After CES Backlash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T13:41:23.175948+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: SteamOS's slow march across the Windows-dominated PC gaming landscape is continuing to creep along. At CES this week, Lenovo announced it will launch a version of last year's high-priced, high-powered Legion Go 2 handheld with Valve's gaming-focused, Linux-based OS pre-installed starting in June. And there are some intriguing signs from Valve that SteamOS could come to non-AMD devices in the not-too-distant future as well. [...] Valve has also been working behind the scenes to expand SteamOS's footprint beyond its own hardware. After rolling out the SteamOS Compatible software label last May, SteamOS version 3.7 offered support for manual installation on AMD-powered handhelds like the ROG Ally and the original Legion Go.\n \nEven as SteamOS slowly spreads across the AMD-powered hardware landscape, the OS continues to be limited by a lack of compatibility with the wide world of Arm devices. That could change in the near future, thoug",
        "id": 4505963,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/26/01/08/052240/steamos-continues-its-slow-spread-across-the-pc-gaming-landscape",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SteamOS Continues Its Slow Spread Across the PC Gaming Landscape",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T10:19:30.548614+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T10:00:00+00:00",
        "description": "Astronomers using the Vera C. Rubin Observatory have discovered a record-setting asteroid, known as 2025 MN45, nearly half a mile wide and spinning once every 1.88 minutes -- the fastest known rotation for an object of its size. \"This is now the fastest-spinning asteroid that we know of, larger than 500 meters,\" said Sarah Greenstreet, University of Washington astronomer and lead author of the study. The findings have been published in the The Astrophysical Journal Letters. GeekWire reports: 2025 MN45 is one of more than 2,100 solar system objects that were detected during the observatory's commissioning phase. Over time, the LSST Camera tracked variations in the light reflected by those objects. Greenstreet and her colleagues analyzed those variations to determine the size, distance, composition and rate of rotation for 76 asteroids, all but one of which are in the main asteroid belt between the orbits of Mars and Jupiter. (The other asteroid is a near-Earth object.)\n \nThe team found",
        "id": 4504551,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/08/0453245/rubin-observatory-spots-an-asteroid-that-spins-fast-enough-to-set-a-record",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rubin Observatory Spots an Asteroid That Spins Fast Enough To Set a Record",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T07:09:37.175723+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T07:00:00+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Autoblog: ... the problem is that the federal brightness standards for automotive headlights have not changed for decades. The Federal Motor Vehicle Safety Standard No. 108 hasn't had significant updates since 1986, with an addition allowing Adaptive Driving Beam (ADB) headlights coming only in 2022. The NHTSA last investigated (PDF) the issue of headlamp glare in 2003. The current standards include huge loopholes for auto manufacturers to emit as much light as desired, as long as the manufacturer meets the requirements of the other parts of the regulation.\n \nLEDs can be made to focus light using lasers, and auto manufacturers use this ability to their advantage. The regulatory standard prohibits excessive light in certain areas by referencing old technologies, but manufacturers design the areas in question to be shaded so that the total light output can still be increased greatly overall. Manufacturers want as much light as possib",
        "id": 4503674,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/07/2339221/how-bright-headlights-escaped-regulation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Bright Headlights Escaped Regulation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T03:55:21.045686+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: Japan's nuclear watchdog said Wednesday it is scrapping the safety screening for two reactors at the Hamaoka nuclear power plant in central Japan, after its operator was found to have fabricated data about earthquake risks. It was a setback to Japan's attempts to accelerate nuclear reactor restarts. Less than a quarter of commercial nuclear reactors are operational in the wake of the 2011 Fukushima Daiichi meltdowns, but rising energy costs and pressure to reduce carbon emissions have pushed the government to prioritize nuclear power.\n \nChubu Electric Power Co. had applied for safety screening to resume operations at the No. 3 and 4 reactors at the Hamaoka plant in 2014 and 2015. Two other reactors at the plant are being decommissioned, and a fifth is idle. The plant, about 200 kilometers (125 miles) west of Tokyo, is located on a coastal area known for potential risks from so-called Nankai Trough megaquakes. The Nuclear R",
        "id": 4502866,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/07/2257232/japans-nuclear-watchdog-halts-plants-reactor-safety-screening-over-falsified-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan's Nuclear Watchdog Halts Plant's Reactor Safety Screening Over Falsified Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T01:44:43.497800+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T01:25:00+00:00",
        "description": "Samsung Electronics and SK hynix are projected to raise server memory prices by up to 70% in early 2026, according to Korea Economic Daily. \"Combined with 50 percent increases in 2025, this could nearly double prices by mid-2026,\" reports the Register. From the report: The two Korean giants, alongside US-based Micron, dominate global memory production. All three are reallocating advanced manufacturing capacity to high-margin server DRAM and HBM chips for AI infrastructure, squeezing supply for PCs and smartphones. Financial analysts have raised their earnings forecasts for the firms in response, as they look to benefit from the AI infrastructure boom that is driving up prices for everyone else. Taiwan-based market watcher TrendForce reports that conventional DRAM prices already jumped 55-60 percent in a single quarter.\n \nYet despite the focus on server chips, supply of these components continues to be strained too, with supplier inventories falling and shipment growth reliant on wafer",
        "id": 4502322,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/07/2250243/ai-chip-frenzy-to-wallop-dram-prices-with-70-hike",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Chip Frenzy To Wallop DRAM Prices With 70% Hike",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T01:44:43.633011+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T00:45:00+00:00",
        "description": "Google and Character.AI have agreed to settle multiple lawsuits from families alleging the chatbot encouraged self-harm and suicide among teens. \"The settlements would mark the first resolutions in the wave of lawsuits against tech companies whose AI chatbots encouraged teens to hurt or kill themselves,\" notes Axios. From the report: Families allege that Character.AI's chatbot encouraged their children to cut their arms, suggested murdering their parents, wrote sexually explicit messages and did not discourage suicide, per lawsuits and congressional testimony. \"Parties have agreed to a mediated settlement in principle to resolve all claims between them in the above-referenced matter,\" one document filed in U.S. District Court for the Middle District of Florida reads.\n \nThe documents do not contain any specific monetary amounts for the settlements. Pricy settlements could deter companies from continuing to offer chatbot products to kids. But without new laws on the books, don't expect ",
        "id": 4502323,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/07/2211252/google-and-characterai-agree-to-settle-lawsuits-over-teen-suicides",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google and Character.AI Agree To Settle Lawsuits Over Teen Suicides",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-08T00:34:19.073796+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-08T00:02:00+00:00",
        "description": "OpenAI has unveiled ChatGPT Health, a sandboxed health-focused mode that lets users connect medical records and wellness apps for more personalized guidance. The company makes sure to note that ChatGPT Health is \"not intended for diagnosis or treatment.\" The Verge reports: The company is encouraging users to connect their personal medical records and wellness apps, such as Apple Health, Peloton, MyFitnessPal,Weight Watchers, and Function, \"to get more personalized, grounded responses to their questions.\" It suggests connecting medical records so that ChatGPT can analyze lab results, visit summaries, and clinical history; MyFitnessPal and Weight Watchers for food guidance; Apple Health for health and fitness data, including movement, sleep, and activity patterns\"; and Function for insights into lab tests.\n \nOn the medical records front, OpenAI says it's partnered with b.well, which will provide back-end integration for users to upload their medical records, since the company works with",
        "id": 4501912,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/07/2151205/openai-launches-chatgpt-health-encouraging-users-to-connect-their-medical-records",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Launches ChatGPT Health, Encouraging Users To Connect Their Medical Records",
        "vote": 0
    }
]