[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T23:56:49.007410+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T23:20:00+00:00",
        "description": "Both GNOME and Firefox are considering disabling middle-click paste by default, arguing it's a confusing, accident-prone X11 relic that dumps clipboard contents without warning. Phoronix reports: A merge request for GNOME's gsettings-desktop-schemas was opened this weekend to disable the primary-paste functionality by default that allows using the middle mouse button for pasting. Jordan Petridis argued in that GNOME pull request that middle-click paste is an \"X11'ism\" and that the setting could remain for those wanting to opt-in to enabling the functionality [...].\n \nThe gsettings set org.gnome.desktop.interface gtk-enable-primary-paste true command would be a way of restoring the primary paste (middle click paste) for those desiring the functionality. The decision over the default has been tasked to GNOME's design team for consideration.\n \nSeparately, Mozilla is also considering disabling middle mouse button paste by default too. [...] Another option being considered is having the op",
        "id": 4482235,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/05/2059225/gnome-and-firefox-consider-disabling-middle-click-paste-by-default",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GNOME and Firefox Consider Disabling Middle Click Paste By Default",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T23:56:49.159173+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T22:40:00+00:00",
        "description": "A viral Reddit \"whistleblower\" post accusing a major food delivery app of systemic exploitation is \"most likely AI-generated,\" reports the Verge. From the report: The original post by user Trowaway_whistleblow alleged that an unnamed food delivery company regularly delays customer orders, calls couriers \"human assets,\" and exploits their \"desperation\" for cash, among other indefensible actions. Nearly 90,000 upvotes and four days later, it's become increasingly clear that the post's text is probably AI-generated. Considering the delivery app industry track record of exploitation of its drivers, it's easy to see why so many people believed this was the real thing.\n \nThe Verge put the original 586-word Reddit post through several free online AI detectors, in addition to Gemini, ChatGPT, and Claude. The results were mixed: Copyleaks, GPTZero, Pangram, Gemini, and Claude all pegged it as likely AI-generated, but ZeroGPT and QuillBot both reported it as human-written. ChatGPT played it dow",
        "id": 4482236,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/05/2050220/viral-reddit-post-about-food-delivery-apps-was-an-ai-scam",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Viral Reddit Post About Food Delivery Apps Was an AI Scam",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T22:43:56.449918+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T22:02:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Amazon's AI-powered overhaul of its digital assistant, now known as Alexa+, is coming to the web. On Monday, at the start of the Consumer Electronics Show in Las Vegas, the company announced the official launch of a new website, Alexa.com, which is now rolling out to all Alexa+ Early Access customers. The site will allow customers to use Alexa+ online, much as you can do today with other AI chatbots such as ChatGPT or Google's Gemini.\n \n[...] Related to this expansion, Amazon is updating its Alexa mobile app, which will now offer a more \"agent-forward\" experience. Or, in other words, it's putting a chatbot-style interface on the app's homepage, making it seem more like a typical AI chatbot. (While you could chat with Alexa before in the app, the focus is now on the chatting -- while the other features take a back seat.) On the Alexa.com website, customers can use Alexa+ for common tasks -- for instance, exploring complex topics, cre",
        "id": 4481699,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/05/2041210/amazons-ai-assistant-comes-to-the-web-with-alexacom",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's AI Assistant Comes To the Web With Alexa.com",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T22:43:56.752237+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T21:26:00+00:00",
        "description": "SanDisk is retiring the WD Blue and WD Black SSD brands and replacing them with a new \"Optimus\" line that carries the same model numbers as its predecessors. The move follows Western Digital's late-2023 decision to split into two companies -- one retaining the WD name for hard drives sold to NAS and data center customers, the other reviving SanDisk for solid-state storage. That separation effectively unwound WD's $19 billion acquisition of SanDisk a decade earlier. \n\nUnder the new structure, the entry-level WD Blue SN5100 becomes the SanDisk Optimus 5100, mid-tier WD Black drives shift to Optimus GX, and high-end WD Black SSDs become Optimus GX Pro. The Optimus 5100 uses slower quad-level cell flash, the GX 7100 steps up to triple-level cell memory, and the GX Pro 8100 adds a PCIe 5.0 interface and dedicated DRAM cache. SanDisk offered no timeline for its WD Green and WD Red drives. The rebranding arrives as SSD prices climb on demand from AI data centers -- volatility that prompted M",
        "id": 4481700,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/05/1957206/sandisk-says-goodbye-to-wd-blue-and-black-ssds-hello-to-new-optimus-drives",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SanDisk Says Goodbye To WD Blue and Black SSDs, Hello To New 'Optimus' Drives",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T21:28:29.408995+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T20:48:00+00:00",
        "description": "An anonymous reader shares a report: Popular AI-powered integrated development environment solutions, such as Cursor, Windsurf, Google Antigravity, and Trae, recommend extensions that are non-existent in the OpenVSX registry, allowing threat actors to claim the namespace and upload malicious extensions. \n\nThese AI-assisted IDEs are forked from Microsoft VSCode, but cannot use the extensions in the official store due to licensing restrictions. Instead, they are supported by OpenVSX, an open-source marketplace alternative for VSCode-compatible extensions. As a result of forking, the IDEs inherit the list of officially recommended extensions, hardcoded in the configuration files, which point to Microsoft's Visual Studio Marketplace.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=VSCode+IDE+Forks+Expose+Users+To+'Recommended+Extension'+Attacks%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F26%2F01%2F05%2F1929255%2F%3Futm_so",
        "id": 4481182,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/05/1929255/vscode-ide-forks-expose-users-to-recommended-extension-attacks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "VSCode IDE Forks Expose Users To 'Recommended Extension' Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T21:28:29.609037+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T20:09:00+00:00",
        "description": "Capita, the UK outsourcer that won a $323 million contract to administer the nation's Civil Service Pension Scheme for 1.7 million members, has responded to a disastrous portal launch by asking users to hold off on complaints until its new AI chatbots go live. \n\nThe service launched on December 1 and immediately ran into problems including unrecognized passwords, broken links and placeholder text scattered across unfinished pages. In a December 17 email to members, The Register reports today, managing director Chris Clements said Capita was \"working tirelessly\" and promised \"one of the biggest services in the United Kingdom with AI at its core\" by March. \n\nHe asked users whose enquiries were not urgent to wait until the new year before contacting support again.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK+Government's+New+Pension+Portal+Operator+Tells+Users+To+Wait+for+AI+Before+Complaining%3A+https%3A%2F%2Fit.",
        "id": 4481183,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/05/1924237/uk-governments-new-pension-portal-operator-tells-users-to-wait-for-ai-before-complaining",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Government's New Pension Portal Operator Tells Users To Wait for AI Before Complaining",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T20:06:04.972977+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T19:30:00+00:00",
        "description": "Google is quietly killing Gmail's ability to fetch mail from third-party email accounts using POP3, a long-standing feature that has allowed users to consolidate multiple inboxes into a single Gmail interface. The change takes effect this month and also ends Gmailify, the companion feature that applied Gmail's spam filtering and inbox organization to linked third-party accounts. \n\nGoogle buried the decision in a support note rather than making any formal announcement. The company's suggested workaround -- switching to IMAP -- doesn't work for all affected users. Users can still access third-party accounts through the Gmail mobile app, but the Gmail service itself will no longer retrieve messages from external providers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+To+Kill+Gmail's+POP3+Mail+Fetching%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F26%2F01%2F05%2F1915218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwi",
        "id": 4480562,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/05/1915218/google-to-kill-gmails-pop3-mail-fetching",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google To Kill Gmail's POP3 Mail Fetching",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T20:06:05.321213+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T18:50:00+00:00",
        "description": "Microsoft has started testing a \"significant\" visual overhaul for Edge in its Canary and Dev Channel preview builds, and the redesigned interface borrows heavily from the design language that first appeared in the company's standalone Copilot app rather than the Fluent Design system used across Windows 11, Xbox, and Office. \n\nThe updated look touches context menus, the new tab page and settings areas, introducing rounder corners and the same color palette and typography found in Copilot. The new interface appears regardless of whether users have Copilot Mode enabled, though the new tab page reverts to MSN news articles and Bing search when Copilot Mode is turned off. \n\nEdge is not alone in this shift, Windows Central writes. Microsoft is also applying the Copilot design language to Copilot Discover, an AI-powered version of MSN.com that may be internally codenamed \"Ruby.\" Windows and Xbox have not yet received similar treatment. The rollout remains uneven -- the refreshed UI is not ap",
        "id": 4480563,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/05/1825213/microsoft-is-slowly-turning-edge-into-another-copilot-app",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft is Slowly Turning Edge Into Another Copilot App",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T18:49:31.281615+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T18:10:00+00:00",
        "description": "Scientists at Melbourne's Peter Doherty Institute for Infection and Immunity are working on a Crispr-based treatment -- delivered as a nasal spray or injection -- that could stop influenza infections by targeting the virus's RNA and disrupting its ability to replicate inside human cells. \n\nThe approach uses the Cas13 enzyme, a lesser-known cousin of the DNA-cutting Cas9, which can be engineered to seek out conserved regions of influenza's genetic code that are found in virtually all flu strains and are crucial to the virus's survival. The delivery mechanism would use lipid nanoparticles to ferry two molecular instructions to flu-infected cells in the respiratory tract: an mRNA that tells cells to produce Cas13 and a guide RNA that directs the enzyme to specific parts of the influenza virus's code. \n\nCas13 then cuts the viral RNA and effectively stops the infection at the genetic level, Sharon Lewin, the infectious diseases physician leading the project, told Wired. Early safety testin",
        "id": 4479828,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/05/183201/flu-is-relentless-crispr-might-be-able-to-shut-it-down",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Flu Is Relentless. Crispr Might Be Able to Shut It Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T18:49:31.414699+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T17:30:00+00:00",
        "description": "Public opinion surveys paint a picture of Americans souring dramatically on higher education, as Pew found that the share of adults calling college \"very important\" dropped from 70% in 2013 to just 35% today, and NBC polling shows that 63% now believe a degree is \"not worth the cost,\" up from 40% over the same period. Yet enrollment data tells a different story. \n\nFour-year institutions awarded 2 million bachelor's degrees in 2023, up from 1.6 million in 2010, and the fraction of 25-year-olds holding a bachelor's degree has steadily increased for the past 15 years. The economic case remains strong. The average bachelor's degree holder earns about 70% more than a high-school graduate of similar work experience, and after factoring in financial aid, the cost of attending a public four-year college has fallen by more than 20% since 2015. \n\nEven after accounting for student-debt payments, college graduates net about $8,000 more annually than those without degrees. Part of the disconnect m",
        "id": 4479829,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/05/1730218/the-college-backlash-is-a-mirage",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'The College Backlash is a Mirage'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:29:53.861674+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:41:00+00:00",
        "description": "The O-1B visa, a work permit reserved for individuals deemed to possess \"extraordinary ability\" in the arts, has become the pathway of choice for social media influencers and OnlyFans models seeking to build careers in the United States. Immigration attorneys told the Financial Times that influencers now make up more than half their clientele for O-1B applications, a shift that has accelerated since the Covid-19 pandemic as lawyers and talent managers have adapted the visa's criteria -- originally designed for traditional artists -- to fit the metrics of online fame. \n\nHigh follower counts and substantial earnings can establish commercial success under the visa's requirements, landing a brand promotion contract can qualify as an endorsement of talent, and appearing at a store opening can count as performing in a \"distinguished production.\" The total number of O-1 visas granted annually increased by more than 50% between 2014 and 2024, even as overall non-immigrant visa issuance grew b",
        "id": 4479125,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/05/166232/influencers-and-onlyfans-models-dominate-us-extraordinary-artist-visas",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Influencers and OnlyFans Models Dominate US 'Extraordinary' Artist Visas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T16:11:22.885946+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:01:00+00:00",
        "description": "Samsung is bringing a pair of retro-styled speaker concepts to CES 2026 that combine old-school aesthetics with OLED screens and AI-powered music recommendations, and the company is positioning them as alternatives to conventional Bluetooth speakers that typically depend on a paired smartphone or tablet for content selection. The \"AI OLED Cassette\" features a 1.5-inch round OLED display, while the larger \"AI OLED Turntable\" uses a 13.4-inch round panel, and both allow users to receive music suggestions, browse and select content directly on the device, and set ambient moods using images and video playback.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung's+CES+Concepts+Disguise+AI+Speakers+as+Turntables+and+Cassette+Players%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F26%2F01%2F05%2F1530247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<",
        "id": 4478379,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/05/1530247/samsungs-ces-concepts-disguise-ai-speakers-as-turntables-and-cassette-players",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung's CES Concepts Disguise AI Speakers as Turntables and Cassette Players",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T16:11:22.973977+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:21:00+00:00",
        "description": "A new working paper from researchers at the University of Hong Kong has found that Chinese graduate students who plagiarized more heavily in their master's theses were significantly more likely to pursue careers in the civil service and to climb the ranks faster once inside. \n\nJohn Liu and co-authors analyzed 6 million dissertations from CNKI, a Chinese academic repository, and cross-referenced them against public records of civil-service exam-takers to identify 120,000 civil servants and their academic work. Those who entered the public sector had plagiarism scores 15.6% above average. Customs and tax officials fared worst -- their scores ran 25% and 26% higher than private-sector peers respectively. Within the civil service, those who plagiarized more were promoted 9% faster during the first five years of their careers. The researchers validated their plagiarism metric through an experiment involving 443 job applicants who were asked to roll dice for rewards without monitoring. Thos",
        "id": 4478380,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/05/1452249/people-of-dubious-character-are-more-likely-to-enter-public-service",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "People of Dubious Character Are More Likely To Enter Public Service",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T15:00:27.019856+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T14:40:00+00:00",
        "description": "Stack Overflow's monthly question volume has collapsed about 300 -- levels not seen since the site launched in 2009, according to data from the Stack Overflow Data Explorer that tracks the platform's activity over its sixteen-year history. \n\nQuestions peaked around 2014 at roughly 200,000 per month, then began a gradual decline that accelerated dramatically after ChatGPT's November 2022 launch. By May 2025, monthly questions had fallen to early-2009 levels, and the latest data through early 2026 shows the collapse has only continued -- the line now sits near the bottom of the chart, barely registering. \n\nThe decline predates LLMs. Questions began dropping around 2014 when Stack Overflow improved moderator efficiency and closed questions more aggressively. In mid-2021, Prosus acquired Stack Overflow for $1.8 billion. The founders, Jeff Atwood and Joel Spolsky, exited before the terminal decline became apparent. ChatGPT accelerated what was already underway. The chatbot answers programm",
        "id": 4477668,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/26/01/05/1431212/stack-overflow-went-from-200000-monthly-questions-to-nearly-zero",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Stack Overflow Went From 200,000 Monthly Questions To Nearly Zero",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T15:00:27.157957+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T14:04:00+00:00",
        "description": "Samsung's co-CEO TM Roh has warned that product price increases are \"inevitable\" as an unprecedented global memory chip shortage squeezes margins across the company's consumer electronics lineup -- from smartphones to televisions and home appliances. \n\nThe South Korean giant, one of the top two largest smartphone manufacturers, plans to double the number of mobile devices running its Galaxy AI features to 800 million units this year, up from 400 million at the end of 2025. Galaxy AI is powered by Google's Gemini model and Samsung's own Bixby assistant for different tasks. \"As this situation is unprecedented, no company is immune to its impact,\" Roh told Reuters in his first interview since becoming co-CEO in November. \n\nSamsung is working with partners on longer-term strategies to minimize the impact, he said. Market researchers IDC and Counterpoint predict the global smartphone market will shrink this year as the chip shortage threatens to drive up phone prices. The shortage is a boo",
        "id": 4477669,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/26/01/05/144211/samsung-co-ceo-says-soaring-memory-chip-prices-will-inevitably-impact-smartphone-costs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung Co-CEO Says Soaring Memory Chip Prices Will 'Inevitably' Impact Smartphone Costs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T13:42:19.892186+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T12:34:00+00:00",
        "description": "America's tech companies and data center developers \"are increasingly losing fights in communities where people don't want to live next to them, or even near them,\" reports the Associated Press:\n\n\nCommunities across the United States are reading about &mdash; and learning from &mdash; each other's battles against data center proposals that are fast multiplying in number and size to meet steep demand as developers branch out in search of faster connections to power sources... [A]s more people hear about a data center coming to their community, once-sleepy municipal board meetings in farming towns and growing suburbs now feature crowded rooms of angry residents pressuring local officials to reject the requests... \n\n\nA growing number of proposals are going down in defeat, sounding alarms across the data center constellation of Big Tech firms, real estate developers, electric utilities, labor unions and more. Andy Cvengros, who helps lead the data center practice at commercial real estate",
        "id": 4477111,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/05/0445216/as-us-communities-start-fighting-back-many-datacenters-are-blocked",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "As US Communities Start Fighting Back, Many Datacenters are Blocked",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T09:51:50.083947+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T08:34:00+00:00",
        "description": "2025'S final months finally saw the publication of J.R.R. Tolkein's The Bovadium Fragments, writes the Los Angeles Review of Books:\n\n\nAnyone who has read Tolkien's letters will know that he is at his funniest when filled with rage, and The Bovadium Fragments is a work brimming with Tolkien's fury &mdash; specifically, ire over mankind's obsession with motor vehicles. Tolkien's anger is expressed through a playful satire told from the perspective of a group of future archaeologists who are studying the titular fragments, which tell of a civilization that asphyxiated itself on its own exhaust fumes. Tolkien's fictional fragments use the language of ancient myth, reframing modern issues like traffic congestion and parking with a grandeur that highlights their total absurdity. It is Tolkien at his angriest and funniest, making The Bovadium Fragments a minor treasure in his ever-growing catalog... \n\nAs Tolkien put it in one of his private letters, \"the spirit of 'Isengard,' if not of Mordo",
        "id": 4475591,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/05/0313224/2025-ends-with-release-of-j-r-r-tolkeins-unpublished-story",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "2025 Ends With Release of J. R. R. Tolkein's Unpublished Story",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T06:26:42.811135+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T05:35:00+00:00",
        "description": "Wednesday marked the end of support for the last and final version of HP-UX, writes OSNews. \n\nThey call it \"the end of another vestige of the heyday of the commercial UNIX variants, a reign ended by cheap x86 hardware and the increasing popularisation of Linux.\"\n\n\nI have two HP-UX 11i v1 PA-RISC workstations, one of them being my pride and joy: an HP c8000, the last and fastest PA-RISC workstation HP ever made, back in 2005. It's a behemoth of a machine with two dual-core PA-8900 processors running at 1Ghz, 8 GB of RAM, a FireGL X3 graphics card, and a few other fun upgrades like an internal LTO3 tape drive that I use for keeping a bootable recovery backup of the entire system. It runs HP-UX 11i v1, fully updated and patched as best one can do considering how many patches have either vanished from the web or have never \"leaked\" from HPE (most patches from 2009 onwards are not available anywhere without an expensive enterprise support contract)... \n\nOver the past few years, I've been t",
        "id": 4474776,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/05/0520224/workstation-owner-sadly-marks-the-end-of-life-for-hp-ux",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Workstation Owner Sadly Marks the End-of-Life for HP-UX",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T03:13:37.181880+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T02:34:00+00:00",
        "description": "While California's residents have had the right to demand companies stop collecting/selling their data since 2020, doing so used to require a laborious opting out with each individual company,\" reports TechCrunch.\nBut now Californians can make \"a single request that more than 500 registered data brokers delete their information\" &mdash; using the Delete Requests and Opt-Out Platform (or DROP):\n\nOnce DROP users verify that they are California residents, they can submit a deletion request that will go to all current and future data brokers registered with the state... \n\nBrokers are supposed to start processing requests in August 2026, then they have 90 days to actually process requests and report back. If they don't delete your data, you'll have the option to submit additional information that may help them locate your records. Companies will also be able to keep first-party data that they've collected from users. It's only brokers who seek to buy or sell that data &mdash; which can inc",
        "id": 4474004,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/05/0224249/39-million-californians-can-now-legally-demand-data-brokers-delete-their-personal-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "39 Million Californians Can Now Legally Demand Data Brokers Delete Their Personal Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T01:07:24.063321+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T00:49:00+00:00",
        "description": "North Dakota passed a law last May to promote development of rare earth minerals in the state. But the law's language apparently also includes two fake mineral names, according to the Bismarck Tribune, \"that appear to be inspired by coal company lawyers who worked on the bill.\"\n\n\nThe inclusion of fictional substances is being called an embarrassment by one state official, a possible practical joke by coal industry leaders and mystifying by the lawmakers who worked on the bill, the North Dakota Monitor reported. \n\nThe fake minerals are friezium and stralium, apparent references to Christopher Friez and David Straley, attorneys for North American Coal who were closely involved in drafting the bill and its amendments. Straley said they were not responsible for adding the fake names. \"I assume it was put in to embarrass us, or to make light of it, or have a practical joke,\" Straley said, adding it could have been a clerical error. \n\nAgriculture Commissioner Doug Goehring questioned the tw",
        "id": 4473406,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/05/0027243/north-dakota-law-included-fake-critical-minerals-using-lawyers-last-names",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "North Dakota Law Included Fake Critical Minerals Using Lawyers' Last Names",
        "vote": 0
    }
]