[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T18:29:11.471012+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T18:00:16+00:00",
        "description": "What if the most overlooked part of the human body could change the future of medicine?\nIn this talk, Jiabao Li takes us from a clitoris hidden in scientific neglect to one grown in a lab using stem cells from menstrual blood. She reveals how these cells—discarded monthly—hold the potential to grow sensory organs, regenerate hearts, and offer life-saving care without invasive procedures. Along the way, she blends humor, art, and science to challenge centuries of gender bias in research. From hyenas’ anatomy to OnlyFans-powered biotech activism, she reimagines body politics and power. At its core, this is a call to turn taboo into superpower—and to invest in research that helps women, because it helps everyone. \n\nJiabao Li is an Artist, Assistant Professor at The University of Texas at Austin, Founding Director of Ecocentric Future Lab, Co-founder and Chief Design Officer of Endless Health, and a Harvard graduate. She creates works addressing climate change, interspecies co-creation, h",
        "id": 4479599,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EcA5JDBO58M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EcA5JDBO58M/hqdefault.jpg",
        "title": "The secret power of menstrual blood | Jiabao Li | TEDxUTAustin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T18:29:11.629469+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T17:38:42+00:00",
        "description": "Why does nature create forms that are both perfectly functional and undeniably beautiful? This talk explores what we can learn from natural structures like diatoms, revealing universal patterns of beauty alongside differences shaped by culture, age, and experience. Discover how these insights into aesthetics can inspire sustainable, functional, and visually compelling products and architecture. Dr. Christian Hamm heads the Bionic Lightweight Construction division at the Alfred Wegener Institute (AWI). He studied marine biology, botany, geology/paleontology, and ecology in Tübingen, Miami, and   Bremen. He completed his doctoral work at AWI, the University of Tromsø, and the  Technical   University of Munich. As a postdoctoral   researcher, he studied the\nbiomechanics of diatoms, and founded the Virtual Helmholtz Institute PlanktonTech and the Department of Marine Structures and Nanotechnology at the Institute of Marine Resources GmbH. He is also co-founder of the software company Syne",
        "id": 4479600,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=16x_Hp-CdCY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/16x_Hp-CdCY/hqdefault.jpg",
        "title": "Beauty and Function of Marine Organisms | Christian Hamm-Dubischar | TEDxHochschuleBremerhaven",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:14.536352+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:30:52+00:00",
        "description": "Most people worry about outdoor pollution—but the air inside your home can be 2-5 times more polluted than the air outside. In this eye-opening talk, chemist Dr. Atim Atte Enyenihi reveals the hidden dangers of indoor air pollution to your health, as well as how simple steps like improving ventilation and avoiding synthetic fragrances can make a big difference in helping you breathe easier and safer. Atim Enyenihi is a PhD chemist with nearly two decades of experience in the life sciences, where she worked to develop therapeutics and diagnostic tests, including one now used to screen Utah newborns for a rare disease. She now serves as Salt Lake City’s Strategic Industry Advisor for Technology and Innovation. A sharp, vinegar-like odor in the home after a new kitchen island installation led her to identify formaldehyde off-gassing and deepen her focus on indoor air quality as a public health concern. This talk was given at a TEDx event using the TED conference format but independently ",
        "id": 4478828,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=g9uOL-2YjmY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/g9uOL-2YjmY/hqdefault.jpg",
        "title": "The Hidden Air Pollution Inside Your Home | Dr. Atim Atte Enyenihi | TEDxSaltLakeCity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:14.752407+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:01:46+00:00",
        "description": "Emprender comienza con una idea clara y una estructura básica bien definida. La importancia de identificar una necesidad, proponer una solución viable y organizar aspectos clave como el nombre, el propósito y el público objetivo es fundamental en tu actitud emprendedora, la toma de decisiones y la disposición para aprender en el camino. CEO y cofundador de Grupo 500 Educación S.A.S, una de las compañías líderes en formación preuniversitaria de Colombia y Estudiante de Medicina. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478829,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XuqCoH_nNTo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XuqCoH_nNTo/hqdefault.jpg",
        "title": "¿Cómo crear una empresa en 15 minutos?  | Sebastián Flórez | TEDxUIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:14.852748+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:01:21+00:00",
        "description": "La disciplina permite enfrentar dificultades, mantener el enfoque y construir hábitos que conducen al crecimiento continuo. La disciplina, aplicada día a día, se convierte en una fórmula segura para lograr el éxito y la realización personal.  A lo largo de esta charla se enfatiza que el talento y la motivación solo producen resultados sostenibles cuando van acompañados de constancia, organización y compromiso.\n\n Ingeniera Industrial, ex señorita Santander, presentadora en la TV regional y gran empresaria santandereana. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478830,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=b76Op6LSZLk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/b76Op6LSZLk/hqdefault.jpg",
        "title": "Disciplina, la fórmula que nunca falla  | Silvia Becerra | TEDxUIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:14.949682+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:01:08+00:00",
        "description": "Esta charla invita a reflexionar sobre las experiencias, aprendizajes y valores que cada persona carga a lo largo de su camino personal y profesional. A través de esta metáfora, se destaca la importancia de reconocer tanto los logros como las dificultades, entendiendo que cada vivencia aporta al crecimiento y a la construcción de la identidad. Estudiante de décimo semestre en Ingeniería Industrial con formación en gestión de producción, control de calidad y administración. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478831,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=D1qxgPIzxo8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/D1qxgPIzxo8/hqdefault.jpg",
        "title": "¿Qué traes hoy en tu maleta?  | Mabely Gamboa | TEDxUIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:15.050169+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:00:55+00:00",
        "description": "Una mirada a la importancia de los inicios en la vida laboral como un pilar fundamental en la formación profesional. A través de ejemplos y reflexiones, se destaca que el primer empleo no solo permite aplicar los conocimientos adquiridos, sino que también fortalece valores como la responsabilidad, la ética, la disciplina y el trabajo en equipo. Ingeniero Industrial, docente universitario y gerente general de soluciones garantizadas ps s.a.s. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478832,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wpQasueCCeI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wpQasueCCeI/hqdefault.jpg",
        "title": "La Primera experiencia es la base para un buen profesional | Edwin Montaña | TEDxUIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:15.194036+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:00:47+00:00",
        "description": "¿Qué nos hace valiosos en la era de la Inteligencia Artificial? Eduardo Marín, CEO de SEOContenidos, desafía el mito de que \"la información es poder\". En un mundo donde la IA democratiza el conocimiento, el verdadero diferencial no es lo que sabes, sino quién eres.\nA través de su charla \"El Algoritmo Humano\", Marín introduce el concepto del \"Líder sin cargo\": personas que transforman su entorno desde la empatía, la ética y la calidad humana, cualidades que ninguna tecnología puede replicar ni universidad certificar. Eduardo narra desde errores empresariales hasta lecciones de vida para demostrar que el éxito no reside en un título, sino en la capacidad de conectar y servir a los demás.\nBajo la premisa \"Vales por lo que eres y no por lo que sabes\", esta charla es una hoja de ruta para redefinir nuestro propósito. En un futuro donde el trabajo técnico será automatizado, ser una buena persona se convierte en la mayor ventaja competitiva y en la esencia del nuevo liderazgo. CEO de SEOCont",
        "id": 4478833,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5M4bov1mJg4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5M4bov1mJg4/hqdefault.jpg",
        "title": "El algoritmo humano y el valor que nadie puede enseñar | Eduardo Marín | TEDxColinas del Torbes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:15.324095+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T16:00:28+00:00",
        "description": "In this TEDx talk, Flow shares a simple decision-making framework called The Double Heart Method, based on two questions practiced while placing your hand on your heart:\n\n• What do you want?\n• What are you going to do about it?\n\nGrowing up as an immigrant and experiencing bullying, Flow learned early how powerful everyday decisions can be. The wisdom of his 100-year-old grandmother, Su Hsiang, helped him turn difficult moments into clarity and direction.\n\nThe Double Heart Method has since guided choices across many areas of life from business and education to creating songs for children.\n\nBecoming a father deepened this work. Parenthood reinforced the idea that values like empathy, calm, and confidence are passed on through daily choices and presence. This continues to shape Flow’s songs and storytelling for children.\n Flow is a YouTube creator, artist, and father focused on creating family-friendly content for young children. His work is shaped by growing up in the U.S. as an immigra",
        "id": 4478834,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Bq9tQ32xQBo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Bq9tQ32xQBo/hqdefault.jpg",
        "title": "How to decide with your heart | J Flow | TEDxOcala",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:15.506018+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:59:26+00:00",
        "description": "A hospital ward taught him how fragile life is; a bicycle taught him how to live. From personal loss to cycling across continents, this talk challenges our obsession with money and delayed happiness. It’s a reminder to choose health, purpose, and living—now. Ranjith Chanti, a fearless adventurer, is driven by a passion for exploration and human connection. Embarking on a daring World Bicycle Tour, he aims to traverse continents, transcending both geographical and personal limits. With each mile, he immerses himself in diverse cultures, landscapes, and narratives, welcoming the unexpected and transformative. Beyond a physical challenge, his journey exemplifies resilience, growth, and the adventurous spirit. Navigating rugged terrains and engaging in meaningful encounters, Ranjith demonstrates that the world is best savored at a bicycle’s pace—slow, sincere, and brimming with wonder. This talk was given at a TEDx event using the TED conference format but independently organized by a loc",
        "id": 4478835,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0oP5rBpapJ8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0oP5rBpapJ8/hqdefault.jpg",
        "title": "Pedaling Away from Regret | Ranjith Chanti | TEDxMLRIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:15.650880+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:57:04+00:00",
        "description": "Alecsandru Dunaev împărtășește experiența sa din lumea actoriei, punând accent pe curajul de a învăța prin experiență directă. El vorbește despre asumarea riscului și despre creșterea care apare atunci când te arunci în „apa adâncă”. Alecsandru Dunaev nu joacă doar roluri. El trăiește povești. Pe scena TEDxZavoiPark, Alecsandru ne va purta prin culisele unei vieți dedicate teatrului și filmului, unde fiecare replică este o mărturisire, iar fiecare personaj – o parte din sufletul lui.\n\n„Embrace the unknown! Cum să înveți să înoți aruncându-te în apă adâncă. Actorie, veselie, nebunie!”\n\nPentru el, scena este o punte între lumi – între realitate și vis, între tăcere și aplauze. Este locul unde curajul înfruntă frica, iar vulnerabilitatea devine forță. Povestea lui este dovada că drumul unui artist nu este niciodată drept, dar întotdeauna merită parcurs. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at http",
        "id": 4478836,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=inHgyL1q6Os",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/inHgyL1q6Os/hqdefault.jpg",
        "title": "Cum să înveți să înoți aruncându-te în apă adâncă | Alecsandru Dunaev | TEDxZavoi Park Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:15.798835+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:56:30+00:00",
        "description": "Resilience is not about never falling—it’s about rising every time with stronger belief. This talk explores how a strong belief system can shape mindset, fuel consistency, and turn challenges into opportunities. Through self-exploration, values-driven choices, and a problem-solving approach to life, the speaker reminds us that limits are often imposed by others—and accepted by ourselves. When you believe deeply, act consistently, and stay anchored in your values, you don’t just survive the world—you conquer it. Tanzeel Raza is the CEO of Meaningful Lives and a seasoned corporate trainer and coach, specializing in leadership development, personal productivity, and workplace wellbeing. With a strong emphasis on soft skills training, he empowers professionals and organizations to achieve sustainable growth through practical, human-centered learning experiences.\n\nHe has over 10 years of experience in training & transforming professionals and organizations in Australia and Pakistan. He has",
        "id": 4478837,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=y7RKmz2WRek",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/y7RKmz2WRek/hqdefault.jpg",
        "title": "Unbreakable: A story of resilience, courage and hope. | Tanzeel Raza | TEDxTCSGCA Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:16.084657+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:56:01+00:00",
        "description": "Original fireside title: \"Trail Roots: How Outdoor Recreation Shapes Regional Identity\" Gail Loveland (Moderator), Shawanna Kendrick, Sunshine Loveless, Paul Morley, and Ginny Smith are a dynamic group of leaders and voices connected by their dedication to meaningful dialogue, lived experience, and community impact in the outdoors. Together, they bring thoughtful perspectives and diverse expertise to foster engaging conversations that inform, inspire, and connect audiences. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478838,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FeDyTDXgGII",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FeDyTDXgGII/hqdefault.jpg",
        "title": "The Outdoors & Cities | G. Loveland, S. Kendrick, S. Loveless, P. Morley, G. Smith | TEDxChattanooga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:16.327750+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:55:37+00:00",
        "description": "When we stay rooted in creativity, connection, and community, we grow something lasting. Anthony Wiley Jr., Marcus Ellsworth, Chris Shaw, and Erika Roberts are a Chattanooga-based collective of creatives and collaborators, united by a shared commitment to community, craft, and authentic expression. Rooted in the culture and spirit of Chattanooga, they bring together diverse perspectives and talents to create work that is both locally grounded and broadly resonant. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478839,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3E9dAWn7s54",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3E9dAWn7s54/hqdefault.jpg",
        "title": "How Art Shapes Cities | Anthony Wiley, Erika Roberts, Marcus Ellsworth, Chris Shaw | TEDxChattanooga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:16.739225+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:55:23+00:00",
        "description": "Quilting reminds Savannah that she's capable of creativity for its own sake. It roots her in something that will last and brings a beautiful presence to an otherwise busy life. And she invites all of us to find craft, do something analog, to find our own inner peace. Savannah Wisham is a Creative Director and strategist with a deep passion for storytelling that resonates—online and off. With over a decade of experience in digital marketing, Savannah specializes in building magnetic creative that cuts through the noise and feels both bold and deeply human. She’s led strategy for some of the internet’s most beloved brands, all while championing creative teams and cultivating cultures of curiosity, empathy, and craft. But while her day job is digital, her grounding force is analog. Savannah is an avid quilter, drawn to the slow, intentional process of making something by hand—a tradition passed down from the women in her family. She finds presence and peace in the simple joys of gardenin",
        "id": 4478840,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Bc1Exjll940",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Bc1Exjll940/hqdefault.jpg",
        "title": "Craft for Connection | Savannah Wisham | TEDxChattanooga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:16.974837+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:55:15+00:00",
        "description": "As an architect and urban designer, my work is about making the physical form of the places that we all inhabit. There are two important parts to this work - hardware and software. My job is to understand and help create the hardware. The software is made up of things that happen all the time - by every one of you. Blythe Bailey is an urban designer, architect, and mobility professional with over two decades of experience shaping equitable, multimodal, and sustainable cities, mostly in Chattanooga. He founded the city’s first Department of Transportation and now Blythe is the director of design and connectivity for the Department of Parks and Outdoors, primarily responsible for the implementation of the city’s long-range parks and outdoors plan. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478841,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3UuuRZPpwFU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3UuuRZPpwFU/hqdefault.jpg",
        "title": "How public space creates community | Blythe Bailey | TEDxChattanooga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T17:08:17.296290+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:55:07+00:00",
        "description": "Both emotional experiences and songs are dynamic, changing over time - complex, synthesizing many components into a seemingly single event. And subjective, providing a significance that is profoundly colored by the individual. Hi, my name is Noah Perales! I am an Occupational Therapy Assistant and the owner/operator/creator of Regulation Beats™ - an emotion regulation program based on music production. I have been in the therapy field for 6 years as both a Registered Behavior Technician and OTA. I have experience in school-based, inpatient, residential treatment, and outpatient clinic settings, most of which have related to pediatrics. While working with clients across all these areas, I noticed that emotion regulation was a constant factor influencing their lives. Shortly after graduating from a music production program in Nashville, Tennessee, I couldn’t help but start to integrate music making tools into my treatment. The inner-workings of emotion regulation are beautifully fascina",
        "id": 4478842,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Zi0hUcBYbQw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Zi0hUcBYbQw/hqdefault.jpg",
        "title": "Peace Through Production: Transforming Emotions into Music  | Noah Perales | TEDxChattanooga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T15:51:58.824294+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:44:35+00:00",
        "description": "Avec le slogan Share What Art Gives, Chloé Louisin et Pauline Terestchenko propagent la danse comme un vecteur de lien social, outil politique, qui libère et rassemble.  Pauline et Chloé se rencontrent en 2018 dans un cours de danse. De leur expérience naît une conviction : la danse n’est pas qu’une performance, c’est un langage universel, qui permet de trouver sa place dans une société qui divise et exclut. En 2020, ce rêve devient S.W.A.G. Studio, un projet où danse et intégration sont intimement mêlées\n\nPauline et Chloé se rencontrent en 2018 dans un cours de danse. De leur expérience naît une conviction : la danse n’est pas qu’une performance, c’est un langage universel, qui permet de trouver sa place dans une société qui divise et exclut. En 2020, ce rêve devient S.W.A.G. Studio, un projet où danse et intégration sont intimement mêlées This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.te",
        "id": 4478166,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UelvszdgKPs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UelvszdgKPs/hqdefault.jpg",
        "title": "Danser pour lutter contre l’exclusion | Chloé Louisin & Pauline Terestchenko | TEDxLaRochelle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T15:51:59.135293+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:43:10+00:00",
        "description": "Découvrez la trajectoire de Clara Brachet. D'une rêveuse insouciante à l'art de réaliser les rêves d'adultes en fin de vie.  Clara, co-fondatrice d'Ambulance des Rêves a trouvé sa vocation : devenir Créatrice de Rêve. Une façon de se reconnecter profondément au sens de la vie. Un appel vibrant à transformer l'intention en action, jusqu'au dernier souffle. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478167,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9Msg1Y8Y_bE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9Msg1Y8Y_bE/hqdefault.jpg",
        "title": "Métier : créatrice de rêves. De l'insouciance à l'essentiel.  | Clara Brachet | TEDxLaRochelle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T15:51:59.471845+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:41:45+00:00",
        "description": "Passionné par l’impact des récits sur nos imaginaires (et donc sur notre société), Fabien Rodhain partage ses réflexions autour d’une question qui l'obsède : comment rester motivé, quand on a l’impression que le monde n’avance pas dans la bonne direction… bien au contraire ? Où porter son attention pour ne pas céder au découragement et continuer à aller de l’avant, individuellement et collectivement ? Engagé pour la transition écologique et humaine, Fabien a scénarisé un quinzaine de bandes dessinées, après avoir écrit plusieurs romans et pièces de théâtre. Il est également expert en intelligence collective. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4478168,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IsH10bUPz-o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IsH10bUPz-o/hqdefault.jpg",
        "title": "Le \"geste juste\" : un antidote au découragement écologique | Fabien Rodhain | TEDxLaRochelle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-05T15:51:59.750991+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-05T15:37:18+00:00",
        "description": "The talk explores why success must be redefined in a nonlinear world where careers no longer follow straight paths. The speaker explains that communication is the key skill for performing in such uncertainty. Sharing his own nonlinear journey as a professional photographer, teacher, and speaker, he highlights continuous learning through reading, listening to music, and selective digital content. The talk introduces four types of communication and presents “The First Theory” for success—foundation, innovation, resilience, synergy, and transformation—showing how adaptability, collaboration, and strong communication enable growth and success in today’s digital and AI-driven world.\n M Aminur Rahman is a Bangladeshi entrepreneur, educator, and the CEO of Checkmate Events, a leading photography and event management company. He is known for combining creative excellence with training and mentorship, helping young photographers build careers in Bangladesh.\nSince founding Checkmate Events, Ami",
        "id": 4478169,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XvUkM9EsyZA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XvUkM9EsyZA/hqdefault.jpg",
        "title": "How to communicate in a nonlinear world | M Aminur Rahman | TEDxJagannath University",
        "vote": 0
    }
]