[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T23:01:42.450810+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T22:36:00+00:00",
        "description": "Here it is &mdash; Betty Boop's first appearance, which became public domain on Thursday. It's a 60-second song halfway through a longer cartoon about a restaurant titled Dizzy Dishes. (The first scene makes it clear this is a restaurant of anthropomorphized animals &mdash; which explains why the as-yet-unnamed character has floppy dog ears...) \n\n\nSo Fleischer Studios has now warned that claiming Betty Boop is public domain \"is actually not true.\"\n\nVery often, different versions of a character that have been developed later can independently enjoy copyright protection. Also, names and depictions of a character very frequently will remain separately protected by trademark and other laws, regardless of whether the copyright has expired.\n \nBut is that really true? Fleischer Studios went out of business in 1946, notes Los Angeles Times columnist Michael Hiltzik:\n\nBy then it had sold the rights to its cartoons and the Betty Boop character. A new Fleischer Studios was formed in the 1970s by",
        "id": 4472814,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/04/2234236/fleischer-studios-criticized-for-claiming-betty-boop-is-not-public-domain",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fleischer Studios Criticized for Claiming Betty Boop is Not Public Domain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T21:32:21.052722+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T20:34:00+00:00",
        "description": "\"The ancient evolution of fish mouths could help solve a modern source of plastic pollution,\" writes ScienceAlert. \n\"Inspired by these natural filtration systems, scientists in Germany have invented a way to remove 99 percent of plastic particles from water. It's based on how some fish filter-feed to eat microscopic prey.\"\n\nThe research team has already filed a patent in Germany, and in the future, they hope their creation will help curb a ubiquitous form of plastic pollution that many are unaware of. Every time a load of laundry is done, millions of microplastics are washed from the fibers of our clothes into local waterways. By some estimates, up to 90 percent of plastic in 'sewage sludge' comes from washing machines. This material is then often used in agriculture as soil or fertilizer, possibly exposing those who eat the resulting crops to these pollutants... \n\nUnlike other plastic filtration systems on the market, this one reduces clogging by 85 percent.\n<p><div class=\"share_subm",
        "id": 4472404,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/04/1810209/fish-mouth-filter-removes-99-of-microplastics-from-laundry-waste",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Fish Mouth' Filter Removes 99% of Microplastics From Laundry Waste",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T20:19:25.148159+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T19:34:00+00:00",
        "description": "An anonymous reader shared this report from the Independent:\n\n Candida auris, a type of invasive yeast that can cause deadly infections in people with weakened immune systems, has infected at least 7,000 people [in 2025] across 27 U.S. states, according to data from the Centers for Disease Control and Prevention. The fungus, which can spread easily in healthcare settings such as hospitals and nursing homes, is gaining virulence and spreading at an \"alarming\" rate, the CDC says. Some strains of the fungus are particularly troublesome &mdash; and even considered a superbug &mdash; because they're resistant to all types of antibiotics used to treat fungal infections, The Hill reports. \n\nWhile healthy people may be able to fight off the infection on their own, the fungus can be deadly, especially in healthcare settings, where it can quickly spread amongst a vulnerable population. \"If you get infected with this pathogen that's resistant to any treatment, there's no treatment we can give yo",
        "id": 4472080,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/04/1732257/a-drug-resistant-superbug-fungus-infected-7000-americans-in-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Drug-Resistant 'Superbug' Fungus Infected 7,000 Americans in 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T20:19:25.370799+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T18:34:00+00:00",
        "description": "\"Microsoft is hoping that Windows can once again serve as the platform where it all takes off,\" reports GeekWire:\n\nA new framework called Agent Launchers, introduced in December as a preview in the latest Windows Insider build, lets developers register agents directly with the operating system. They can describe an agent through what's known as a manifest, which then lets the agent show up in the Windows taskbar, inside Microsoft Copilot, and across other apps... \"We are now entering a phase where we build rich scaffolds that orchestrate multiple models and agents; account for memory and entitlements; enable rich and safe tools use,\" Microsoft CEO Satya Nadella wrote in a blog post this week looking ahead to 2026. \"This is the engineering sophistication we must continue to build to get value out of AI in the real world....\" [The article notes Google's Gemini and Anthropic's Claude will also offer desktop-style agentsthrough browsers and native apps, while Amazon is developing \"frontie",
        "id": 4472081,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/04/0054205/microsofts-risky-bet-that-windows-can-become-the-platform-for-ai-agents",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft's Risky Bet That Windows Can Become The Platform for AI Agents",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T18:07:58.258964+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T17:34:00+00:00",
        "description": "Last June the Trump organization announced sales of a $499 \"T1\" smartphone with a gold-colored case. But though they originally were scheduled for release in August, this week a customer service representative for the wireless carrier told CBS News the device will be pushed back again, now until the end of January, \"attributing the delay to the recent U.S. government shutdown.\" \n\n\nSome context from The Independent:\n\n\nShortly after the phone was first announced, language describing it as \"Made in the USA\" was removed from its official website with the vague claim that the devices are \"brought to life\" in the United States posted in its place... Other information about the phone has also changed or been removed since its first unveiling, The Verge has reported. Trump Mobile initially indicated the T1's screen measured 6.78 inches, but now claims it is 6.25 inches. It also said the phone had 12GB of RAM; however, that claim has now also disappeared. \n\nAs the wait for the T1 continues, Tr",
        "id": 4471312,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/26/01/03/060203/trump-organizations-499-smartphone-delayed-again-now-until-the-end-of-january",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Organization's $499 Smartphone Delayed Again, Now Until the End of January",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T17:01:27.489968+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T16:34:00+00:00",
        "description": "An anonymous reader shared this report from the Linux news site Linuxiac:\n\n\nArchboot, a guided, user-friendly, menu-driven installer for Arch Linux that automates much of the traditional manual installation process (while still allowing advanced users to intervene when needed), has added the COSMIC desktop environment as a new selectable option. The change is part of Archboot's development cycle leading up to the 2026.01 release and is already available in the latest tagged builds. With COSMIC now integrated, users can boot an Archboot ISO and choose the desktop to either perform a full Arch Linux installation or start a live session for testing and recovery.\n\n\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Archboot+Adds+COSMIC+Desktop+as+a+New+Install+and+Rescue+Option%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F26%2F01%2F04%2F0432252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/",
        "id": 4470924,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/04/0432252/archboot-adds-cosmic-desktop-as-a-new-install-and-rescue-option",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Archboot Adds COSMIC Desktop as a New Install and Rescue Option",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T15:56:24.469754+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T15:34:00+00:00",
        "description": "The Wall Street Journal profiles \"the startup that is now one of a handful of chip makers nipping at the heels of Nvidia.\"\n\nFuriosa's AI chip is dubbed \"RNGD\" &mdash; short for renegade &mdash; and slated to start mass production this month. Valued at nearly $700 million based on its most recent fundraising, Furiosa has attracted interest from big tech firms. Last year, Meta Platforms attempted to acquire it, though the startup declined the offer. OpenAI used a Furiosa chip for a recent demonstration in Seoul. LG's AI research unit is testing the chip and said it offered \"excellent real-world performance.\" Furiosa said it is engaged in talks with potential customers. \n\nNvidia's graphic processing units, or GPUs, dominated the initial push to train AI models. But companies like Furiosa are betting that for the next stage &mdash; referred to as \"inference,\" or using AI models after they're trained &mdash; their specialty chips can be competitive. Furiosa makes chips called neural proces",
        "id": 4470519,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/03/2220248/furiosas-energy-efficient-npu-ai-chips-start-mass-production-this-month-challenging-nvidia",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Furiosa's Energy-Efficient 'NPU' AI Chips Start Mass Production This Month, Challenging Nvidia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T13:43:35.924858+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T12:34:00+00:00",
        "description": "The New York Times checks in on U.S. university researchers and start-ups trying to create domestic rare-earth processing facility:\n\n\nThere is too little money to be made in rare earths for the elements to be of much interest to mining giants, so the challenge of reestablishing a domestic industry has fallen to small companies like Phoenix Tailings, a Boston-area startup that runs the metal-making plant in Exeter, New Hampshire. A handful of other companies in the United States are processing rare earths in small quantities, including MP Materials, which owns a mine in Mountain Pass, California, and recently began producing rare-earth metal in Fort Worth, Texas. Similar efforts are underway in Europe and Asia. \"It's small volumes of low-value materials that are very expensive to process,\" said Elsa Olivetti, a materials science and engineering professor at the Massachusetts Institute of Technology. \"Meaning it's hard to make money.\" \n\nPhoenix Tailings' New Hampshire operation is about",
        "id": 4469792,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/04/0515201/the-us-effort-to-break-chinas-rare-earth-monopoly",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The US Effort to Break China's Rare-Earth Monopoly",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T09:25:43.505534+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T08:34:00+00:00",
        "description": "Reddit \"has overtaken TikTok as Britain's fourth most-visited social media service,\" reports the Guardian:\n\nThe platform has undergone huge growth over the last two years, with an 88% increase in the proportion of UK internet users it reaches. Three in five Brits online now encounter the site, up from a third in 2023, according to Ofcom. Its popularity is rising fastest with younger internet users. It is now the sixth most visited organisation of any kind by UK users aged between 18 and 24, up from 10th a year earlier. More than three-quarters of that cohort now visit it.... \n\nThe UK is a boom market for the platform, with the second largest user base behind the US, according to company records. A series of factors are behind its rise. However, a change in Google's search algorithms last year to prioritise helpful content from discussion forums appears to have been a significant driver. A recent deal with Google that allows the company to train its AI model on Reddit's content also ap",
        "id": 4468693,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/04/0547242/reddit-surges-in-popularity-to-overtake-tiktok-in-the-uk---thanks-to-googles-algorithm",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reddit Surges in Popularity to Overtake TikTok in the UK - Thanks to Google's Algorithm?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T06:13:55.502562+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T05:34:00+00:00",
        "description": "An anonymous reader shared this report from Electrek:\n\n\nTesla has released a new video showing a Tesla Semi truck charging at a massive 1.2 megawatts (MW), finally giving us a clear look at the charging speeds that will enable long-haul electric trucking...&gt; \n\nTesla claimed the Semi would be able to charge 70% of its range in 30 minutes. For a truck with a 500-mile range and an estimated battery pack of around 800-900 kWh, that requires an incredibly high power output, well beyond the 250 kW or even 350 kW we see on passenger EVs in North America. Today, the official Tesla Semi account on X released a video showing exactly that. In the video, Tesla engineers are seen monitoring a charging session where the power output climbs to a peak of 1.2 MW (1,206 kW). \n\n\nThis is consistent with the capabilities Tesla announced for its new V4 Cabinet architecture earlier this year. The V4 cabinets are designed to support 400V-1000V vehicle architectures and can deliver up to 500 kW for cars (l",
        "id": 4468079,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/03/238257/new-tesla-video-shows-tesla-semi-electric-truck-charging-at-12-mw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Tesla Video Shows Tesla Semi Electric Truck Charging at 1.2 MW",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-04T03:03:46.135415+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-04T02:34:00+00:00",
        "description": "An AI chatbot to answer probate questions from Alaska residents \"was supposed to be a three-month project,\" said Aubrie Souza, a consultant with the National Center for State Courts told NBC News. \"We are now at well over a year and three months, but that's all because of the due diligence that was required to get it right.\"\n\n\n\n\"With a project like this, we need to be 100% accurate, and that's really difficult with this technology,\" said Stacey Marz, the administrative director of the Alaska Court System and one of the Alaska Virtual Assistant (AVA) project's leaders... While many local government agencies are experimenting with AI tools for use cases ranging from helping residents apply for a driver's license to speeding up municipal employees' ability to process housing benefits, a recent Deloitte report found that less than 6% of local government practitioners were prioritizing AI as a tool to deliver services. The AVA experience demonstrates the barriers government agencies face i",
        "id": 4467493,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/03/2114246/what-happened-when-alaskas-court-system-tried-answering-questions-with-an-ai-chatbot",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happened When Alaska's Court System Tried Answering Questions with an AI Chatbot?",
        "vote": 0
    }
]