[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-06T17:06:13.304431+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-06T16:01:07+00:00",
        "description": "While Avatar: Frontiers of Pandora was already a fantastic open-world action adventure game when it first came out, the post-launch updates and content it has gotten since 2023 have only served to make it better. \n\nThe latest expansion, From the Ashes, brings with it an entirely new protagonist with his own story, set in a brand new map, and all of these come together to represent the open-world title at its best. \n\nAlong with tight pacing for its story, one of the most noteworthy things about From the Ashes is its protagonist, So’lek, who we got to see glimpses of in the base game and its expansions but gets quite a bit more fleshed out here. \n\nAlong with his own story arc, we also get to see a darker side to the war with the RDA, and a hostile clan even being one of the central antagonists of the story.",
        "id": 4488379,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=dJSBmQUeFb0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dJSBmQUeFb0/hqdefault.jpg",
        "title": "Avatar Frontiers of Pandora: From The Ashes DLC Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-06T14:51:42.684355+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-06T14:01:32+00:00",
        "description": "Do you know when stories stop being stories? As Andrzej Sapkowski wrote in The Witcher novel, The Time of Contempt, it's the moment someone begins to believe in them. So, how strongly do you believe that The Witcher 3: Wild Hunt will be getting a new expansion?\n\nLet's back up a bit. “New expansion?” you're probably asking. It all started back in June 2025 – a time when hype levels were through the roof, and almost anything seemed possible. Polish games insider Borys Nieśpielak said that CD Projekt RED was working on new DLC for The Witcher 3. Consider for a moment that the last expansion for the title was in 2016, and the last time that CD Projekt RED added any new content was with the Complete Edition. And anyone who played that Netflix series tie-in quest can affirm that it's...actually par for the course when compared to the developer's other free DLC.",
        "id": 4487110,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=nVUhHD5-NQE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nVUhHD5-NQE/hqdefault.jpg",
        "title": "The Witcher 3 New Story DLC - What The HELL Is Going On?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-06T10:36:44.409953+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-06T10:01:05+00:00",
        "description": "Between the PC gaming market being well and truly devastated by price increases, you can probably take solace in the fact that this year's best-looking titles won't require the heftiest hardware. \n\nWhile 2025 was a standout in terms of visual fidelity, 2026 is already proving more than a worthy contender, even this early. Check out 30 of the most graphically advanced games coming this year.",
        "id": 4485256,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=eSljpWRHTN4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eSljpWRHTN4/hqdefault.jpg",
        "title": "30 BEST LOOKING Games of 2026 To Look Forward To [Amazing Graphics]",
        "vote": 0
    }
]