[
    {
        "age": null,
        "album": "",
        "author": "Today I Found Out",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-06T21:08:41.946635+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-06T20:35:47+00:00",
        "description": "There’s an old engineer’s adage that goes: “If it moves but shouldn’t, use duct tape. If it doesn’t move but should, use WD-40.” For nearly 60 years, WD-40, the iconic “toolkit in a can,” has been helping amateurs and professionals alike out of all sorts of sticky mechanical jams. In addition to its intended purpose as a penetrating lubricant and anti-corrosion agent, thousands of other uses have been claimed for this miracle liquid, from removing chewing gum, crayon, and tape residue to repelling insects, attracting fish, and even treating arthritis. But can WD-40 really do all the things people claim? Who came up with this product, and what is even in those distinctive blue and yellow cans? And, most importantly, what does “WD-40” even stand for anyway? As it turns out, the world’s favourite multi-purpose spray has a surprisingly dark origin, one that dates back to the tensest days of the Cold War.\n\nIn this compilation video, we're looking at the origins of everyday things. Starting",
        "id": 4490654,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ctoG6Ez0npM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 862,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC64UiPJwM_e9AqAd7RiD7JA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ctoG6Ez0npM/hqdefault.jpg",
        "title": "Who Invented WD-40, Duct Tape, and Super Glue?",
        "vote": 0
    }
]