[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-03T00:02:37.286314+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T23:31:00+00:00",
        "description": "An anonymous reader shares a report: MTV shut down many of its last dedicated 24-hour music channels Dec. 31. The move, announced back in October, affected channels around the world, with the U.K. seeing five different MTV stations going dark. These include MTV Music, MTV 80s, MTV 90s, Club MTV, and MTV Live. As Consequence notes, MTV Music -- which launched in 2011 -- notably ended its run by airing the Buggles' \"Video Killed the Radio Star,\" the first visual to air when MTV launched in the United States in 1981. \n\nMTV's parent company, Paramount Skydance, is also expected to shutter music-only channels in Australia, Poland, France, and Brazil. Despite axing much of its dedicated music programming, MTV's flagship channels are still expected to keep broadcasting in the U.K. and elsewhere. Like in the U.S., these channels primarily air massively popular reality programs, as opposed to music videos.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"ht",
        "id": 4460599,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/26/01/02/1832200/mtvs-music-only-channels-go-off-the-air",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MTV's Music-Only Channels Go Off the Air",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T21:52:08.099877+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T21:30:00+00:00",
        "description": "A Guardian investigation published Friday found that Google's AI Overviews -- the generative AI summaries that appear at the top of search results -- are serving up inaccurate health information that experts say puts people at risk of harm. The investigation, which came after health groups, charities and professionals raised concerns, uncovered several cases of misleading medical advice despite Google's claims that the feature is \"helpful\" and \"reliable.\" \n\nIn one case described by experts as \"really dangerous,\" Google advised people with pancreatic cancer to avoid high-fat foods, which is the exact opposite of what should be recommended and could jeopardize a patient's chances of tolerating chemotherapy or surgery. A search for liver blood test normal ranges produced masses of numbers without accounting for nationality, sex, ethnicity or age of patients, potentially leaving people with serious liver disease thinking they are healthy. The company also incorrectly listed a pap test as ",
        "id": 4459926,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/02/188203/google-ai-overviews-put-people-at-risk-of-harm-with-misleading-health-advice",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google AI Overviews Put People at Risk of Harm With Misleading Health Advice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T20:48:29.967954+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T20:01:00+00:00",
        "description": "President Donald Trump signed into law this month a measure that prohibits anyone based in China and other adversarial countries from accessing the Pentagon's cloud computing systems. From a report: The ban, which is tucked inside the $900 billion defense policy law, was enacted in response to a ProPublica investigation this year that exposed how Microsoft used China-based engineers to service the Defense Department's computer systems for nearly a decade -- a practice that left some of the country's most sensitive data vulnerable to hacking from its leading cyber adversary. \n\nU.S.-based supervisors, known as \"digital escorts,\" were supposed to serve as a check on these foreign employees, but we found they often lacked the expertise needed to effectively supervise engineers with far more advanced technical skills. In the wake of the reporting, leading members of Congress called on the Defense Department to strengthen its security requirements while blasting Microsoft for what some Repu",
        "id": 4459572,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/02/182247/trump-signs-defense-bill-prohibiting-china-based-engineers-in-pentagon-it-work",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Signs Defense Bill Prohibiting China-Based Engineers in Pentagon IT Work",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T19:43:53.411365+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T19:01:00+00:00",
        "description": "AMD's share of processors among Steam users climbed to 47.27% in December 2025, a 4.66% jump in a single month that continues the company's steady encroachment on Intel's once-dominant position in the gaming CPU market. Intel held roughly 77% of the Steam Hardware Survey five years ago, and that lead has eroded considerably as AMD broke the 40% threshold in the third quarter of 2025 and kept climbing. \n\nThe gains came despite an ongoing memory shortage that has pushed DDR5 prices to record highs -- AMD's AM5 platform requires DDR5 exclusively, while Intel's Raptor Lake Refresh chips support both DDR4 and DDR5. Many gamers are turning to older AMD Zen 3 processors like the Ryzen 5 5800X, which topped Amazon's bestseller lists during the holiday period and work on DDR4-compatible platforms. Meanwhile, the proportion of Steam users running 32GB of RAM rose to 39.07%, nearly matching the 40.14% still on 16GB, as gamers likely rushed to upgrade before prices climbed further amid AI's deman",
        "id": 4459118,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/02/1719244/amd-closes-in-on-intel-in-latest-steam-hardware-survey",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AMD Closes in on Intel in Latest Steam Hardware Survey",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T18:36:10.724458+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T18:01:00+00:00",
        "description": "The International Publishers Association spent the past year promoting the slogan \"Democracy depends on reading,\" but Atlantic senior editor Adam Kirsch argues that this utilitarian pitch fundamentally misunderstands why people become readers in the first place. \n\nThe most recent Survey of Public Participation in the Arts found that less than half of Americans read a single book in 2022, and only 38% read a novel or short story. A University of Florida and University College London study found daily reading for pleasure fell 3% annually from 2003 to 2023. Among 13-year-olds, just 14% read for fun almost every day in 2023, down from 27% a decade earlier. \n\nKirsch says to stop treating reading as civic medicine. \"It would be better to describe reading not as a public duty but as a private pleasure, sometimes even a vice,\" he writes. When literature was considered transgressive, moralists couldn't stop people from buying dangerous books. Now that books are deemed virtuous, nobody picks t",
        "id": 4458665,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/02/1649208/reading-is-a-vice",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reading is a Vice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T17:33:38.786874+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T17:01:00+00:00",
        "description": "A new study [PDF] from Cardiff University analyzing a decade of the popular topical debate programme BBC Question Time found that the broadcaster's flagship political debate show relies disproportionately on journalists and pundits from right-wing media outlets, particularly those connected to The Spectator magazine. \n\nResearcher Matt Walsh examined 391 editions and 1,885 panellist appearances between 2014 and 2024. Journalists from right-leaning publications accounted for 59.59% of media guest slots, compared to just 16.86% for left-leaning outlets. The Spectator, a conservative magazine with a circulation of roughly 65,000, had an outsized presence among the most frequently booked guests. The study's list of top non-politician appearances reads like a roster of right-wing media figures. Isabel Oakeshott appeared 14 times, Julia Hartley-Brewer 13, Kate Andrews (formerly of the Institute for Economic Affairs and now at The Spectator) 13, and Tim Stanley of The Telegraph and Spectator ",
        "id": 4458246,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/02/1542232/a-decade-of-bbc-question-time-data-reveals-imbalance-in-journalist-guests",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Decade of BBC Question Time Data Reveals Imbalance in Journalist Guests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T16:28:46.058827+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T16:00:00+00:00",
        "description": "Yann LeCun, Meta's outgoing chief AI scientist and one of the pioneers credited with laying the groundwork for modern AI, has acknowledged that the company's Llama 4 language model had its benchmark results manipulated before its April 2025 release. In an interview with the Financial Times, LeCun said the \"results were fudged a little bit\" and that the team \"used different models for different benchmarks to give better results.\" \n\nLlama 4 was widely criticized as a flop at launch, and the company faced accusations of gaming benchmarks to make the model appear more capable than it was. LeCun said CEO Mark Zuckerberg was \"really upset and basically lost confidence in everyone who was involved\" in the release. \n\nZuckerberg subsequently \"sidelined the entire GenAI organisation,\" according to LeCun. \"A lot of people have left, a lot of people who haven't yet left will leave.\" LeCun himself is departing Meta after more than a decade to start a new AI research venture called Advanced Machine",
        "id": 4457767,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/02/1449227/results-were-fudged-departing-meta-ai-chief-confirms-llama-4-benchmark-manipulation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Results Were Fudged': Departing Meta AI Chief Confirms Llama 4 Benchmark Manipulation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T15:24:49.176702+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T15:01:00+00:00",
        "description": "Ghana has decided to deal with the viral spread of prophetic content on social media by setting up an official reporting mechanism for sensitive predictions, a move triggered by the August 2025 helicopter crash that killed the country's defence and environment ministers along with six others. \n\nAfter the accident, TikTok clips circulated showing pastors who claimed to have foreseen the disaster before it happened. Elvis Ankrah, the presidential envoy for inter-faith and ecumenical relations, now asks prophets to submit their predictions for review. \n\nCharismatic preacher-prophets have been a fixture of Ghanaian public life since Pentecostalism arrived in the 1980s, but social media has amplified their reach and made their claims increasingly outlandish. Police have threatened to arrest prophets who cannot prove their predictions eventually came true. Some two-thirds of Ghanaians favor giving divine intervention a role in politics. Ankrah recently declared that most prophecies submitte",
        "id": 4457286,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/02/0720202/ghana-tries-to-regulate-online-prophecies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ghana Tries To Regulate Online Prophecies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T14:18:18.629301+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T14:00:00+00:00",
        "description": "CBS News: The Atlanta Journal-Constitution has printed its final newspaper, marking the end of a 157-year chapter in Georgia history and officially transitioning the longtime publication into a fully digital news outlet. \n\nThe front-page story of the final print edition asks a fitting question: \"What is the future of local media in Atlanta?\" The historic last issue is also being sold for $8, a significant increase from the typical $2.00 price. \n\nWednesday, Dec. 31, marks the last day The AJC will be delivered to driveways across metro Atlanta. Starting Jan. 1, 2026, the newspaper will exist exclusively online, a move its leadership says reflects how readers now consume news and ensures the organization's future. \n\nAJC President and Publisher Andrew Morse said the decision was not made lightly, especially given how deeply the paper is woven into daily life for generations of readers. The move makes Atlanta the only major U.S. city without a daily printed newspaper.<p><div class=\"share_",
        "id": 4456816,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/02/074243/the-atlanta-journal-constitution-prints-final-newspaper-shifts-to-all-digital-format",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Atlanta Journal-Constitution Prints Final Newspaper, Shifts To All-Digital Format",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T12:08:22.239950+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T12:00:00+00:00",
        "description": "Nokia, the Finnish company whose iconic ringtone was played an estimated 1.8 billion times daily at the height of its mobile phone dominance and whose 3310 \"brick\" sold 126 million units, has reinvented itself again -- this time as a key piece of AI infrastructure. In October, Nvidia announced a $1 billion investment in Nokia and a strategic partnership to incorporate AI into telecommunications networks. \n\nThe company that was once worth $335 billion and controlled more than a quarter of the global handset market seemed destined for irrelevance after the iPhone's 2007 arrival. A last-ditch bet on Microsoft's Windows phone system in 2011 failed, and Nokia sold its devices division to Microsoft for $6.34 billion in 2014. Revenues had fallen from $44.27 billion in 2007 to $12.56 billion. Nokia rebuilt around its $2 billion acquisition of Siemens' networks stake in 2013, then added French network provider Alcatel-Lucent for $18.32 billion in 2015. \n\nCurrent CEO Justin Hotard, who took ove",
        "id": 4455982,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/02/070257/how-nokia-went-from-iphone-victim-to-1-billion-nvidia-deal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Nokia Went From iPhone Victim To $1 Billion Nvidia Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T08:57:12.943996+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T08:30:00+00:00",
        "description": "ASUS has informed its partners that prices on certain products will increase starting January 5, just days before the company is expected to unveil new hardware at CES. In a letter dated December 30 and obtained by Digitimes, the Taiwanese manufacturer pointed to rising costs for memory and storage components as the primary driver behind the adjustment. \n\nThe company specifically called out DRAM, NAND, and SSD pricing pressure stemming from what it described as \"structural volatility\" in the global supply chain tied to AI-driven demand. ASUS also cited shifts in capacity allocation by upstream suppliers and higher investment costs for advanced manufacturing processes.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=ASUS+Announces+Price+Hikes+Starting+January+5%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F26%2F01%2F02%2F0444220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_ico",
        "id": 4455032,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/02/0444220/asus-announces-price-hikes-starting-january-5",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ASUS Announces Price Hikes Starting January 5",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T05:42:48.253479+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T05:31:00+00:00",
        "description": "Australia's largest pension fund is planning to reduce its allocation to global equities this year, amid signs that the AI boom in the US stock market could be running out of steam. Financial Times: John Normand, head of investment strategy at the A$400bn (US$264bn) AustralianSuper, told the Financial Times that not only did valuations of big US tech companies look high relative to history, but the leverage being used to fund AI investment was increasing \"very rapidly,\" as was the pace of fundraising through mergers, venture capital and public listings. \n\n\"I can see some forces lining up that we are looking for less public equity allocation at some point next year. It's the basic intersection of the maturing AI cycle with a shift towards Fed[eral Reserve] tightening in 2027,\" Normand said in an interview.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Australia's+Biggest+Pension+Fund+To+Cut+Global+Stocks+Allocation+",
        "id": 4454271,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/01/1740215/australias-biggest-pension-fund-to-cut-global-stocks-allocation-on-ai-concerns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australia's Biggest Pension Fund To Cut Global Stocks Allocation on AI Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T03:34:52.035167+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T02:30:00+00:00",
        "description": "MacRumors: Apple is not expected to release a standard iPhone 18 model this year, according to a growing number of reports that suggest the company is planning a significant change to its long-standing annual iPhone launch cycle. \n\nDespite the immense success of the iPhone 17 in 2025, the iPhone 18 is not expected to arrive until the spring of 2027, leaving the iPhone 17 in the lineup as the latest standard model for over 18 months. This would mark the first time Apple skips an entire calendar year without releasing a new generation of its flagship non-Pro iPhone.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=No+Standard+iPhone+18+Launch+This+Year%2C+Reports+Suggest%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F26%2F01%2F01%2F1816240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%",
        "id": 4453767,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/26/01/01/1816240/no-standard-iphone-18-launch-this-year-reports-suggest",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "No Standard iPhone 18 Launch This Year, Reports Suggest",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T00:18:09.738122+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T00:02:00+00:00",
        "description": "Apple's Chinese manufacturing partner Luxshare halted production of the Vision Pro headset at the start of 2025, according to market research firm IDC, after the device shipped 390,000 units during its 2024 launch year. The $3,499 headset has also seen its digital advertising budget cut by more than 95% year to date in the US and UK, according to market intelligence group Sensor Tower. \n\nIDC expects Apple to ship just 45,000 new units in the fourth quarter of 2025. Apple launched an upgraded M5 version in October featuring a more powerful chip, extended battery life, and a redesigned headband. The company sells the device directly in 13 countries and did not expand availability in 2025.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=IDC+Estimates+Apple+Shipped+Just+45%2C000+Vision+Pros+Last+Quarter%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F26%2F01%2F01%2F189219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><",
        "id": 4453070,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/26/01/01/189219/idc-estimates-apple-shipped-just-45000-vision-pros-last-quarter",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "IDC Estimates Apple Shipped Just 45,000 Vision Pros Last Quarter",
        "vote": 0
    }
]