[
    {
        "age": null,
        "album": "",
        "author": "CppCon",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-02T15:30:05.596389+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-02T15:07:04+00:00",
        "description": "https://cppcon.org\n---\n\nZero-Overhead Abstractions: Building Flexible Vector Math Libraries with C++20 Concepts and Customization Points - Greg von Winckel - CppCon 2025\n---\n\nThis talk demonstrates how C++20's Concepts and Customization Point Objects (CPOs) provide a flexible, opt-in approach to vector algorithms—a compelling alternative to inheritance-based interfaces. Starting with foundational concepts and CPOs, we'll design mathematical abstractions that enable precise compile-time requirements with helpful diagnostics and clear error messages. \n \n Through a practical vector framework implementation, we'll explore patterns essential for high-performance scientific computing applications, including interpolation and iterative methods for linear and nonlinear systems. Attendees will learn how CPOs with intelligent fallbacks parallel the familiar base-class/override structure of OOP, providing similar code reuse and customization opportunities without inheritance entanglements, while",
        "id": 4457362,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=w4Vx3yFofWM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 420,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCMlGfpWw-RUdWX_JbLCukXg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/w4Vx3yFofWM/hqdefault.jpg",
        "title": "Zero-Overhead Abstractions: Building Vector Math Libraries with Concepts and Customization Points",
        "vote": 0
    }
]