[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T23:26:20.277927+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T22:34:00+00:00",
        "description": "Is there a trend? This week four different articles appeared on various tech-news sites with an author bragging about switching to Linux. \n\n\"Greetings from the year of Linux on my desktop,\" quipped the Verge's senior reviews editor, who finally \"got fed up and said screw it, I'm installing Linux. \n\n\nThey switched to CachyOS &mdash; just like this writer for the videogame magazine Escapist:\n\n\n\nI've had a fantastic time gaming on Linux. Valve's Windows-to-Linux translation layer, Proton, and even CachyOS' bundled fork have been working just fine. Of course, it's not perfect, and there's been a couple of instances where I've had to problem-solve something, but most of the time, any issues gaming on Linux have been fixed by swapping to another version of Proton. If you're deep in online games like Fortnite, Call of Duty, Destiny 2, GTAV or Battlefield 6, it might not be the best option to switch. These games feature anti-cheats that look for versions of Windows or even the heart of the OS",
        "id": 4526859,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/26/01/10/2231218/four-more-tech-bloggers-are-switching-to-linux",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Four More Tech Bloggers are Switching to Linux",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T22:12:43.757463+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T21:34:00+00:00",
        "description": "A founder of Twitter and a founder of Pinterest are now working on\n\"social media for people who hate social media,\" writes a Washington Post columnist. \n\n\"When I heard that this platform would harness AI to help us live more meaningful lives, I wanted to know more...\"\n\n\n\nTheir bid for redemption is West Co. &mdash; the Workshop for Emotional and Spiritual Technology Corporation &mdash; and the platform they're testing is called Tangle, a \"purpose discovery tool\" that uses AI to help users define their life purposes, then encourages them to set intentions toward achieving those purposes, reminds them periodically and builds a community of supporters to encourage steps toward meeting those intentions. \"A lot of people, myself included, have been on autopilot,\" Stone said. \"If all goes well, we'll introduce a lot of people to the concept of turning off autopilot.\" \n\nBut will all go well? The entrepreneurs have been at it for two years, and they've scrapped three iterations before even te",
        "id": 4526439,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/10/217207/ai-powered-social-media-app-hopes-to-build-more-purposeful-lives",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI-Powered Social Media App Hopes To Build More Purposeful Lives",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T22:12:43.882669+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T20:34:00+00:00",
        "description": "A new study \"compared how well top AI systems and human workers did at hundreds of real work assignments,\" reports the Washington Post. \n\n\nThey add that at least one example \"illustrates a disconnect three years after the release of ChatGPT that has implications for the whole economy.\"\n\n\nAI can accomplish many impressive tasks involving computer code, documents or images. That has prompted predictions that human work of many kinds could soon be done by computers alone. Bentley University and Gallup found in a survey [PDF] last year that about three-quarters of Americans expect AI to reduce the number of U.S. jobs over the next decade. But economic data shows the technology largely has not replaced workers. \n\n\n\nTo understand what work AI can do on its own today, researchers collected hundreds of examples of projects posted on freelancing platforms that humans had been paid to complete. They included tasks such as making 3D product animations, transcribing music, coding web video games ",
        "id": 4526440,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/10/1926209/ai-fails-at-most-remote-work-researchers-find",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Fails at Most Remote Work, Researchers Find",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T20:09:12.701338+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T19:34:00+00:00",
        "description": "Amazon \"has submitted plans for a large-format store near Chicago that would be larger than a Walmart Supercenter,\" reports CNBC:\n\n\nAs part of the plans, Amazon has proposed building a one-story, 229,000-square-foot building [on a 35-acre lot] in Orland Park, Illinois, that would offer a range of products, such as groceries, household essentials and general merchandise, the city said on Saturday. By comparison, Walmart's U.S. Supercenters typically average 179,000 square feet... The Orland Park Plan Commission approved Amazon's proposal on Tuesday, and it will now proceed to a vote from the full village board. That meeting is scheduled for January 19. \n\nIn a statement cited by CNBC, an Amazon spokesperson called it \"a new concept that we think customers will be excited about.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Plans+Massive+Superstore+Larger+Than+a+Walmart+Supercenter+Near+Chicago%3A+https%3A%2F%",
        "id": 4525914,
        "language": "en-us",
        "link": "https://slashdot.org/story/26/01/10/0652218/amazon-plans-massive-superstore-larger-than-a-walmart-supercenter-near-chicago",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Plans Massive Superstore Larger Than a Walmart Supercenter Near Chicago",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T18:59:56.330959+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T18:34:00+00:00",
        "description": "\"Scientists in China have made a breakthrough with fusion energy that could finally overcome one of the most stubborn barriers to realising the next-generation energy source,\" reports the Independent:\n\n\nA team from the Chinese Academy of Sciences (CAS) said its experimental nuclear reactor, dubbed the 'artificial Sun', achieved a plasma density that was previously thought impossible... Through a new process called plasma-wall self organisation, the CAS researchers were able to keep the plasma stable at unprecedented density levels. By pushing plasma density well past long-standing empirical limits, the researchers said fusion ignition can be achieved with far higher energy outputs. \"The findings suggest a practical and scalable pathway for extending density limits in tokamaks and next-generation burning plasma fusion devices,\" said Professor Ping Zhu from Huazhong University of Science and Technology, who so-led the research. \nProfessor Zhu's team now plan to apply this new method on ",
        "id": 4525587,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/10/0556228/chinas-artificial-sun-breaks-nuclear-fusion-limit-thought-to-be-impossible",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's 'Artificial Sun' Breaks Nuclear Fusion Limit Thought to Be Impossible",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T17:49:31.264497+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T17:34:00+00:00",
        "description": "This week Meta announced several new features for \"Meta Ray-Ban Display\" smartglasses: \n- A new teleprompter feature for the smart glasses (arriving in a phased rollout) \n- The ability to send messages on WhatsApp and Messenger by writing with your finger on any surface. (Available for those who sign up for an \"early access\" program). \n- \"Pedestrian navigation\" for 32 cities. (\"The 28 cities we launched Meta Ray-Ban Display with, plus Denver, Las Vegas, Portland, and Salt Lake City,\" and with more cities coming soon.) \nBut they also warned Meta Ray-Ban Display \"is a first-of-its-kind product with extremely limited inventory,\" saying they're delaying international expansion of sales due to inventory constraints &mdash; and also due to \"unprecedented\" demand in the U.S. CNBC reports:\n\n\"Since launching last fall, we've seen an overwhelming amount of interest, and as a result, product waitlists now extend well into 2026,\" Meta wrote in a blog post. Due to \"limited\" inventory, the company ",
        "id": 4525170,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/10/0429250/meta-announces-new-smartglasses-features-delays-international-rollout-claiming-unprecedented-demand",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Announces New Smartglasses Features, Delays International Rollout Claiming 'Unprecedented' Demand'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T17:49:31.596697+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T16:34:00+00:00",
        "description": "It will be the first medical evacuation from the International space station in its 25-year history. The Guardian reports:\n\nAn astronaut in the orbital laboratory reportedly fell ill with a \"serious\" but undisclosed issue. Nasa also had to cancel its first spacewalk of the year... The agency did not identify the astronaut or the medical problem, citing patient privacy. \"Because the astronaut is absolutely stable, this is not an emergent evacuation,\" [chief health and medical officer Dr. James] Polk said. \"We're not immediately disembarking and getting the astronaut down, but it leaves that lingering risk and lingering question as to what that diagnosis is, and that means there is some lingering risk for that astronaut onboard.\" \n\n\"SpaceX says it's Dragon spacecraft at the International Space Station is ready to return its four Crew-11 astronauts home in an unprecedented medical evacuation on Jan. 14 and 15,\" reports Space.com:\n\nThe SpaceX statement came on the heels of NASA's announce",
        "id": 4525171,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/10/168224/medical-evacuation-from-space-station-next-week-for-astronaut-in-stable-condition",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Medical Evacuation from Space Station Next Week for Astronaut in Stable Condition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T16:40:39.636504+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T15:34:00+00:00",
        "description": "Yes, a federal judge blocked an attempt by Texas at an app store age-verification law.\n\nBut this year Silicon Valley giants including Google and Apple \"are expected to fight hard against similar legislation,\" reports Politico, \"because of the vast legal liability it imposes on app stores and developers.\"\n\n\nIn Texas, Utah and Louisiana, parent advocates have linked up with conservative \"pro-family\" groups to pass laws forcing mobile app stores to verify user ages and require parental sign-off. If those rules hold up in court, companies like Google and Apple, which run the two largest app stores, would face massive legal liability... California has taken a different approach, passing its own age-verification law last year that puts liability on device manufacturers instead of app stores. That model has been better received by the tech lobby, and is now competing with the app-based approach in states like Ohio. In Washington D.C., a GOP-led bill modeled off of Texas' law is wending its w",
        "id": 4524765,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/26/01/10/054252/more-us-states-are-preparing-age-verification-laws-for-app-stores",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More US States Are Preparing Age-Verification Laws for App Stores",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T15:30:59.147369+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T14:34:00+00:00",
        "description": "The Free Software Foundation's president Ian Kelling is also their senior systems administrator. This week he shared an example of how \"the work we put in to making sure a program is free for us also makes it free for the rest of the world.\"\n\n\n\n\nDuring the COVID-19 pandemic, like everyone everywhere, the FSF increased its videoconferencing use, especially videoconferencing software that works in web browsers. We have experience hosting several different programs to accomplish this, and BigBlueButton was an important one for us for a while. It is a videoconferencing service which describes itself as a virtual classroom because of its many features designed for educational environments, such as a shared whiteboard... In BigBlueButton 2.2, the program used a freely licensed version of MongoDB, but it unintentionally picked up MongoDB's 2018 nonfree license change in versions 2.3 and 2.4. At the FSF, we noticed this [after a four-hour review] and raised the alarm with the BigBlueButton te",
        "id": 4524381,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/10/0539228/how-the-free-software-foundation-kept-a-videoconferencing-software-free",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How the Free Software Foundation Kept a Videoconferencing Software Free",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T13:12:33.563571+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from CBC.ca: A company largely owned by the French and U.K. governments is pitching Canada on a roughly $250-million plan to provide the military with secure satellite broadband coverage in the Arctic, CBC News has learned. Eutelsat, a rival to tech billionaire Elon Musk's Starlink, already provides some services to the Canadian military, but wants to deepen the partnership as Canada looks to diversify defence contracts away from suppliers in the United States.\n \nA proposal for Canada's Department of National Defence to join a French Ministry of Defence initiative involving Eutelsat was apparently raised by French President Emmanuel Macron with Prime Minister Mark Carney on the sidelines of last year's G7 summit in Alberta. The prime minister's first question, according to Eutelsat and French defence officials, was how the proposal would affect the Telesat Corporation, a former Canadian Crown corporation that was privatized in the 1990s.\n \nTelesat i",
        "id": 4523591,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/09/2349211/french-uk-starlink-rival-pitches-canada-on-sovereign-satellite-service",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "French-UK Starlink Rival Pitches Canada On 'Sovereign' Satellite Service",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T10:51:49.701990+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T10:00:00+00:00",
        "description": "Scientists are putting Einstein's claim that the speed of light is constant to the test. While researchers found no evidence that light's speed changes with energy, this null result dramatically tightens the constraints on quantum-gravity theories that predict even the tiniest violations. ScienceDaily reports: Special relativity rests on the principle that the laws of physics remain the same for all observers, regardless of how they are moving relative to one another. This idea is known as Lorentz invariance. Over time, Lorentz invariance became a foundational assumption in modern physics, especially within quantum theory. [...] One prediction shared by several Lorentz-invariance-violating quantum gravity models is that the speed of light may depend slightly on a photon's energy. Any such effect would have to be tiny to match existing experimental limits. However, it could become detectable at the highest photon energies, specifically in very-high-energy gamma rays.\n \nA research team ",
        "id": 4522883,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/26/01/09/2343237/scientists-tried-to-break-einsteins-speed-of-light-rule",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Tried To Break Einstein's Speed of Light Rule",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T07:59:06.752852+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T07:00:00+00:00",
        "description": "Meta has signed long-term nuclear power deals totaling more than 6 gigawatts to fuel its data centers: \"one from a startup, one from a smaller energy company, and one from a larger company that already operates several nuclear reactors in the U.S,\" reports TechCrunch. From the report: Oklo and TerraPower, two companies developing small modular reactors (SMR), each signed agreements with Meta to build multiple reactors, while Vistra is selling capacity from its existing power plants. [...] The deals are the result of a request for proposals that Meta issued in December 2024, in which Meta sought partners that could add between 1 to 4 gigawatts of generating capacity by the early 2030s. Much of the new power will flow through the PJM interconnection, a grid which covers 13 Mid-Atlantic and Midwestern states and has become saturated with data centers.\n \nThe 20-year agreement with Vistra will have the most immediate impact on Meta's energy needs. The tech company will buy a total of 2.1 g",
        "id": 4522349,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/09/2329256/meta-signs-deals-with-three-nuclear-companies-for-6-gw-of-power",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Signs Deals With Three Nuclear Companies For 6+ GW of Power",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T04:29:31.679752+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: [P]erhaps AI can, in fact, learn in a more human way -- by figuring out interesting questions to ask itself and attempting to find the right answer. A project from Tsinghua University, the Beijing Institute for General Artificial Intelligence (BIGAI), and Pennsylvania State University shows that AI can learn to reason in this way by playing with computer code. The researchers devised a system called Absolute Zero Reasoner (AZR) that first uses a large language model to generate challenging but solvable Python coding problems. It then uses the same model to solve those problems before checking its work by trying to run the code. And finally, the AZR system uses successes and failures as a signal to refine the original model, augmenting its ability to both pose better problems and solve them.\n \nThe team found that their approach significantly improved the coding and reasoning skills of both 7 billion and 14 billion parameter versions of th",
        "id": 4521714,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/09/2246235/ai-models-are-starting-to-learn-by-asking-themselves-questions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Models Are Starting To Learn By Asking Themselves Questions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T02:11:16.811487+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T02:02:00+00:00",
        "description": "Experts interviewed by NBC News warn that the rapid spread of AI-generated images and videos is accelerating an online trust breakdown, especially during fast-moving news events where context is scarce. From the report: President Donald Trump's Venezuela operation almost immediately spurred the spread of AI-generated images, old videos and altered photos across social media. On Wednesday, after an Immigration and Customs Enforcement officer fatally shot a woman in her car, many online circulated a fake, most likely AI-edited image of the scene that appears to be based on real video. Others used AI in attempts to digitally remove the mask of the ICE officer who shot her.\n \nThe confusion around AI content comes as many social media platforms, which pay creators for engagement, have given users incentives to recycle old photos and videos to ramp up emotion around viral news moments. The amalgam of misinformation, experts say, is creating a heightened erosion of trust online -- especially",
        "id": 4521220,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/26/01/09/2237231/ai-is-intensifying-a-collapse-of-trust-online-experts-say",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Is Intensifying a 'Collapse' of Trust Online, Experts Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T02:11:17.180741+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T01:25:00+00:00",
        "description": "Intel CEO Lip-Bu Tan says the company is \"going big time\" into its 14A (1.4nm-class) process, signaling confidence in yields and hinting at at least one external foundry customer. Tom's Hardware reports: Intel's 14A is expected to be production-ready in 2027, with early versions of process design kit (PDK) coming to external customers early this year. To that end, it is good to hear Intel's upbeat comments about 14A. Also, Tan's phrasing 'the customer' could indicate that Intel has at least one external client for 14A, implying that Intel Foundry will produce 14A chips for Intel Products and at least one more buyer.\n \nThe 14A production node will introduce Intel's 2nd Generation RibbonFET GAA transistors; 2nd Gen BSPDN called PowerDirect that will connect power directly to source and drain of transistors, enabling better power delivery (e.g., reducing transient voltage droop or clock stretching) and refined power controls; and Turbo Cells that optimize critical timing paths using high",
        "id": 4521221,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/26/01/09/2231201/intel-is-going-big-time-into-14a-says-ceo-lip-bu-tan",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel Is 'Going Big Time Into 14A,' Says CEO Lip-Bu Tan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T01:02:18.324747+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T00:45:00+00:00",
        "description": "Microsoft is testing a new Windows policy that lets IT administrators uninstall Microsoft Copilot from managed devices. The change rolls out via Windows Insider builds and works through standard management tools like Intune and SCCM. BleepingComputer reports: The new policy will apply to devices where the Microsoft 365 Copilot and Microsoft Copilot are both installed, the Microsoft Copilot app was not installed by the user, and the Microsoft Copilot app was not launched in the last 28 days. \"Admins can now uninstall Microsoft Copilot for a user in a targeted way by enabling a new policy titled RemoveMicrosoftCopilotApp,\" the Windows Insider team said.\n \n\"If this policy is enabled, the Microsoft Copilot app will be uninstalled, once. Users can still re-install if they choose to. This policy is available on Enterprise, Pro, and EDU SKUs. To enable this policy, open the Group policy editor and go to: User Configuration -&gt; Administrative Templates -&gt; Windows AI -&gt; Remove Microsof",
        "id": 4520923,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/26/01/09/2219256/microsoft-may-soon-allow-it-admins-to-uninstall-copilot",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft May Soon Allow IT Admins To Uninstall Copilot",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2026-01-10T01:02:18.505163+00:00",
        "date_dead_since": null,
        "date_published": "2026-01-10T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Search engine optimization, or SEO, is a big business. While some SEO practices are useful, much of the day-to-day SEO wisdom you see online amounts to superstition. An increasingly popular approach geared toward LLMs called \"content chunking\" may fall into that category. In the latest installment of Google's Search Off the Record podcast, John Mueller and Danny Sullivan say that breaking content down into bite-sized chunks for LLMs like Gemini is a bad idea.\n \nYou've probably seen websites engaging in content chunking and scratched your head, and for good reason -- this content isn't made for you. The idea is that if you split information into smaller paragraphs and sections, it is more likely to be ingested and cited by gen AI bots like Gemini. So you end up with short paragraphs, sometimes with just one or two sentences, and lots of subheads formatted like questions one might ask a chatbot.\n \nAccording to Google's Danny Sulliva",
        "id": 4520924,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/26/01/09/2117206/google-dont-make-bite-sized-content-for-llms-if-you-care-about-search-rank",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google: Don't Make 'Bite-Sized' Content For LLMs If You Care About Search Rank",
        "vote": 0
    }
]